#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BreachMinuspathMinusattractor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Breach-path-attractor.BP_Breach-path-attractor_C
// 0x0048 (0x05C0 - 0x0578)
class ABP_BreachMinuspathMinusattractor_C : public ASBZWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZPropDamageComponent*                SBZPropDamage;                                     // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Window;                                            // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_ReplicatedBinaryActor_windows_blinder_C* Blinder;                                           // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Particle_Count;                                    // 0x0598(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Particle_Size_Multiplier;                          // 0x059C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x05A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             DamageInstigator;                                  // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Do_Cosmetics;                                      // 0x05B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_BreachMinuspathMinusattractor(int32 EntryPoint);
	void OnStateChanged(ESBZGateState OldState, ESBZGateState NewState, bool bIsInitialStateChange);
	void BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature(class UActorComponent* PoolComponent, int32 Hits, bool bDoCosmetics, const struct FSBZPropDamageContext& DamageContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Breach-path-attractor_C">();
	}
	static class ABP_BreachMinuspathMinusattractor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BreachMinuspathMinusattractor_C>();
	}
};
static_assert(alignof(ABP_BreachMinuspathMinusattractor_C) == 0x000008, "Wrong alignment on ABP_BreachMinuspathMinusattractor_C");
static_assert(sizeof(ABP_BreachMinuspathMinusattractor_C) == 0x0005C0, "Wrong size on ABP_BreachMinuspathMinusattractor_C");
static_assert(offsetof(ABP_BreachMinuspathMinusattractor_C, UberGraphFrame) == 0x000578, "Member 'ABP_BreachMinuspathMinusattractor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BreachMinuspathMinusattractor_C, SBZPropDamage) == 0x000580, "Member 'ABP_BreachMinuspathMinusattractor_C::SBZPropDamage' has a wrong offset!");
static_assert(offsetof(ABP_BreachMinuspathMinusattractor_C, Window) == 0x000588, "Member 'ABP_BreachMinuspathMinusattractor_C::Window' has a wrong offset!");
static_assert(offsetof(ABP_BreachMinuspathMinusattractor_C, Blinder) == 0x000590, "Member 'ABP_BreachMinuspathMinusattractor_C::Blinder' has a wrong offset!");
static_assert(offsetof(ABP_BreachMinuspathMinusattractor_C, Particle_Count) == 0x000598, "Member 'ABP_BreachMinuspathMinusattractor_C::Particle_Count' has a wrong offset!");
static_assert(offsetof(ABP_BreachMinuspathMinusattractor_C, Particle_Size_Multiplier) == 0x00059C, "Member 'ABP_BreachMinuspathMinusattractor_C::Particle_Size_Multiplier' has a wrong offset!");
static_assert(offsetof(ABP_BreachMinuspathMinusattractor_C, Color) == 0x0005A0, "Member 'ABP_BreachMinuspathMinusattractor_C::Color' has a wrong offset!");
static_assert(offsetof(ABP_BreachMinuspathMinusattractor_C, DamageInstigator) == 0x0005B0, "Member 'ABP_BreachMinuspathMinusattractor_C::DamageInstigator' has a wrong offset!");
static_assert(offsetof(ABP_BreachMinuspathMinusattractor_C, Do_Cosmetics) == 0x0005B8, "Member 'ABP_BreachMinuspathMinusattractor_C::Do_Cosmetics' has a wrong offset!");

}

