#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BikeRental_01_Map_Screen

#include "Basic.hpp"

#include "bp_screen_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BikeRental_01_Map_Screen.BP_BikeRental_01_Map_Screen_C
// 0x0020 (0x0350 - 0x0330)
class ABP_BikeRental_01_Map_Screen_C final : public Abp_screen_C
{
public:
	class URectLightComponent*                    RectLight_2;                                       // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight__2;                                      // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_1;                                       // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight;                                         // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BikeRental_01_Map_Screen_C">();
	}
	static class ABP_BikeRental_01_Map_Screen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BikeRental_01_Map_Screen_C>();
	}
};
static_assert(alignof(ABP_BikeRental_01_Map_Screen_C) == 0x000008, "Wrong alignment on ABP_BikeRental_01_Map_Screen_C");
static_assert(sizeof(ABP_BikeRental_01_Map_Screen_C) == 0x000350, "Wrong size on ABP_BikeRental_01_Map_Screen_C");
static_assert(offsetof(ABP_BikeRental_01_Map_Screen_C, RectLight_2) == 0x000330, "Member 'ABP_BikeRental_01_Map_Screen_C::RectLight_2' has a wrong offset!");
static_assert(offsetof(ABP_BikeRental_01_Map_Screen_C, RectLight__2) == 0x000338, "Member 'ABP_BikeRental_01_Map_Screen_C::RectLight__2' has a wrong offset!");
static_assert(offsetof(ABP_BikeRental_01_Map_Screen_C, RectLight_1) == 0x000340, "Member 'ABP_BikeRental_01_Map_Screen_C::RectLight_1' has a wrong offset!");
static_assert(offsetof(ABP_BikeRental_01_Map_Screen_C, RectLight) == 0x000348, "Member 'ABP_BikeRental_01_Map_Screen_C::RectLight' has a wrong offset!");

}

