#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Blinder_Controller

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Blinder_Controller.BP_Blinder_Controller_C.ExecuteUbergraph_BP_Blinder_Controller
// 0x0038 (0x0038 - 0x0000)
struct BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseInteractableComponent*          K2Node_ComponentBoundEvent_Interactable;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                K2Node_ComponentBoundEvent_Interactor;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ReplicatedBinaryActor_windows_blinder_C* CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller) == 0x000008, "Wrong alignment on BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller");
static_assert(sizeof(BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller) == 0x000038, "Wrong size on BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller");
static_assert(offsetof(BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller, EntryPoint) == 0x000000, "Member 'BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller, K2Node_ComponentBoundEvent_Interactable) == 0x000008, "Member 'BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller, K2Node_ComponentBoundEvent_Interactor) == 0x000010, "Member 'BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller::K2Node_ComponentBoundEvent_Interactor' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller, K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor) == 0x000018, "Member 'BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller::K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller, CallFunc_Not_PreBool_ReturnValue) == 0x000035, "Member 'BP_Blinder_Controller_C_ExecuteUbergraph_BP_Blinder_Controller::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_Blinder_Controller.BP_Blinder_Controller_C.BndEvt__BP_Blinder_Controller_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_Blinder_Controller_C_BndEvt__BP_Blinder_Controller_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature final
{
public:
	class USBZBaseInteractableComponent*          Interactable_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocallyControlledInteractor;                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Blinder_Controller_C_BndEvt__BP_Blinder_Controller_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature) == 0x000008, "Wrong alignment on BP_Blinder_Controller_C_BndEvt__BP_Blinder_Controller_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature");
static_assert(sizeof(BP_Blinder_Controller_C_BndEvt__BP_Blinder_Controller_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature) == 0x000018, "Wrong size on BP_Blinder_Controller_C_BndEvt__BP_Blinder_Controller_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature");
static_assert(offsetof(BP_Blinder_Controller_C_BndEvt__BP_Blinder_Controller_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, Interactable_0) == 0x000000, "Member 'BP_Blinder_Controller_C_BndEvt__BP_Blinder_Controller_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::Interactable_0' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_BndEvt__BP_Blinder_Controller_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, Interactor) == 0x000008, "Member 'BP_Blinder_Controller_C_BndEvt__BP_Blinder_Controller_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_BndEvt__BP_Blinder_Controller_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, bIsLocallyControlledInteractor) == 0x000010, "Member 'BP_Blinder_Controller_C_BndEvt__BP_Blinder_Controller_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::bIsLocallyControlledInteractor' has a wrong offset!");

// Function BP_Blinder_Controller.BP_Blinder_Controller_C.UserConstructionScript
// 0x00E0 (0x00E0 - 0x0000)
struct BP_Blinder_Controller_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ReplicatedBinaryActor_windows_blinder_C* CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0050(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Blinder_Controller_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_Blinder_Controller_C_UserConstructionScript");
static_assert(sizeof(BP_Blinder_Controller_C_UserConstructionScript) == 0x0000E0, "Wrong size on BP_Blinder_Controller_C_UserConstructionScript");
static_assert(offsetof(BP_Blinder_Controller_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_Blinder_Controller_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Blinder_Controller_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Blinder_Controller_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_Blinder_Controller_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_Blinder_Controller_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_Blinder_Controller_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_UserConstructionScript, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'BP_Blinder_Controller_C_UserConstructionScript::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_UserConstructionScript, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000050, "Member 'BP_Blinder_Controller_C_UserConstructionScript::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function BP_Blinder_Controller.BP_Blinder_Controller_C.setEnabled
// 0x0002 (0x0002 - 0x0000)
struct BP_Blinder_Controller_C_SetEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Blinder_Controller_C_SetEnabled) == 0x000001, "Wrong alignment on BP_Blinder_Controller_C_SetEnabled");
static_assert(sizeof(BP_Blinder_Controller_C_SetEnabled) == 0x000002, "Wrong size on BP_Blinder_Controller_C_SetEnabled");
static_assert(offsetof(BP_Blinder_Controller_C_SetEnabled, Enabled) == 0x000000, "Member 'BP_Blinder_Controller_C_SetEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(BP_Blinder_Controller_C_SetEnabled, CallFunc_IsServer_ReturnValue) == 0x000001, "Member 'BP_Blinder_Controller_C_SetEnabled::CallFunc_IsServer_ReturnValue' has a wrong offset!");

}

