#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BreachMinuspathMinusattractor

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function BP_Breach-path-attractor.BP_Breach-path-attractor_C.ExecuteUbergraph_BP_Breach-path-attractor
// 0x0040 (0x0040 - 0x0000)
struct BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZGateState                                 K2Node_Event_OldState;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZGateState                                 K2Node_Event_NewState;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialStateChange;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetState_ReturnValue;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_ComponentBoundEvent_PoolComponent;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Hits;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bDoCosmetics;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPropDamageContext                  K2Node_ComponentBoundEvent_DamageContext;          // 0x0020(0x0018)(ConstParm, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor) == 0x000008, "Wrong alignment on BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor");
static_assert(sizeof(BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor) == 0x000040, "Wrong size on BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor, EntryPoint) == 0x000000, "Member 'BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor, K2Node_Event_OldState) == 0x000004, "Member 'BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor::K2Node_Event_OldState' has a wrong offset!");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor, K2Node_Event_NewState) == 0x000005, "Member 'BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor, K2Node_Event_bIsInitialStateChange) == 0x000006, "Member 'BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor::K2Node_Event_bIsInitialStateChange' has a wrong offset!");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor, K2Node_SwitchEnum_CmpSuccess) == 0x000007, "Member 'BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor, CallFunc_SetState_ReturnValue) == 0x000008, "Member 'BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor::CallFunc_SetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor, CallFunc_IsDedicatedServer_ReturnValue) == 0x000009, "Member 'BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor, K2Node_ComponentBoundEvent_PoolComponent) == 0x000010, "Member 'BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor::K2Node_ComponentBoundEvent_PoolComponent' has a wrong offset!");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor, K2Node_ComponentBoundEvent_Hits) == 0x000018, "Member 'BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor::K2Node_ComponentBoundEvent_Hits' has a wrong offset!");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor, K2Node_ComponentBoundEvent_bDoCosmetics) == 0x00001C, "Member 'BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor::K2Node_ComponentBoundEvent_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor, K2Node_ComponentBoundEvent_DamageContext) == 0x000020, "Member 'BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor::K2Node_ComponentBoundEvent_DamageContext' has a wrong offset!");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor, K2Node_SwitchInteger_CmpSuccess) == 0x000038, "Member 'BP_BreachMinuspathMinusattractor_C_ExecuteUbergraph_BP_BreachMinuspathMinusattractor::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BP_Breach-path-attractor.BP_Breach-path-attractor_C.OnStateChanged
// 0x0003 (0x0003 - 0x0000)
struct BP_BreachMinuspathMinusattractor_C_OnStateChanged final
{
public:
	ESBZGateState                                 OldState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZGateState                                 NewState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialStateChange;                             // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BreachMinuspathMinusattractor_C_OnStateChanged) == 0x000001, "Wrong alignment on BP_BreachMinuspathMinusattractor_C_OnStateChanged");
static_assert(sizeof(BP_BreachMinuspathMinusattractor_C_OnStateChanged) == 0x000003, "Wrong size on BP_BreachMinuspathMinusattractor_C_OnStateChanged");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_OnStateChanged, OldState) == 0x000000, "Member 'BP_BreachMinuspathMinusattractor_C_OnStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_OnStateChanged, NewState) == 0x000001, "Member 'BP_BreachMinuspathMinusattractor_C_OnStateChanged::NewState' has a wrong offset!");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_OnStateChanged, bIsInitialStateChange) == 0x000002, "Member 'BP_BreachMinuspathMinusattractor_C_OnStateChanged::bIsInitialStateChange' has a wrong offset!");

// Function BP_Breach-path-attractor.BP_Breach-path-attractor_C.BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct BP_BreachMinuspathMinusattractor_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature final
{
public:
	class UActorComponent*                        PoolComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Hits;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoCosmetics;                                      // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPropDamageContext                  DamageContext;                                     // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_BreachMinuspathMinusattractor_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_BreachMinuspathMinusattractor_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature");
static_assert(sizeof(BP_BreachMinuspathMinusattractor_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature) == 0x000028, "Wrong size on BP_BreachMinuspathMinusattractor_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature, PoolComponent) == 0x000000, "Member 'BP_BreachMinuspathMinusattractor_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature::PoolComponent' has a wrong offset!");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature, Hits) == 0x000008, "Member 'BP_BreachMinuspathMinusattractor_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature::Hits' has a wrong offset!");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature, bDoCosmetics) == 0x00000C, "Member 'BP_BreachMinuspathMinusattractor_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature::bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_BreachMinuspathMinusattractor_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature, DamageContext) == 0x000010, "Member 'BP_BreachMinuspathMinusattractor_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature::DamageContext' has a wrong offset!");

}

