#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bicycle_Collision

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Bicycle_Collision.BP_Bicycle_Collision_C
// 0x0020 (0x02C8 - 0x02A8)
class ABP_Bicycle_Collision_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Bicycle_Collision(int32 EntryPoint);
	void BndEvt__BP_Bicycle_Collision_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Bicycle_Collision_C">();
	}
	static class ABP_Bicycle_Collision_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Bicycle_Collision_C>();
	}
};
static_assert(alignof(ABP_Bicycle_Collision_C) == 0x000008, "Wrong alignment on ABP_Bicycle_Collision_C");
static_assert(sizeof(ABP_Bicycle_Collision_C) == 0x0002C8, "Wrong size on ABP_Bicycle_Collision_C");
static_assert(offsetof(ABP_Bicycle_Collision_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_Bicycle_Collision_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Bicycle_Collision_C, Ak) == 0x0002B0, "Member 'ABP_Bicycle_Collision_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_Bicycle_Collision_C, Box) == 0x0002B8, "Member 'ABP_Bicycle_Collision_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Bicycle_Collision_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABP_Bicycle_Collision_C::DefaultSceneRoot' has a wrong offset!");

}

