#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseSabotagePoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BaseSabotagePoint.BP_BaseSabotagePoint_C
// 0x0020 (0x0378 - 0x0358)
class ABP_BaseSabotagePoint_C : public ASBZSabotagePoint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZAIObjectiveComponent*               SBZAIObjective;                                    // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSabotageCompleteInteraction;                     // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnSabotageCompleteInteraction__DelegateSignature();
	void ExecuteUbergraph_BP_BaseSabotagePoint(int32 EntryPoint);
	void BndEvt__BP_BaseSabotagePoint_InteractableComponent_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BaseSabotagePoint_C">();
	}
	static class ABP_BaseSabotagePoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BaseSabotagePoint_C>();
	}
};
static_assert(alignof(ABP_BaseSabotagePoint_C) == 0x000008, "Wrong alignment on ABP_BaseSabotagePoint_C");
static_assert(sizeof(ABP_BaseSabotagePoint_C) == 0x000378, "Wrong size on ABP_BaseSabotagePoint_C");
static_assert(offsetof(ABP_BaseSabotagePoint_C, UberGraphFrame) == 0x000358, "Member 'ABP_BaseSabotagePoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BaseSabotagePoint_C, SBZAIObjective) == 0x000360, "Member 'ABP_BaseSabotagePoint_C::SBZAIObjective' has a wrong offset!");
static_assert(offsetof(ABP_BaseSabotagePoint_C, OnSabotageCompleteInteraction) == 0x000368, "Member 'ABP_BaseSabotagePoint_C::OnSabotageCompleteInteraction' has a wrong offset!");

}

