#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CopyMachine_01_SCR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "bp_screen_classes.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CopyMachine_01_SCR.BP_CopyMachine_01_SCR_C
// 0x0018 (0x0348 - 0x0330)
class ABP_CopyMachine_01_SCR_C final : public Abp_screen_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_CopyMachine_01_SCR_C;            // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZNiagaraWwiseComponentNonOpt*        SBZNiagaraWwiseComponentNonOpt;                    // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CopyMachine_01_SCR(int32 EntryPoint);
	void BndEvt__BP_CopyMachine_01_SCR_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature(ESBZCosmeticDestructionType Type, const struct FSBZCosmeticDestructionContext& HitContext);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CopyMachine_01_SCR_C">();
	}
	static class ABP_CopyMachine_01_SCR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CopyMachine_01_SCR_C>();
	}
};
static_assert(alignof(ABP_CopyMachine_01_SCR_C) == 0x000008, "Wrong alignment on ABP_CopyMachine_01_SCR_C");
static_assert(sizeof(ABP_CopyMachine_01_SCR_C) == 0x000348, "Wrong size on ABP_CopyMachine_01_SCR_C");
static_assert(offsetof(ABP_CopyMachine_01_SCR_C, UberGraphFrame_BP_CopyMachine_01_SCR_C) == 0x000330, "Member 'ABP_CopyMachine_01_SCR_C::UberGraphFrame_BP_CopyMachine_01_SCR_C' has a wrong offset!");
static_assert(offsetof(ABP_CopyMachine_01_SCR_C, Ak) == 0x000338, "Member 'ABP_CopyMachine_01_SCR_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_CopyMachine_01_SCR_C, SBZNiagaraWwiseComponentNonOpt) == 0x000340, "Member 'ABP_CopyMachine_01_SCR_C::SBZNiagaraWwiseComponentNonOpt' has a wrong offset!");

}

