#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DesktopComputer_01_Monitor

#include "Basic.hpp"

#include "E_ComputerScreens_01_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DesktopComputer_01_Monitor.BP_DesktopComputer_01_Monitor_C.ExecuteUbergraph_BP_DesktopComputer_01_Monitor
// 0x00A0 (0x00A0 - 0x0000)
struct BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZCosmeticDestructionType                   K2Node_ComponentBoundEvent_Type;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         K2Node_ComponentBoundEvent_HitContext;             // 0x006C(0x0030)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor) == 0x000010, "Wrong alignment on BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor");
static_assert(sizeof(BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor) == 0x0000A0, "Wrong size on BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor, EntryPoint) == 0x000000, "Member 'BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor, CallFunc_IsDedicatedServer_ReturnValue) == 0x000040, "Member 'BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor, CallFunc_TransformLocation_ReturnValue) == 0x000044, "Member 'BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000050, "Member 'BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000058, "Member 'BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor, K2Node_SwitchInteger_CmpSuccess) == 0x00005C, "Member 'BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor, CallFunc_GetComponentByClass_ReturnValue) == 0x000060, "Member 'BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor, K2Node_ComponentBoundEvent_Type) == 0x000068, "Member 'BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor::K2Node_ComponentBoundEvent_Type' has a wrong offset!");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor, K2Node_ComponentBoundEvent_HitContext) == 0x00006C, "Member 'BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor::K2Node_ComponentBoundEvent_HitContext' has a wrong offset!");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x00009C, "Member 'BP_DesktopComputer_01_Monitor_C_ExecuteUbergraph_BP_DesktopComputer_01_Monitor::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");

// Function BP_DesktopComputer_01_Monitor.BP_DesktopComputer_01_Monitor_C.BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature
// 0x0034 (0x0034 - 0x0000)
struct BP_DesktopComputer_01_Monitor_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature final
{
public:
	ESBZCosmeticDestructionType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         HitContext;                                        // 0x0004(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_DesktopComputer_01_Monitor_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000004, "Wrong alignment on BP_DesktopComputer_01_Monitor_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(sizeof(BP_DesktopComputer_01_Monitor_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000034, "Wrong size on BP_DesktopComputer_01_Monitor_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature, Type) == 0x000000, "Member 'BP_DesktopComputer_01_Monitor_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature, HitContext) == 0x000004, "Member 'BP_DesktopComputer_01_Monitor_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature::HitContext' has a wrong offset!");

// Function BP_DesktopComputer_01_Monitor.BP_DesktopComputer_01_Monitor_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct BP_DesktopComputer_01_Monitor_C_UserConstructionScript final
{
public:
	E_ComputerScreens_01                          Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DesktopComputer_01_Monitor_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_DesktopComputer_01_Monitor_C_UserConstructionScript");
static_assert(sizeof(BP_DesktopComputer_01_Monitor_C_UserConstructionScript) == 0x000028, "Wrong size on BP_DesktopComputer_01_Monitor_C_UserConstructionScript");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_UserConstructionScript, Temp_byte_Variable) == 0x000000, "Member 'BP_DesktopComputer_01_Monitor_C_UserConstructionScript::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_UserConstructionScript, Temp_object_Variable) == 0x000008, "Member 'BP_DesktopComputer_01_Monitor_C_UserConstructionScript::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_UserConstructionScript, Temp_object_Variable_1) == 0x000010, "Member 'BP_DesktopComputer_01_Monitor_C_UserConstructionScript::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_UserConstructionScript, Temp_object_Variable_2) == 0x000018, "Member 'BP_DesktopComputer_01_Monitor_C_UserConstructionScript::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_DesktopComputer_01_Monitor_C_UserConstructionScript, K2Node_Select_Default) == 0x000020, "Member 'BP_DesktopComputer_01_Monitor_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");

}

