#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DisplayWallCabinet_01_Glass_04

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DisplayWallCabinet_01_Glass_04.BP_DisplayWallCabinet_01_Glass_04_C
// 0x0038 (0x04A0 - 0x0468)
class ABP_DisplayWallCabinet_01_Glass_04_C final : public ASBZDisplayCase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                OpenSidewaysTimeline_NewTrack_0_EA2B8949491119864422968A84D8CDAB; // 0x0470(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OpenSidewaysTimeline__Direction_EA2B8949491119864422968A84D8CDAB; // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47D[0x3];                                      // 0x047D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OpenSidewaysTimeline;                              // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               StartRotation;                                     // 0x0488(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               EndRotation;                                       // 0x0494(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_DisplayWallCabinet_01_Glass_04(int32 EntryPoint);
	void BndEvt__BP_DisplayWallCabinet_01_Glass_04_InteractableComponent_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void BP_OnCuttingEnabledChanged(bool bCuttingEnabled);
	void BP_OnStateChanged(ESBZDisplayCaseState OldState, ESBZDisplayCaseState NewState, bool bDoCosmetics);
	void OnCutCompleted();
	void OpenSidewaysTimeline__UpdateFunc();
	void OpenSidewaysTimeline__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DisplayWallCabinet_01_Glass_04_C">();
	}
	static class ABP_DisplayWallCabinet_01_Glass_04_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DisplayWallCabinet_01_Glass_04_C>();
	}
};
static_assert(alignof(ABP_DisplayWallCabinet_01_Glass_04_C) == 0x000008, "Wrong alignment on ABP_DisplayWallCabinet_01_Glass_04_C");
static_assert(sizeof(ABP_DisplayWallCabinet_01_Glass_04_C) == 0x0004A0, "Wrong size on ABP_DisplayWallCabinet_01_Glass_04_C");
static_assert(offsetof(ABP_DisplayWallCabinet_01_Glass_04_C, UberGraphFrame) == 0x000468, "Member 'ABP_DisplayWallCabinet_01_Glass_04_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DisplayWallCabinet_01_Glass_04_C, OpenSidewaysTimeline_NewTrack_0_EA2B8949491119864422968A84D8CDAB) == 0x000470, "Member 'ABP_DisplayWallCabinet_01_Glass_04_C::OpenSidewaysTimeline_NewTrack_0_EA2B8949491119864422968A84D8CDAB' has a wrong offset!");
static_assert(offsetof(ABP_DisplayWallCabinet_01_Glass_04_C, OpenSidewaysTimeline__Direction_EA2B8949491119864422968A84D8CDAB) == 0x00047C, "Member 'ABP_DisplayWallCabinet_01_Glass_04_C::OpenSidewaysTimeline__Direction_EA2B8949491119864422968A84D8CDAB' has a wrong offset!");
static_assert(offsetof(ABP_DisplayWallCabinet_01_Glass_04_C, OpenSidewaysTimeline) == 0x000480, "Member 'ABP_DisplayWallCabinet_01_Glass_04_C::OpenSidewaysTimeline' has a wrong offset!");
static_assert(offsetof(ABP_DisplayWallCabinet_01_Glass_04_C, StartRotation) == 0x000488, "Member 'ABP_DisplayWallCabinet_01_Glass_04_C::StartRotation' has a wrong offset!");
static_assert(offsetof(ABP_DisplayWallCabinet_01_Glass_04_C, EndRotation) == 0x000494, "Member 'ABP_DisplayWallCabinet_01_Glass_04_C::EndRotation' has a wrong offset!");

}

