#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Dumpster_01_Open

#include "Basic.hpp"

#include "Enum_DumpsterStages_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Dumpster_01_Open.BP_Dumpster_01_Open_C.ExecuteUbergraph_BP_Dumpster_01_Open
// 0x0254 (0x0254 - 0x0000)
struct BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0004(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0094(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         K2Node_Event_OldState;                             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewState;                             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0134(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x01C4(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open) == 0x000004, "Wrong alignment on BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open");
static_assert(sizeof(BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open) == 0x000254, "Wrong size on BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open");
static_assert(offsetof(BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open, EntryPoint) == 0x000000, "Member 'BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000004, "Member 'BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000094, "Member 'BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open, K2Node_Event_OldState) == 0x000124, "Member 'BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open::K2Node_Event_OldState' has a wrong offset!");
static_assert(offsetof(BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open, K2Node_Event_NewState) == 0x000128, "Member 'BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open, K2Node_Event_bDoCosmetics) == 0x00012C, "Member 'BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open, K2Node_SwitchInteger_CmpSuccess) == 0x00012D, "Member 'BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000130, "Member 'BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000134, "Member 'BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0001C4, "Member 'BP_Dumpster_01_Open_C_ExecuteUbergraph_BP_Dumpster_01_Open::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");

// Function BP_Dumpster_01_Open.BP_Dumpster_01_Open_C.OnStateChanged
// 0x000C (0x000C - 0x0000)
struct BP_Dumpster_01_Open_C_OnStateChanged final
{
public:
	int32                                         OldState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoCosmetics;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Dumpster_01_Open_C_OnStateChanged) == 0x000004, "Wrong alignment on BP_Dumpster_01_Open_C_OnStateChanged");
static_assert(sizeof(BP_Dumpster_01_Open_C_OnStateChanged) == 0x00000C, "Wrong size on BP_Dumpster_01_Open_C_OnStateChanged");
static_assert(offsetof(BP_Dumpster_01_Open_C_OnStateChanged, OldState) == 0x000000, "Member 'BP_Dumpster_01_Open_C_OnStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(BP_Dumpster_01_Open_C_OnStateChanged, NewState) == 0x000004, "Member 'BP_Dumpster_01_Open_C_OnStateChanged::NewState' has a wrong offset!");
static_assert(offsetof(BP_Dumpster_01_Open_C_OnStateChanged, bDoCosmetics) == 0x000008, "Member 'BP_Dumpster_01_Open_C_OnStateChanged::bDoCosmetics' has a wrong offset!");

// Function BP_Dumpster_01_Open.BP_Dumpster_01_Open_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_Dumpster_01_Open_C_UserConstructionScript final
{
public:
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Dumpster_01_Open_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_Dumpster_01_Open_C_UserConstructionScript");
static_assert(sizeof(BP_Dumpster_01_Open_C_UserConstructionScript) == 0x000008, "Wrong size on BP_Dumpster_01_Open_C_UserConstructionScript");
static_assert(offsetof(BP_Dumpster_01_Open_C_UserConstructionScript, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000000, "Member 'BP_Dumpster_01_Open_C_UserConstructionScript::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Dumpster_01_Open_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'BP_Dumpster_01_Open_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_Dumpster_01_Open.BP_Dumpster_01_Open_C.SetStateFunction
// 0x0002 (0x0002 - 0x0000)
struct BP_Dumpster_01_Open_C_SetStateFunction final
{
public:
	Enum_DumpsterStages                           State_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Dumpster_01_Open_C_SetStateFunction) == 0x000001, "Wrong alignment on BP_Dumpster_01_Open_C_SetStateFunction");
static_assert(sizeof(BP_Dumpster_01_Open_C_SetStateFunction) == 0x000002, "Wrong size on BP_Dumpster_01_Open_C_SetStateFunction");
static_assert(offsetof(BP_Dumpster_01_Open_C_SetStateFunction, State_0) == 0x000000, "Member 'BP_Dumpster_01_Open_C_SetStateFunction::State_0' has a wrong offset!");
static_assert(offsetof(BP_Dumpster_01_Open_C_SetStateFunction, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'BP_Dumpster_01_Open_C_SetStateFunction::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

