#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DesktopComputer_01_Monitor

#include "Basic.hpp"

#include "E_ComputerScreens_01_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DesktopComputer_01_Monitor.BP_DesktopComputer_01_Monitor_C
// 0x0018 (0x02F0 - 0x02D8)
class ABP_DesktopComputer_01_Monitor_C final : public ASBZSmallCosmeticDestruction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZCosmeticDestructionComponent*       SBZCosmeticDestruction_1;                          // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         DAmage_Taken;                                      // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_destructable;                                   // 0x02EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	E_ComputerScreens_01                          Screen;                                            // 0x02ED(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DesktopComputer_01_Monitor(int32 EntryPoint);
	void BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature(ESBZCosmeticDestructionType Type, const struct FSBZCosmeticDestructionContext& HitContext);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DesktopComputer_01_Monitor_C">();
	}
	static class ABP_DesktopComputer_01_Monitor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DesktopComputer_01_Monitor_C>();
	}
};
static_assert(alignof(ABP_DesktopComputer_01_Monitor_C) == 0x000008, "Wrong alignment on ABP_DesktopComputer_01_Monitor_C");
static_assert(sizeof(ABP_DesktopComputer_01_Monitor_C) == 0x0002F0, "Wrong size on ABP_DesktopComputer_01_Monitor_C");
static_assert(offsetof(ABP_DesktopComputer_01_Monitor_C, UberGraphFrame) == 0x0002D8, "Member 'ABP_DesktopComputer_01_Monitor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DesktopComputer_01_Monitor_C, SBZCosmeticDestruction_1) == 0x0002E0, "Member 'ABP_DesktopComputer_01_Monitor_C::SBZCosmeticDestruction_1' has a wrong offset!");
static_assert(offsetof(ABP_DesktopComputer_01_Monitor_C, DAmage_Taken) == 0x0002E8, "Member 'ABP_DesktopComputer_01_Monitor_C::DAmage_Taken' has a wrong offset!");
static_assert(offsetof(ABP_DesktopComputer_01_Monitor_C, Is_destructable) == 0x0002EC, "Member 'ABP_DesktopComputer_01_Monitor_C::Is_destructable' has a wrong offset!");
static_assert(offsetof(ABP_DesktopComputer_01_Monitor_C, Screen) == 0x0002ED, "Member 'ABP_DesktopComputer_01_Monitor_C::Screen' has a wrong offset!");

}

