#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ECMJammer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ECMJammer.BP_ECMJammer_C
// 0x0020 (0x05A0 - 0x0580)
class ABP_ECMJammer_C final : public ASBZECMJammer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Interactable_Collision;                            // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ECMJammer(int32 EntryPoint);
	void OnActivatedUsing();
	void OnActivated();
	void OnJammerEffectEnded();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ECMJammer_C">();
	}
	static class ABP_ECMJammer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ECMJammer_C>();
	}
};
static_assert(alignof(ABP_ECMJammer_C) == 0x000010, "Wrong alignment on ABP_ECMJammer_C");
static_assert(sizeof(ABP_ECMJammer_C) == 0x0005A0, "Wrong size on ABP_ECMJammer_C");
static_assert(offsetof(ABP_ECMJammer_C, UberGraphFrame) == 0x000580, "Member 'ABP_ECMJammer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ECMJammer_C, Interactable_Collision) == 0x000588, "Member 'ABP_ECMJammer_C::Interactable_Collision' has a wrong offset!");
static_assert(offsetof(ABP_ECMJammer_C, Ak) == 0x000590, "Member 'ABP_ECMJammer_C::Ak' has a wrong offset!");

}

