#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FlipSwitch_SabotagePoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BaseSabotagePoint_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FlipSwitch_SabotagePoint.BP_FlipSwitch_SabotagePoint_C
// 0x0018 (0x0390 - 0x0378)
class ABP_FlipSwitch_SabotagePoint_C final : public ABP_BaseSabotagePoint_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_FlipSwitch_SabotagePoint_C;      // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FlipSwitch_SabotagePoint(int32 EntryPoint);
	void BndEvt__BP_ElevatorDoor_ControlPanel_InteractableComponent_K2Node_ComponentBoundEvent_2_SBZOnInteractableStateChangedDelegate__DelegateSignature(const class USBZBaseInteractableComponent* InteractableComponent_0, bool bInNewState);
	void UserConstructionScript();
	void PlayTurnOff();
	void PlayTurnOn();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FlipSwitch_SabotagePoint_C">();
	}
	static class ABP_FlipSwitch_SabotagePoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FlipSwitch_SabotagePoint_C>();
	}
};
static_assert(alignof(ABP_FlipSwitch_SabotagePoint_C) == 0x000008, "Wrong alignment on ABP_FlipSwitch_SabotagePoint_C");
static_assert(sizeof(ABP_FlipSwitch_SabotagePoint_C) == 0x000390, "Wrong size on ABP_FlipSwitch_SabotagePoint_C");
static_assert(offsetof(ABP_FlipSwitch_SabotagePoint_C, UberGraphFrame_BP_FlipSwitch_SabotagePoint_C) == 0x000378, "Member 'ABP_FlipSwitch_SabotagePoint_C::UberGraphFrame_BP_FlipSwitch_SabotagePoint_C' has a wrong offset!");
static_assert(offsetof(ABP_FlipSwitch_SabotagePoint_C, Ak) == 0x000380, "Member 'ABP_FlipSwitch_SabotagePoint_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_FlipSwitch_SabotagePoint_C, Mesh) == 0x000388, "Member 'ABP_FlipSwitch_SabotagePoint_C::Mesh' has a wrong offset!");

}

