#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FirstAidPack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FirstAidPack.BP_FirstAidPack_C
// 0x0040 (0x0580 - 0x0540)
class ABP_FirstAidPack_C : public ASBZFirstAidPack
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   ST_EQ_Medic_Charge____5;                           // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ST_EQ_Medic_Charge___4;                            // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ST_EQ_Medic_Charge__3;                             // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ST_EQ_Medic_Charge__2;                             // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZShoutTargetComponent*               SBZShoutTarget;                                    // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ST_EQ_Medic_Charge_1;                              // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FirstAidPack(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnChargesChanged(float ChargesChangeTo, bool bDoCosmetics);
	void OnThrown();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FirstAidPack_C">();
	}
	static class ABP_FirstAidPack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FirstAidPack_C>();
	}
};
static_assert(alignof(ABP_FirstAidPack_C) == 0x000010, "Wrong alignment on ABP_FirstAidPack_C");
static_assert(sizeof(ABP_FirstAidPack_C) == 0x000580, "Wrong size on ABP_FirstAidPack_C");
static_assert(offsetof(ABP_FirstAidPack_C, UberGraphFrame) == 0x000540, "Member 'ABP_FirstAidPack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FirstAidPack_C, ST_EQ_Medic_Charge____5) == 0x000548, "Member 'ABP_FirstAidPack_C::ST_EQ_Medic_Charge____5' has a wrong offset!");
static_assert(offsetof(ABP_FirstAidPack_C, ST_EQ_Medic_Charge___4) == 0x000550, "Member 'ABP_FirstAidPack_C::ST_EQ_Medic_Charge___4' has a wrong offset!");
static_assert(offsetof(ABP_FirstAidPack_C, ST_EQ_Medic_Charge__3) == 0x000558, "Member 'ABP_FirstAidPack_C::ST_EQ_Medic_Charge__3' has a wrong offset!");
static_assert(offsetof(ABP_FirstAidPack_C, ST_EQ_Medic_Charge__2) == 0x000560, "Member 'ABP_FirstAidPack_C::ST_EQ_Medic_Charge__2' has a wrong offset!");
static_assert(offsetof(ABP_FirstAidPack_C, SBZShoutTarget) == 0x000568, "Member 'ABP_FirstAidPack_C::SBZShoutTarget' has a wrong offset!");
static_assert(offsetof(ABP_FirstAidPack_C, ST_EQ_Medic_Charge_1) == 0x000570, "Member 'ABP_FirstAidPack_C::ST_EQ_Medic_Charge_1' has a wrong offset!");

}

