#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Glass_Railing_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_AttractorDestructionBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Glass_Railing_Base.BP_Glass_Railing_Base_C
// 0x0028 (0x0330 - 0x0308)
class ABP_Glass_Railing_Base_C : public ABP_AttractorDestructionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZAcousticPortalConnectorComponent*   SBZAcousticPortalConnector;                        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Particle_Color;                                    // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ParticleCount;                                     // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Glass_Railing_Base(int32 EntryPoint);
	void BndEvt__NewBlueprint_PropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature(class UActorComponent* PoolComponent, int32 Hits, bool bDoCosmetics, const struct FSBZPropDamageContext& DamageContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Glass_Railing_Base_C">();
	}
	static class ABP_Glass_Railing_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Glass_Railing_Base_C>();
	}
};
static_assert(alignof(ABP_Glass_Railing_Base_C) == 0x000008, "Wrong alignment on ABP_Glass_Railing_Base_C");
static_assert(sizeof(ABP_Glass_Railing_Base_C) == 0x000330, "Wrong size on ABP_Glass_Railing_Base_C");
static_assert(offsetof(ABP_Glass_Railing_Base_C, UberGraphFrame) == 0x000308, "Member 'ABP_Glass_Railing_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Glass_Railing_Base_C, SBZAcousticPortalConnector) == 0x000310, "Member 'ABP_Glass_Railing_Base_C::SBZAcousticPortalConnector' has a wrong offset!");
static_assert(offsetof(ABP_Glass_Railing_Base_C, Particle_Color) == 0x000318, "Member 'ABP_Glass_Railing_Base_C::Particle_Color' has a wrong offset!");
static_assert(offsetof(ABP_Glass_Railing_Base_C, ParticleCount) == 0x000328, "Member 'ABP_Glass_Railing_Base_C::ParticleCount' has a wrong offset!");

}

