#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeistGameState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HeistGameState.BP_HeistGameState_C
// 0x0020 (0x13A8 - 0x1388)
class ABP_HeistGameState_C final : public APD3HeistGameState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  UI_Vignette;                                       // 0x1390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  OutlinePostProcess;                                // 0x1398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x13A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HeistGameState(int32 EntryPoint);
	void BP_OnHideAllOutlinesChanged(bool bIsHidden);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HeistGameState_C">();
	}
	static class ABP_HeistGameState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HeistGameState_C>();
	}
};
static_assert(alignof(ABP_HeistGameState_C) == 0x000008, "Wrong alignment on ABP_HeistGameState_C");
static_assert(sizeof(ABP_HeistGameState_C) == 0x0013A8, "Wrong size on ABP_HeistGameState_C");
static_assert(offsetof(ABP_HeistGameState_C, UberGraphFrame) == 0x001388, "Member 'ABP_HeistGameState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HeistGameState_C, UI_Vignette) == 0x001390, "Member 'ABP_HeistGameState_C::UI_Vignette' has a wrong offset!");
static_assert(offsetof(ABP_HeistGameState_C, OutlinePostProcess) == 0x001398, "Member 'ABP_HeistGameState_C::OutlinePostProcess' has a wrong offset!");
static_assert(offsetof(ABP_HeistGameState_C, DefaultSceneRoot) == 0x0013A0, "Member 'ABP_HeistGameState_C::DefaultSceneRoot' has a wrong offset!");

}

