#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HandheldCup

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_HandheldCup.BP_HandheldCup_C.ExecuteUbergraph_BP_HandheldCup
// 0x0048 (0x0048 - 0x0000)
struct BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_GetStaticMeshComponent_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCharacter*                          K2Node_DynamicCast_AsSBZCharacter;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSeed_ReturnValue;                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup) == 0x000008, "Wrong alignment on BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup");
static_assert(sizeof(BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup) == 0x000048, "Wrong size on BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup");
static_assert(offsetof(BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup, EntryPoint) == 0x000000, "Member 'BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup, CallFunc_GetStaticMeshComponent_ReturnValue) == 0x000008, "Member 'BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup::CallFunc_GetStaticMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup, K2Node_DynamicCast_AsSBZCharacter) == 0x000018, "Member 'BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup::K2Node_DynamicCast_AsSBZCharacter' has a wrong offset!");
static_assert(offsetof(BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup, CallFunc_GetSeed_ReturnValue) == 0x000028, "Member 'BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup::CallFunc_GetSeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup, CallFunc_Percent_IntInt_ReturnValue) == 0x000034, "Member 'BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup, CallFunc_SetStaticMesh_ReturnValue) == 0x000040, "Member 'BP_HandheldCup_C_ExecuteUbergraph_BP_HandheldCup::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

