#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InstantLoot_NecklaceBust

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_InstantLoot_NecklaceBust.BP_InstantLoot_NecklaceBust_C.ExecuteUbergraph_BP_InstantLoot_NecklaceBust
// 0x0008 (0x0008 - 0x0000)
struct BP_InstantLoot_NecklaceBust_C_ExecuteUbergraph_BP_InstantLoot_NecklaceBust final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InstantLoot_NecklaceBust_C_ExecuteUbergraph_BP_InstantLoot_NecklaceBust) == 0x000004, "Wrong alignment on BP_InstantLoot_NecklaceBust_C_ExecuteUbergraph_BP_InstantLoot_NecklaceBust");
static_assert(sizeof(BP_InstantLoot_NecklaceBust_C_ExecuteUbergraph_BP_InstantLoot_NecklaceBust) == 0x000008, "Wrong size on BP_InstantLoot_NecklaceBust_C_ExecuteUbergraph_BP_InstantLoot_NecklaceBust");
static_assert(offsetof(BP_InstantLoot_NecklaceBust_C_ExecuteUbergraph_BP_InstantLoot_NecklaceBust, EntryPoint) == 0x000000, "Member 'BP_InstantLoot_NecklaceBust_C_ExecuteUbergraph_BP_InstantLoot_NecklaceBust::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InstantLoot_NecklaceBust_C_ExecuteUbergraph_BP_InstantLoot_NecklaceBust, K2Node_Event_bDoCosmetics) == 0x000004, "Member 'BP_InstantLoot_NecklaceBust_C_ExecuteUbergraph_BP_InstantLoot_NecklaceBust::K2Node_Event_bDoCosmetics' has a wrong offset!");

// Function BP_InstantLoot_NecklaceBust.BP_InstantLoot_NecklaceBust_C.OnLooted
// 0x0001 (0x0001 - 0x0000)
struct BP_InstantLoot_NecklaceBust_C_OnLooted final
{
public:
	bool                                          bDoCosmetics;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InstantLoot_NecklaceBust_C_OnLooted) == 0x000001, "Wrong alignment on BP_InstantLoot_NecklaceBust_C_OnLooted");
static_assert(sizeof(BP_InstantLoot_NecklaceBust_C_OnLooted) == 0x000001, "Wrong size on BP_InstantLoot_NecklaceBust_C_OnLooted");
static_assert(offsetof(BP_InstantLoot_NecklaceBust_C_OnLooted, bDoCosmetics) == 0x000000, "Member 'BP_InstantLoot_NecklaceBust_C_OnLooted::bDoCosmetics' has a wrong offset!");

}

