#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IGL_BRE_NAV_ATT_2HITS

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function BP_IGL_BRE_NAV_ATT_2HITS.BP_IGL_BRE_NAV_ATT_2HITS_C.ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS
// 0x0058 (0x0058 - 0x0000)
struct BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZGateState                                 K2Node_Event_OldState;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZGateState                                 K2Node_Event_NewState;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInitialStateChange;                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISBZBreakableInterface> K2Node_DynamicCast_AsSBZBreakable_Interface;       // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetState_ReturnValue;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_ComponentBoundEvent_PoolComponent;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Hits;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bDoCosmetics;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPropDamageContext                  K2Node_ComponentBoundEvent_DamageContext;          // 0x0038(0x0018)(ConstParm, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS) == 0x000008, "Wrong alignment on BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS");
static_assert(sizeof(BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS) == 0x000058, "Wrong size on BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS, EntryPoint) == 0x000000, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS, K2Node_Event_OldState) == 0x000004, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS::K2Node_Event_OldState' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS, K2Node_Event_NewState) == 0x000005, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS, K2Node_Event_bIsInitialStateChange) == 0x000006, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS::K2Node_Event_bIsInitialStateChange' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS, K2Node_SwitchEnum_CmpSuccess) == 0x000007, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS, K2Node_DynamicCast_AsSBZBreakable_Interface) == 0x000010, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS::K2Node_DynamicCast_AsSBZBreakable_Interface' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS, CallFunc_SetState_ReturnValue) == 0x000021, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS::CallFunc_SetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS, K2Node_ComponentBoundEvent_PoolComponent) == 0x000028, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS::K2Node_ComponentBoundEvent_PoolComponent' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS, K2Node_ComponentBoundEvent_Hits) == 0x000030, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS::K2Node_ComponentBoundEvent_Hits' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS, K2Node_ComponentBoundEvent_bDoCosmetics) == 0x000034, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS::K2Node_ComponentBoundEvent_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS, K2Node_ComponentBoundEvent_DamageContext) == 0x000038, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS::K2Node_ComponentBoundEvent_DamageContext' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS, K2Node_SwitchInteger_CmpSuccess) == 0x000050, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BP_IGL_BRE_NAV_ATT_2HITS.BP_IGL_BRE_NAV_ATT_2HITS_C.BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct BP_IGL_BRE_NAV_ATT_2HITS_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature final
{
public:
	class UActorComponent*                        PoolComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Hits;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoCosmetics;                                      // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPropDamageContext                  DamageContext;                                     // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_IGL_BRE_NAV_ATT_2HITS_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_IGL_BRE_NAV_ATT_2HITS_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature");
static_assert(sizeof(BP_IGL_BRE_NAV_ATT_2HITS_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature) == 0x000028, "Wrong size on BP_IGL_BRE_NAV_ATT_2HITS_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature, PoolComponent) == 0x000000, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature::PoolComponent' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature, Hits) == 0x000008, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature::Hits' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature, bDoCosmetics) == 0x00000C, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature::bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature, DamageContext) == 0x000010, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature::DamageContext' has a wrong offset!");

// Function BP_IGL_BRE_NAV_ATT_2HITS.BP_IGL_BRE_NAV_ATT_2HITS_C.OnStateChanged
// 0x0003 (0x0003 - 0x0000)
struct BP_IGL_BRE_NAV_ATT_2HITS_C_OnStateChanged final
{
public:
	ESBZGateState                                 OldState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZGateState                                 NewState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitialStateChange;                             // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IGL_BRE_NAV_ATT_2HITS_C_OnStateChanged) == 0x000001, "Wrong alignment on BP_IGL_BRE_NAV_ATT_2HITS_C_OnStateChanged");
static_assert(sizeof(BP_IGL_BRE_NAV_ATT_2HITS_C_OnStateChanged) == 0x000003, "Wrong size on BP_IGL_BRE_NAV_ATT_2HITS_C_OnStateChanged");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_OnStateChanged, OldState) == 0x000000, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_OnStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_OnStateChanged, NewState) == 0x000001, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_OnStateChanged::NewState' has a wrong offset!");
static_assert(offsetof(BP_IGL_BRE_NAV_ATT_2HITS_C_OnStateChanged, bIsInitialStateChange) == 0x000002, "Member 'BP_IGL_BRE_NAV_ATT_2HITS_C_OnStateChanged::bIsInitialStateChange' has a wrong offset!");

}

