#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InstantLoot_NecklaceBust

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InstantLoot_NecklaceBust.BP_InstantLoot_NecklaceBust_C
// 0x0020 (0x0300 - 0x02E0)
class ABP_InstantLoot_NecklaceBust_C final : public ASBZInstantLoot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZAIObjectiveComponent*               SBZAIObjective;                                    // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Jewerly;                                           // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bust;                                              // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_InstantLoot_NecklaceBust(int32 EntryPoint);
	void OnLooted(bool bDoCosmetics);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InstantLoot_NecklaceBust_C">();
	}
	static class ABP_InstantLoot_NecklaceBust_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InstantLoot_NecklaceBust_C>();
	}
};
static_assert(alignof(ABP_InstantLoot_NecklaceBust_C) == 0x000008, "Wrong alignment on ABP_InstantLoot_NecklaceBust_C");
static_assert(sizeof(ABP_InstantLoot_NecklaceBust_C) == 0x000300, "Wrong size on ABP_InstantLoot_NecklaceBust_C");
static_assert(offsetof(ABP_InstantLoot_NecklaceBust_C, UberGraphFrame) == 0x0002E0, "Member 'ABP_InstantLoot_NecklaceBust_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_InstantLoot_NecklaceBust_C, SBZAIObjective) == 0x0002E8, "Member 'ABP_InstantLoot_NecklaceBust_C::SBZAIObjective' has a wrong offset!");
static_assert(offsetof(ABP_InstantLoot_NecklaceBust_C, Jewerly) == 0x0002F0, "Member 'ABP_InstantLoot_NecklaceBust_C::Jewerly' has a wrong offset!");
static_assert(offsetof(ABP_InstantLoot_NecklaceBust_C, Bust) == 0x0002F8, "Member 'ABP_InstantLoot_NecklaceBust_C::Bust' has a wrong offset!");

}

