#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IGL_BRE_NAV_ATT_2HITS

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_IGL_BRE_NAV_ATT_2HITS.BP_IGL_BRE_NAV_ATT_2HITS_C
// 0x0050 (0x05C8 - 0x0578)
class ABP_IGL_BRE_NAV_ATT_2HITS_C : public ASBZWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZRoomConnectorComponent*             SBZRoomConnector;                                  // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZAcousticPortalConnectorComponent*   SBZAcousticPortalConnector;                        // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZPropDamageComponent*                SBZPropDamage;                                     // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Window;                                            // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Particle_count;                                    // 0x05A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Particle_Size_Multiplier;                          // 0x05A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Particle_Color;                                    // 0x05A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             DamageInstigator;                                  // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Do_Cosmetics;                                      // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsDestroyed;                                       // 0x05C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_IGL_BRE_NAV_ATT_2HITS(int32 EntryPoint);
	void BndEvt__BP_BreachableWindow_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature(class UActorComponent* PoolComponent, int32 Hits, bool bDoCosmetics, const struct FSBZPropDamageContext& DamageContext);
	void OnStateChanged(ESBZGateState OldState, ESBZGateState NewState, bool bIsInitialStateChange);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_IGL_BRE_NAV_ATT_2HITS_C">();
	}
	static class ABP_IGL_BRE_NAV_ATT_2HITS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_IGL_BRE_NAV_ATT_2HITS_C>();
	}
};
static_assert(alignof(ABP_IGL_BRE_NAV_ATT_2HITS_C) == 0x000008, "Wrong alignment on ABP_IGL_BRE_NAV_ATT_2HITS_C");
static_assert(sizeof(ABP_IGL_BRE_NAV_ATT_2HITS_C) == 0x0005C8, "Wrong size on ABP_IGL_BRE_NAV_ATT_2HITS_C");
static_assert(offsetof(ABP_IGL_BRE_NAV_ATT_2HITS_C, UberGraphFrame) == 0x000578, "Member 'ABP_IGL_BRE_NAV_ATT_2HITS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_IGL_BRE_NAV_ATT_2HITS_C, SBZRoomConnector) == 0x000580, "Member 'ABP_IGL_BRE_NAV_ATT_2HITS_C::SBZRoomConnector' has a wrong offset!");
static_assert(offsetof(ABP_IGL_BRE_NAV_ATT_2HITS_C, SBZAcousticPortalConnector) == 0x000588, "Member 'ABP_IGL_BRE_NAV_ATT_2HITS_C::SBZAcousticPortalConnector' has a wrong offset!");
static_assert(offsetof(ABP_IGL_BRE_NAV_ATT_2HITS_C, SBZPropDamage) == 0x000590, "Member 'ABP_IGL_BRE_NAV_ATT_2HITS_C::SBZPropDamage' has a wrong offset!");
static_assert(offsetof(ABP_IGL_BRE_NAV_ATT_2HITS_C, Window) == 0x000598, "Member 'ABP_IGL_BRE_NAV_ATT_2HITS_C::Window' has a wrong offset!");
static_assert(offsetof(ABP_IGL_BRE_NAV_ATT_2HITS_C, Particle_count) == 0x0005A0, "Member 'ABP_IGL_BRE_NAV_ATT_2HITS_C::Particle_count' has a wrong offset!");
static_assert(offsetof(ABP_IGL_BRE_NAV_ATT_2HITS_C, Particle_Size_Multiplier) == 0x0005A4, "Member 'ABP_IGL_BRE_NAV_ATT_2HITS_C::Particle_Size_Multiplier' has a wrong offset!");
static_assert(offsetof(ABP_IGL_BRE_NAV_ATT_2HITS_C, Particle_Color) == 0x0005A8, "Member 'ABP_IGL_BRE_NAV_ATT_2HITS_C::Particle_Color' has a wrong offset!");
static_assert(offsetof(ABP_IGL_BRE_NAV_ATT_2HITS_C, DamageInstigator) == 0x0005B8, "Member 'ABP_IGL_BRE_NAV_ATT_2HITS_C::DamageInstigator' has a wrong offset!");
static_assert(offsetof(ABP_IGL_BRE_NAV_ATT_2HITS_C, Do_Cosmetics) == 0x0005C0, "Member 'ABP_IGL_BRE_NAV_ATT_2HITS_C::Do_Cosmetics' has a wrong offset!");
static_assert(offsetof(ABP_IGL_BRE_NAV_ATT_2HITS_C, IsDestroyed) == 0x0005C1, "Member 'ABP_IGL_BRE_NAV_ATT_2HITS_C::IsDestroyed' has a wrong offset!");

}

