#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_JewelryDisplay_128

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_JewelryDisplay_128.BP_JewelryDisplay_128_C.ExecuteUbergraph_BP_JewelryDisplay_128
// 0x0020 (0x0020 - 0x0000)
struct BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZDisplayCaseState                          K2Node_Event_OldState;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZDisplayCaseState                          K2Node_Event_NewState;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDoCosmetics_1;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128) == 0x000004, "Wrong alignment on BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128");
static_assert(sizeof(BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128) == 0x000020, "Wrong size on BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128");
static_assert(offsetof(BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128, EntryPoint) == 0x000000, "Member 'BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128, K2Node_Event_OldState) == 0x000004, "Member 'BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128::K2Node_Event_OldState' has a wrong offset!");
static_assert(offsetof(BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128, K2Node_Event_NewState) == 0x000005, "Member 'BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128, K2Node_Event_bDoCosmetics_1) == 0x000006, "Member 'BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128::K2Node_Event_bDoCosmetics_1' has a wrong offset!");
static_assert(offsetof(BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128, K2Node_SwitchEnum_CmpSuccess) == 0x000007, "Member 'BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128, CallFunc_PostEventAtLocation_ReturnValue) == 0x000014, "Member 'BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128, K2Node_Event_bDoCosmetics) == 0x000018, "Member 'BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00001C, "Member 'BP_JewelryDisplay_128_C_ExecuteUbergraph_BP_JewelryDisplay_128::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");

// Function BP_JewelryDisplay_128.BP_JewelryDisplay_128_C.BP_OnGlassBroken
// 0x0001 (0x0001 - 0x0000)
struct BP_JewelryDisplay_128_C_BP_OnGlassBroken final
{
public:
	bool                                          bDoCosmetics;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_JewelryDisplay_128_C_BP_OnGlassBroken) == 0x000001, "Wrong alignment on BP_JewelryDisplay_128_C_BP_OnGlassBroken");
static_assert(sizeof(BP_JewelryDisplay_128_C_BP_OnGlassBroken) == 0x000001, "Wrong size on BP_JewelryDisplay_128_C_BP_OnGlassBroken");
static_assert(offsetof(BP_JewelryDisplay_128_C_BP_OnGlassBroken, bDoCosmetics) == 0x000000, "Member 'BP_JewelryDisplay_128_C_BP_OnGlassBroken::bDoCosmetics' has a wrong offset!");

// Function BP_JewelryDisplay_128.BP_JewelryDisplay_128_C.BP_OnStateChanged
// 0x0003 (0x0003 - 0x0000)
struct BP_JewelryDisplay_128_C_BP_OnStateChanged final
{
public:
	ESBZDisplayCaseState                          OldState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZDisplayCaseState                          NewState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoCosmetics;                                      // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_JewelryDisplay_128_C_BP_OnStateChanged) == 0x000001, "Wrong alignment on BP_JewelryDisplay_128_C_BP_OnStateChanged");
static_assert(sizeof(BP_JewelryDisplay_128_C_BP_OnStateChanged) == 0x000003, "Wrong size on BP_JewelryDisplay_128_C_BP_OnStateChanged");
static_assert(offsetof(BP_JewelryDisplay_128_C_BP_OnStateChanged, OldState) == 0x000000, "Member 'BP_JewelryDisplay_128_C_BP_OnStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(BP_JewelryDisplay_128_C_BP_OnStateChanged, NewState) == 0x000001, "Member 'BP_JewelryDisplay_128_C_BP_OnStateChanged::NewState' has a wrong offset!");
static_assert(offsetof(BP_JewelryDisplay_128_C_BP_OnStateChanged, bDoCosmetics) == 0x000002, "Member 'BP_JewelryDisplay_128_C_BP_OnStateChanged::bDoCosmetics' has a wrong offset!");

}

