#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_JewelryMachine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_JewelryMachine.BP_JewelryMachine_C
// 0x0090 (0x04A0 - 0x0410)
class ABP_JewelryMachine_C final : public ASBZLootProcessor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Plane;                                             // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CleanedArt;                                     // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZRenderTargetWidgetComponent*        SBZRenderTargetWidget;                             // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TempStatusLight_1;                                 // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tray;                                              // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TempStatusLight;                                   // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Body;                                              // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OpenTray_Timeline_YPosTrack_3DF1BC404FED9153DAA5CABE8BF6ABE7; // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OpenTray_Timeline__Direction_3DF1BC404FED9153DAA5CABE8BF6ABE7; // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45D[0x3];                                      // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OpenTray_Timeline;                                 // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_468[0x8];                                      // 0x0468(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               ColorRunning;                                      // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               ColorInterupt;                                     // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               ColorComplete;                                     // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_JewelryMachine(int32 EntryPoint);
	void BndEvt__BP_JewelryMachine_ClaimBagInteractable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void BndEvt__BP_JewelryMachine_ClaimBagInteractable_K2Node_ComponentBoundEvent_0_SBZOnInteractableStateChangedDelegate__DelegateSignature(const class USBZBaseInteractableComponent* InteractableComponent, bool bInNewState);
	void BP_OnRunningStateChanged(ESBZLootProcessorState NewState, bool bDoCosmetics, bool bIsDedicatedServer);
	void BP_BagCountUpdated(int32 NumOfBags);
	void OpenTray_Timeline__UpdateFunc();
	void OpenTray_Timeline__FinishedFunc();
	void SetDisplayColor(int32 State, bool Flickering);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_JewelryMachine_C">();
	}
	static class ABP_JewelryMachine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_JewelryMachine_C>();
	}
};
static_assert(alignof(ABP_JewelryMachine_C) == 0x000010, "Wrong alignment on ABP_JewelryMachine_C");
static_assert(sizeof(ABP_JewelryMachine_C) == 0x0004A0, "Wrong size on ABP_JewelryMachine_C");
static_assert(offsetof(ABP_JewelryMachine_C, UberGraphFrame) == 0x000410, "Member 'ABP_JewelryMachine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_JewelryMachine_C, Plane) == 0x000418, "Member 'ABP_JewelryMachine_C::Plane' has a wrong offset!");
static_assert(offsetof(ABP_JewelryMachine_C, SBZOutline) == 0x000420, "Member 'ABP_JewelryMachine_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_JewelryMachine_C, SM_CleanedArt) == 0x000428, "Member 'ABP_JewelryMachine_C::SM_CleanedArt' has a wrong offset!");
static_assert(offsetof(ABP_JewelryMachine_C, SBZRenderTargetWidget) == 0x000430, "Member 'ABP_JewelryMachine_C::SBZRenderTargetWidget' has a wrong offset!");
static_assert(offsetof(ABP_JewelryMachine_C, TempStatusLight_1) == 0x000438, "Member 'ABP_JewelryMachine_C::TempStatusLight_1' has a wrong offset!");
static_assert(offsetof(ABP_JewelryMachine_C, Tray) == 0x000440, "Member 'ABP_JewelryMachine_C::Tray' has a wrong offset!");
static_assert(offsetof(ABP_JewelryMachine_C, TempStatusLight) == 0x000448, "Member 'ABP_JewelryMachine_C::TempStatusLight' has a wrong offset!");
static_assert(offsetof(ABP_JewelryMachine_C, Body) == 0x000450, "Member 'ABP_JewelryMachine_C::Body' has a wrong offset!");
static_assert(offsetof(ABP_JewelryMachine_C, OpenTray_Timeline_YPosTrack_3DF1BC404FED9153DAA5CABE8BF6ABE7) == 0x000458, "Member 'ABP_JewelryMachine_C::OpenTray_Timeline_YPosTrack_3DF1BC404FED9153DAA5CABE8BF6ABE7' has a wrong offset!");
static_assert(offsetof(ABP_JewelryMachine_C, OpenTray_Timeline__Direction_3DF1BC404FED9153DAA5CABE8BF6ABE7) == 0x00045C, "Member 'ABP_JewelryMachine_C::OpenTray_Timeline__Direction_3DF1BC404FED9153DAA5CABE8BF6ABE7' has a wrong offset!");
static_assert(offsetof(ABP_JewelryMachine_C, OpenTray_Timeline) == 0x000460, "Member 'ABP_JewelryMachine_C::OpenTray_Timeline' has a wrong offset!");
static_assert(offsetof(ABP_JewelryMachine_C, ColorRunning) == 0x000470, "Member 'ABP_JewelryMachine_C::ColorRunning' has a wrong offset!");
static_assert(offsetof(ABP_JewelryMachine_C, ColorInterupt) == 0x000480, "Member 'ABP_JewelryMachine_C::ColorInterupt' has a wrong offset!");
static_assert(offsetof(ABP_JewelryMachine_C, ColorComplete) == 0x000490, "Member 'ABP_JewelryMachine_C::ColorComplete' has a wrong offset!");

}

