#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_JewelryDisplay_Tall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_JewelryDisplay_Tall.BP_JewelryDisplay_Tall_C
// 0x0020 (0x0488 - 0x0468)
class ABP_JewelryDisplay_Tall_C final : public ASBZDisplayCase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Panel;                                             // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Cuttable_Interaction_Collision;                    // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Table;                                             // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_JewelryDisplay_Tall(int32 EntryPoint);
	void BP_OnGlassBroken(bool bDoCosmetics);
	void BP_OnStateChanged(ESBZDisplayCaseState OldState, ESBZDisplayCaseState NewState, bool bDoCosmetics);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_JewelryDisplay_Tall_C">();
	}
	static class ABP_JewelryDisplay_Tall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_JewelryDisplay_Tall_C>();
	}
};
static_assert(alignof(ABP_JewelryDisplay_Tall_C) == 0x000008, "Wrong alignment on ABP_JewelryDisplay_Tall_C");
static_assert(sizeof(ABP_JewelryDisplay_Tall_C) == 0x000488, "Wrong size on ABP_JewelryDisplay_Tall_C");
static_assert(offsetof(ABP_JewelryDisplay_Tall_C, UberGraphFrame) == 0x000468, "Member 'ABP_JewelryDisplay_Tall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_JewelryDisplay_Tall_C, Panel) == 0x000470, "Member 'ABP_JewelryDisplay_Tall_C::Panel' has a wrong offset!");
static_assert(offsetof(ABP_JewelryDisplay_Tall_C, Cuttable_Interaction_Collision) == 0x000478, "Member 'ABP_JewelryDisplay_Tall_C::Cuttable_Interaction_Collision' has a wrong offset!");
static_assert(offsetof(ABP_JewelryDisplay_Tall_C, Table) == 0x000480, "Member 'ABP_JewelryDisplay_Tall_C::Table' has a wrong offset!");

}

