#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Keypad

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Keypad.BP_Keypad_C
// 0x0088 (0x0420 - 0x0398)
class ABP_Keypad_C final : public ASBZKeypad
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   OutlineMesh;                                       // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Keypad_Num_E__COL_;                                // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Keypad_Num_0__COL_;                                // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Keypad_Num_C__COL_;                                // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Keypad_Num_9__COL_;                                // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Keypad_Num_8__COL_;                                // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Keypad_Num_7__COL_;                                // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Keypad_Num_6__COL_;                                // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Keypad_Num_5__COL_;                                // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Keypad_Num_4__COL_;                                // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Keypad_Num_3__COL_;                                // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Keypad_Num_2__COL_;                                // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Keypad_Num_1__COL_;                                // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Dynamic_Material;                                  // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Key_Index;                                         // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Keypad(int32 EntryPoint);
	void BP_OnKeypadFocusChanged(const int32 KeyIndex, bool bInNewState);
	void BP_UpdateHighlights(const TArray<int32>& GeneratedCode);
	void BP_OnStateChanged(ESBZModuleActorState NewState, bool bDoCosmetics);
	void BP_OnGuessedCodeChanged(const class FText& GuessedCodeText);
	void BP_HandleLanternOverlapEnd(const TArray<class AActor*>& PlayerAttachedActors);
	void BP_HandleLanternOverlapBegin(const TArray<class AActor*>& PlayerAttachedActors, class USkeletalMeshComponent* PlayerMesh, class FName SocketToAttach, const struct FTransform& SpawnTransform);
	void BP_OnKeypadPressed(const int32 KeyIndexPressed);
	void CurveEvalTick_1117234D45361F2B8DD22A9E49175EB4(const class UCurveFloatDelegateTimer* CurveFloatTimer, float CurveElapsedTime, float CurveTimeSinceLast, float CurveValue, float CurveTime);
	void CurveFinished_1117234D45361F2B8DD22A9E49175EB4(const class UCurveFloatDelegateTimer* CurveFloatTimer, float CurveElapsedTime, float CurveTimeSinceLast, float CurveValue, float CurveTime);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Keypad_C">();
	}
	static class ABP_Keypad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Keypad_C>();
	}
};
static_assert(alignof(ABP_Keypad_C) == 0x000008, "Wrong alignment on ABP_Keypad_C");
static_assert(sizeof(ABP_Keypad_C) == 0x000420, "Wrong size on ABP_Keypad_C");
static_assert(offsetof(ABP_Keypad_C, UberGraphFrame) == 0x000398, "Member 'ABP_Keypad_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Keypad_C, SBZOutline) == 0x0003A0, "Member 'ABP_Keypad_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_Keypad_C, OutlineMesh) == 0x0003A8, "Member 'ABP_Keypad_C::OutlineMesh' has a wrong offset!");
static_assert(offsetof(ABP_Keypad_C, Keypad_Num_E__COL_) == 0x0003B0, "Member 'ABP_Keypad_C::Keypad_Num_E__COL_' has a wrong offset!");
static_assert(offsetof(ABP_Keypad_C, Keypad_Num_0__COL_) == 0x0003B8, "Member 'ABP_Keypad_C::Keypad_Num_0__COL_' has a wrong offset!");
static_assert(offsetof(ABP_Keypad_C, Keypad_Num_C__COL_) == 0x0003C0, "Member 'ABP_Keypad_C::Keypad_Num_C__COL_' has a wrong offset!");
static_assert(offsetof(ABP_Keypad_C, Keypad_Num_9__COL_) == 0x0003C8, "Member 'ABP_Keypad_C::Keypad_Num_9__COL_' has a wrong offset!");
static_assert(offsetof(ABP_Keypad_C, Keypad_Num_8__COL_) == 0x0003D0, "Member 'ABP_Keypad_C::Keypad_Num_8__COL_' has a wrong offset!");
static_assert(offsetof(ABP_Keypad_C, Keypad_Num_7__COL_) == 0x0003D8, "Member 'ABP_Keypad_C::Keypad_Num_7__COL_' has a wrong offset!");
static_assert(offsetof(ABP_Keypad_C, Keypad_Num_6__COL_) == 0x0003E0, "Member 'ABP_Keypad_C::Keypad_Num_6__COL_' has a wrong offset!");
static_assert(offsetof(ABP_Keypad_C, Keypad_Num_5__COL_) == 0x0003E8, "Member 'ABP_Keypad_C::Keypad_Num_5__COL_' has a wrong offset!");
static_assert(offsetof(ABP_Keypad_C, Keypad_Num_4__COL_) == 0x0003F0, "Member 'ABP_Keypad_C::Keypad_Num_4__COL_' has a wrong offset!");
static_assert(offsetof(ABP_Keypad_C, Keypad_Num_3__COL_) == 0x0003F8, "Member 'ABP_Keypad_C::Keypad_Num_3__COL_' has a wrong offset!");
static_assert(offsetof(ABP_Keypad_C, Keypad_Num_2__COL_) == 0x000400, "Member 'ABP_Keypad_C::Keypad_Num_2__COL_' has a wrong offset!");
static_assert(offsetof(ABP_Keypad_C, Keypad_Num_1__COL_) == 0x000408, "Member 'ABP_Keypad_C::Keypad_Num_1__COL_' has a wrong offset!");
static_assert(offsetof(ABP_Keypad_C, Dynamic_Material) == 0x000410, "Member 'ABP_Keypad_C::Dynamic_Material' has a wrong offset!");
static_assert(offsetof(ABP_Keypad_C, Key_Index) == 0x000418, "Member 'ABP_Keypad_C::Key_Index' has a wrong offset!");

}

