#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LGT_WallLampIndustrial_01_B

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Master_Light_Fixture_classes.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LGT_WallLampIndustrial_01_B.BP_LGT_WallLampIndustrial_01_B_C
// 0x0030 (0x0370 - 0x0340)
class ABP_LGT_WallLampIndustrial_01_B_C final : public ABP_Master_Light_Fixture_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                    SpotLight;                                         // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZCosmeticDestructionComponent*       SBZCosmeticDestruction;                            // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_Moths;                                          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Disabled_Moth;                                     // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Moth_SpawnProbability;                             // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B(int32 EntryPoint);
	void BndEvt__BP_LGT_WallLampIndustrial_01_B_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature(ESBZCosmeticDestructionType Type, const struct FSBZCosmeticDestructionContext& HitContext);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LGT_WallLampIndustrial_01_B_C">();
	}
	static class ABP_LGT_WallLampIndustrial_01_B_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LGT_WallLampIndustrial_01_B_C>();
	}
};
static_assert(alignof(ABP_LGT_WallLampIndustrial_01_B_C) == 0x000010, "Wrong alignment on ABP_LGT_WallLampIndustrial_01_B_C");
static_assert(sizeof(ABP_LGT_WallLampIndustrial_01_B_C) == 0x000370, "Wrong size on ABP_LGT_WallLampIndustrial_01_B_C");
static_assert(offsetof(ABP_LGT_WallLampIndustrial_01_B_C, UberGraphFrame) == 0x000340, "Member 'ABP_LGT_WallLampIndustrial_01_B_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LGT_WallLampIndustrial_01_B_C, SpotLight) == 0x000348, "Member 'ABP_LGT_WallLampIndustrial_01_B_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_LGT_WallLampIndustrial_01_B_C, SBZCosmeticDestruction) == 0x000350, "Member 'ABP_LGT_WallLampIndustrial_01_B_C::SBZCosmeticDestruction' has a wrong offset!");
static_assert(offsetof(ABP_LGT_WallLampIndustrial_01_B_C, FX_Moths) == 0x000358, "Member 'ABP_LGT_WallLampIndustrial_01_B_C::FX_Moths' has a wrong offset!");
static_assert(offsetof(ABP_LGT_WallLampIndustrial_01_B_C, Disabled_Moth) == 0x000360, "Member 'ABP_LGT_WallLampIndustrial_01_B_C::Disabled_Moth' has a wrong offset!");
static_assert(offsetof(ABP_LGT_WallLampIndustrial_01_B_C, Moth_SpawnProbability) == 0x000364, "Member 'ABP_LGT_WallLampIndustrial_01_B_C::Moth_SpawnProbability' has a wrong offset!");

}

