#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LGT_SpotEmbedded_02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Master_Light_Fixture_classes.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LGT_SpotEmbedded_02.BP_LGT_SpotEmbedded_02_C
// 0x0020 (0x0360 - 0x0340)
class ABP_LGT_SpotEmbedded_02_C final : public ABP_Master_Light_Fixture_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZNiagaraWwiseComponent*              SBZNiagaraWwise;                                   // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZCosmeticDestructionComponent*       SBZCosmeticDestruction;                            // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LGT_SpotEmbedded_02(int32 EntryPoint);
	void BndEvt__BP_LGT_SpotEmbedded_02_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature(ESBZCosmeticDestructionType Type, const struct FSBZCosmeticDestructionContext& HitContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LGT_SpotEmbedded_02_C">();
	}
	static class ABP_LGT_SpotEmbedded_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LGT_SpotEmbedded_02_C>();
	}
};
static_assert(alignof(ABP_LGT_SpotEmbedded_02_C) == 0x000010, "Wrong alignment on ABP_LGT_SpotEmbedded_02_C");
static_assert(sizeof(ABP_LGT_SpotEmbedded_02_C) == 0x000360, "Wrong size on ABP_LGT_SpotEmbedded_02_C");
static_assert(offsetof(ABP_LGT_SpotEmbedded_02_C, UberGraphFrame) == 0x000340, "Member 'ABP_LGT_SpotEmbedded_02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LGT_SpotEmbedded_02_C, SBZNiagaraWwise) == 0x000348, "Member 'ABP_LGT_SpotEmbedded_02_C::SBZNiagaraWwise' has a wrong offset!");
static_assert(offsetof(ABP_LGT_SpotEmbedded_02_C, SBZCosmeticDestruction) == 0x000350, "Member 'ABP_LGT_SpotEmbedded_02_C::SBZCosmeticDestruction' has a wrong offset!");
static_assert(offsetof(ABP_LGT_SpotEmbedded_02_C, SpotLight) == 0x000358, "Member 'ABP_LGT_SpotEmbedded_02_C::SpotLight' has a wrong offset!");

}

