#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LGT_WallLampIndustrial_01_B

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_LGT_WallLampIndustrial_01_B.BP_LGT_WallLampIndustrial_01_B_C.ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B
// 0x0080 (0x0080 - 0x0000)
struct BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0028(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZCosmeticDestructionType                   K2Node_ComponentBoundEvent_Type;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         K2Node_ComponentBoundEvent_HitContext;             // 0x0044(0x0030)(ConstParm, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B) == 0x000008, "Wrong alignment on BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B");
static_assert(sizeof(BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B) == 0x000080, "Wrong size on BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B");
static_assert(offsetof(BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B, EntryPoint) == 0x000000, "Member 'BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000010, "Member 'BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B, Temp_struct_Variable) == 0x000018, "Member 'BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B, Temp_delegate_Variable) == 0x000028, "Member 'BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B, CallFunc_RandomFloat_ReturnValue) == 0x00003C, "Member 'BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B, CallFunc_IsDedicatedServer_ReturnValue) == 0x000041, "Member 'BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B, K2Node_ComponentBoundEvent_Type) == 0x000042, "Member 'BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B::K2Node_ComponentBoundEvent_Type' has a wrong offset!");
static_assert(offsetof(BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B, K2Node_ComponentBoundEvent_HitContext) == 0x000044, "Member 'BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B::K2Node_ComponentBoundEvent_HitContext' has a wrong offset!");
static_assert(offsetof(BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B, CallFunc_PostEvent_ReturnValue) == 0x000074, "Member 'BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B, CallFunc_RandomFloatInRange_ReturnValue) == 0x000078, "Member 'BP_LGT_WallLampIndustrial_01_B_C_ExecuteUbergraph_BP_LGT_WallLampIndustrial_01_B::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");

// Function BP_LGT_WallLampIndustrial_01_B.BP_LGT_WallLampIndustrial_01_B_C.BndEvt__BP_LGT_WallLampIndustrial_01_B_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature
// 0x0034 (0x0034 - 0x0000)
struct BP_LGT_WallLampIndustrial_01_B_C_BndEvt__BP_LGT_WallLampIndustrial_01_B_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature final
{
public:
	ESBZCosmeticDestructionType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         HitContext;                                        // 0x0004(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_LGT_WallLampIndustrial_01_B_C_BndEvt__BP_LGT_WallLampIndustrial_01_B_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000004, "Wrong alignment on BP_LGT_WallLampIndustrial_01_B_C_BndEvt__BP_LGT_WallLampIndustrial_01_B_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(sizeof(BP_LGT_WallLampIndustrial_01_B_C_BndEvt__BP_LGT_WallLampIndustrial_01_B_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000034, "Wrong size on BP_LGT_WallLampIndustrial_01_B_C_BndEvt__BP_LGT_WallLampIndustrial_01_B_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(offsetof(BP_LGT_WallLampIndustrial_01_B_C_BndEvt__BP_LGT_WallLampIndustrial_01_B_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature, Type) == 0x000000, "Member 'BP_LGT_WallLampIndustrial_01_B_C_BndEvt__BP_LGT_WallLampIndustrial_01_B_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(BP_LGT_WallLampIndustrial_01_B_C_BndEvt__BP_LGT_WallLampIndustrial_01_B_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature, HitContext) == 0x000004, "Member 'BP_LGT_WallLampIndustrial_01_B_C_BndEvt__BP_LGT_WallLampIndustrial_01_B_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature::HitContext' has a wrong offset!");

}

