#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LaserPoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LaserPoint.BP_LaserPoint_C.ExecuteUbergraph_BP_LaserPoint
// 0x0010 (0x0010 - 0x0000)
struct BP_LaserPoint_C_ExecuteUbergraph_BP_LaserPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LaserPoint_C_ExecuteUbergraph_BP_LaserPoint) == 0x000008, "Wrong alignment on BP_LaserPoint_C_ExecuteUbergraph_BP_LaserPoint");
static_assert(sizeof(BP_LaserPoint_C_ExecuteUbergraph_BP_LaserPoint) == 0x000010, "Wrong size on BP_LaserPoint_C_ExecuteUbergraph_BP_LaserPoint");
static_assert(offsetof(BP_LaserPoint_C_ExecuteUbergraph_BP_LaserPoint, EntryPoint) == 0x000000, "Member 'BP_LaserPoint_C_ExecuteUbergraph_BP_LaserPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LaserPoint_C_ExecuteUbergraph_BP_LaserPoint, K2Node_Event_OtherActor) == 0x000008, "Member 'BP_LaserPoint_C_ExecuteUbergraph_BP_LaserPoint::K2Node_Event_OtherActor' has a wrong offset!");

// Function BP_LaserPoint.BP_LaserPoint_C.ReceiveActorBeginOverlap_1
// 0x0008 (0x0008 - 0x0000)
struct BP_LaserPoint_C_ReceiveActorBeginOverlap_1 final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LaserPoint_C_ReceiveActorBeginOverlap_1) == 0x000008, "Wrong alignment on BP_LaserPoint_C_ReceiveActorBeginOverlap_1");
static_assert(sizeof(BP_LaserPoint_C_ReceiveActorBeginOverlap_1) == 0x000008, "Wrong size on BP_LaserPoint_C_ReceiveActorBeginOverlap_1");
static_assert(offsetof(BP_LaserPoint_C_ReceiveActorBeginOverlap_1, OtherActor) == 0x000000, "Member 'BP_LaserPoint_C_ReceiveActorBeginOverlap_1::OtherActor' has a wrong offset!");

}

