#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Locker_02

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Locker_02.BP_Locker_02_C.ExecuteUbergraph_BP_Locker_02
// 0x01F0 (0x01F0 - 0x0000)
struct BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_SpawnedActor;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_Event_AttachParent;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_randomizeSpawnedActorTransform_valid;     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0xE];                                       // 0x0042(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_randomizeSpawnedActorTransform_transform; // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorRelativeTransform_SweepHitResult; // 0x0080(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0114(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0128(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0150(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02) == 0x000010, "Wrong alignment on BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02");
static_assert(sizeof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02) == 0x0001F0, "Wrong size on BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, EntryPoint) == 0x000000, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, Temp_struct_Variable) == 0x000008, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, Temp_delegate_Variable) == 0x000018, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, K2Node_Event_SpawnedActor) == 0x000030, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::K2Node_Event_SpawnedActor' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, K2Node_Event_AttachParent) == 0x000038, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::K2Node_Event_AttachParent' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, CallFunc_randomizeSpawnedActorTransform_valid) == 0x000041, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::CallFunc_randomizeSpawnedActorTransform_valid' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, CallFunc_randomizeSpawnedActorTransform_transform) == 0x000050, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::CallFunc_randomizeSpawnedActorTransform_transform' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, CallFunc_K2_SetActorRelativeTransform_SweepHitResult) == 0x000080, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::CallFunc_K2_SetActorRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, K2Node_Event_bDoCosmetics) == 0x000110, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, Temp_delegate_Variable_1) == 0x000114, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, Temp_struct_Variable_1) == 0x000128, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000138, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00013C, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, CallFunc_MakeRotator_ReturnValue) == 0x000140, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, CallFunc_IsDedicatedServer_ReturnValue) == 0x00014C, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000150, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, CallFunc_PostEvent_ReturnValue) == 0x0001E0, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02, CallFunc_PostEvent_ReturnValue_1) == 0x0001E4, "Member 'BP_Locker_02_C_ExecuteUbergraph_BP_Locker_02::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");

// Function BP_Locker_02.BP_Locker_02_C.BP_OnMiniGameSuccess
// 0x0001 (0x0001 - 0x0000)
struct BP_Locker_02_C_BP_OnMiniGameSuccess final
{
public:
	bool                                          bDoCosmetics;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Locker_02_C_BP_OnMiniGameSuccess) == 0x000001, "Wrong alignment on BP_Locker_02_C_BP_OnMiniGameSuccess");
static_assert(sizeof(BP_Locker_02_C_BP_OnMiniGameSuccess) == 0x000001, "Wrong size on BP_Locker_02_C_BP_OnMiniGameSuccess");
static_assert(offsetof(BP_Locker_02_C_BP_OnMiniGameSuccess, bDoCosmetics) == 0x000000, "Member 'BP_Locker_02_C_BP_OnMiniGameSuccess::bDoCosmetics' has a wrong offset!");

// Function BP_Locker_02.BP_Locker_02_C.OnActorSpawned
// 0x0010 (0x0010 - 0x0000)
struct BP_Locker_02_C_OnActorSpawned final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AttachParent;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Locker_02_C_OnActorSpawned) == 0x000008, "Wrong alignment on BP_Locker_02_C_OnActorSpawned");
static_assert(sizeof(BP_Locker_02_C_OnActorSpawned) == 0x000010, "Wrong size on BP_Locker_02_C_OnActorSpawned");
static_assert(offsetof(BP_Locker_02_C_OnActorSpawned, SpawnedActor) == 0x000000, "Member 'BP_Locker_02_C_OnActorSpawned::SpawnedActor' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_OnActorSpawned, AttachParent) == 0x000008, "Member 'BP_Locker_02_C_OnActorSpawned::AttachParent' has a wrong offset!");

// Function BP_Locker_02.BP_Locker_02_C.UserConstructionScript
// 0x0080 (0x0080 - 0x0000)
struct BP_Locker_02_C_UserConstructionScript final
{
public:
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	TMap<class USceneComponent*, struct FTransform> K2Node_MakeMap_Map;                                // 0x0030(0x0050)(ContainsInstancedReference)
};
static_assert(alignof(BP_Locker_02_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_Locker_02_C_UserConstructionScript");
static_assert(sizeof(BP_Locker_02_C_UserConstructionScript) == 0x000080, "Wrong size on BP_Locker_02_C_UserConstructionScript");
static_assert(offsetof(BP_Locker_02_C_UserConstructionScript, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000000, "Member 'BP_Locker_02_C_UserConstructionScript::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_UserConstructionScript, K2Node_MakeMap_Map) == 0x000030, "Member 'BP_Locker_02_C_UserConstructionScript::K2Node_MakeMap_Map' has a wrong offset!");

// Function BP_Locker_02.BP_Locker_02_C.setNumber
// 0x0018 (0x0018 - 0x0000)
struct BP_Locker_02_C_SetNumber final
{
public:
	int32                                         Number;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Locker_02_C_SetNumber) == 0x000008, "Wrong alignment on BP_Locker_02_C_SetNumber");
static_assert(sizeof(BP_Locker_02_C_SetNumber) == 0x000018, "Wrong size on BP_Locker_02_C_SetNumber");
static_assert(offsetof(BP_Locker_02_C_SetNumber, Number) == 0x000000, "Member 'BP_Locker_02_C_SetNumber::Number' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_SetNumber, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000004, "Member 'BP_Locker_02_C_SetNumber::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_SetNumber, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'BP_Locker_02_C_SetNumber::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_SetNumber, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_Locker_02_C_SetNumber::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_Locker_02.BP_Locker_02_C.randomizeSpawnedActorTransform
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Locker_02_C_RandomizeSpawnedActorTransform final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Locker_02_C_RandomizeSpawnedActorTransform) == 0x000010, "Wrong alignment on BP_Locker_02_C_RandomizeSpawnedActorTransform");
static_assert(sizeof(BP_Locker_02_C_RandomizeSpawnedActorTransform) == 0x0000D0, "Wrong size on BP_Locker_02_C_RandomizeSpawnedActorTransform");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, SpawnedActor) == 0x000000, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::SpawnedActor' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, Valid) == 0x000008, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::Valid' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, Transform) == 0x000010, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::Transform' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, CallFunc_RandomFloatInRange_ReturnValue) == 0x000040, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, CallFunc_GetActorBounds_Origin) == 0x000044, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, CallFunc_GetActorBounds_BoxExtent) == 0x000050, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, CallFunc_MakeRotator_ReturnValue) == 0x00005C, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, CallFunc_BreakVector_X) == 0x000068, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, CallFunc_BreakVector_Y) == 0x00006C, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, CallFunc_BreakVector_Z) == 0x000070, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, CallFunc_FMax_ReturnValue) == 0x000074, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000078, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00007C, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000080, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000084, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000088, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00008C, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, CallFunc_MakeVector_ReturnValue) == 0x000090, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_RandomizeSpawnedActorTransform, CallFunc_MakeTransform_ReturnValue) == 0x0000A0, "Member 'BP_Locker_02_C_RandomizeSpawnedActorTransform::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function BP_Locker_02.BP_Locker_02_C.PopulateSpawnInformationMap
// 0x0050 (0x0050 - 0x0000)
struct BP_Locker_02_C_PopulateSpawnInformationMap final
{
public:
	TMap<class USceneComponent*, struct FTransform> InOutSpawnDataMap;                                 // 0x0000(0x0050)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Locker_02_C_PopulateSpawnInformationMap) == 0x000008, "Wrong alignment on BP_Locker_02_C_PopulateSpawnInformationMap");
static_assert(sizeof(BP_Locker_02_C_PopulateSpawnInformationMap) == 0x000050, "Wrong size on BP_Locker_02_C_PopulateSpawnInformationMap");
static_assert(offsetof(BP_Locker_02_C_PopulateSpawnInformationMap, InOutSpawnDataMap) == 0x000000, "Member 'BP_Locker_02_C_PopulateSpawnInformationMap::InOutSpawnDataMap' has a wrong offset!");

// Function BP_Locker_02.BP_Locker_02_C.SpawnItemInContainer
// 0x0018 (0x0018 - 0x0000)
struct BP_Locker_02_C_SpawnItemInContainer final
{
public:
	class UClass*                                 WhatShould_Spawn;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RoomSpawnController_C*              RoomControllerRef;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SpawnedActor;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Locker_02_C_SpawnItemInContainer) == 0x000008, "Wrong alignment on BP_Locker_02_C_SpawnItemInContainer");
static_assert(sizeof(BP_Locker_02_C_SpawnItemInContainer) == 0x000018, "Wrong size on BP_Locker_02_C_SpawnItemInContainer");
static_assert(offsetof(BP_Locker_02_C_SpawnItemInContainer, WhatShould_Spawn) == 0x000000, "Member 'BP_Locker_02_C_SpawnItemInContainer::WhatShould_Spawn' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_SpawnItemInContainer, RoomControllerRef) == 0x000008, "Member 'BP_Locker_02_C_SpawnItemInContainer::RoomControllerRef' has a wrong offset!");
static_assert(offsetof(BP_Locker_02_C_SpawnItemInContainer, SpawnedActor) == 0x000010, "Member 'BP_Locker_02_C_SpawnItemInContainer::SpawnedActor' has a wrong offset!");

}

