#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LGT_SpotEmbedded_02

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function BP_LGT_SpotEmbedded_02.BP_LGT_SpotEmbedded_02_C.ExecuteUbergraph_BP_LGT_SpotEmbedded_02
// 0x003C (0x003C - 0x0000)
struct BP_LGT_SpotEmbedded_02_C_ExecuteUbergraph_BP_LGT_SpotEmbedded_02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZCosmeticDestructionType                   K2Node_ComponentBoundEvent_Type;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         K2Node_ComponentBoundEvent_HitContext;             // 0x000C(0x0030)(ConstParm, NoDestructor)
};
static_assert(alignof(BP_LGT_SpotEmbedded_02_C_ExecuteUbergraph_BP_LGT_SpotEmbedded_02) == 0x000004, "Wrong alignment on BP_LGT_SpotEmbedded_02_C_ExecuteUbergraph_BP_LGT_SpotEmbedded_02");
static_assert(sizeof(BP_LGT_SpotEmbedded_02_C_ExecuteUbergraph_BP_LGT_SpotEmbedded_02) == 0x00003C, "Wrong size on BP_LGT_SpotEmbedded_02_C_ExecuteUbergraph_BP_LGT_SpotEmbedded_02");
static_assert(offsetof(BP_LGT_SpotEmbedded_02_C_ExecuteUbergraph_BP_LGT_SpotEmbedded_02, EntryPoint) == 0x000000, "Member 'BP_LGT_SpotEmbedded_02_C_ExecuteUbergraph_BP_LGT_SpotEmbedded_02::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LGT_SpotEmbedded_02_C_ExecuteUbergraph_BP_LGT_SpotEmbedded_02, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'BP_LGT_SpotEmbedded_02_C_ExecuteUbergraph_BP_LGT_SpotEmbedded_02::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LGT_SpotEmbedded_02_C_ExecuteUbergraph_BP_LGT_SpotEmbedded_02, K2Node_ComponentBoundEvent_Type) == 0x000008, "Member 'BP_LGT_SpotEmbedded_02_C_ExecuteUbergraph_BP_LGT_SpotEmbedded_02::K2Node_ComponentBoundEvent_Type' has a wrong offset!");
static_assert(offsetof(BP_LGT_SpotEmbedded_02_C_ExecuteUbergraph_BP_LGT_SpotEmbedded_02, K2Node_ComponentBoundEvent_HitContext) == 0x00000C, "Member 'BP_LGT_SpotEmbedded_02_C_ExecuteUbergraph_BP_LGT_SpotEmbedded_02::K2Node_ComponentBoundEvent_HitContext' has a wrong offset!");

// Function BP_LGT_SpotEmbedded_02.BP_LGT_SpotEmbedded_02_C.BndEvt__BP_LGT_SpotEmbedded_02_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature
// 0x0034 (0x0034 - 0x0000)
struct BP_LGT_SpotEmbedded_02_C_BndEvt__BP_LGT_SpotEmbedded_02_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature final
{
public:
	ESBZCosmeticDestructionType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         HitContext;                                        // 0x0004(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_LGT_SpotEmbedded_02_C_BndEvt__BP_LGT_SpotEmbedded_02_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000004, "Wrong alignment on BP_LGT_SpotEmbedded_02_C_BndEvt__BP_LGT_SpotEmbedded_02_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(sizeof(BP_LGT_SpotEmbedded_02_C_BndEvt__BP_LGT_SpotEmbedded_02_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000034, "Wrong size on BP_LGT_SpotEmbedded_02_C_BndEvt__BP_LGT_SpotEmbedded_02_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(offsetof(BP_LGT_SpotEmbedded_02_C_BndEvt__BP_LGT_SpotEmbedded_02_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature, Type) == 0x000000, "Member 'BP_LGT_SpotEmbedded_02_C_BndEvt__BP_LGT_SpotEmbedded_02_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(BP_LGT_SpotEmbedded_02_C_BndEvt__BP_LGT_SpotEmbedded_02_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature, HitContext) == 0x000004, "Member 'BP_LGT_SpotEmbedded_02_C_BndEvt__BP_LGT_SpotEmbedded_02_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature::HitContext' has a wrong offset!");

}

