#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PoliceHelicopter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "BP_BaseHelicopter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PoliceHelicopter.BP_PoliceHelicopter_C
// 0x0040 (0x0700 - 0x06C0)
class ABP_PoliceHelicopter_C final : public ABP_BaseHelicopter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_PoliceHelicopter_C;              // 0x06B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZVehicleSpawnComponent*              SBZVehicleSpawn;                                   // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   SpawnGroupChildComp;                               // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Spawner4;                                          // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Spawner2;                                          // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Spawner1;                                          // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Spawner0;                                          // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZVariationSetData*                   VariationData;                                     // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PoliceHelicopter(int32 EntryPoint);
	void ReceiveOnDoorStateChanged(ESBZAerialVehicleDoor Door, bool bIsDoorOpen);
	void OnPawnSpawned(class APD3PawnSpawnGroup* SpawnGroup, class ASBZPawnSpawnBase* Spawner, class APawn* Pawn);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PoliceHelicopter_C">();
	}
	static class ABP_PoliceHelicopter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PoliceHelicopter_C>();
	}
};
static_assert(alignof(ABP_PoliceHelicopter_C) == 0x000010, "Wrong alignment on ABP_PoliceHelicopter_C");
static_assert(sizeof(ABP_PoliceHelicopter_C) == 0x000700, "Wrong size on ABP_PoliceHelicopter_C");
static_assert(offsetof(ABP_PoliceHelicopter_C, UberGraphFrame_BP_PoliceHelicopter_C) == 0x0006B8, "Member 'ABP_PoliceHelicopter_C::UberGraphFrame_BP_PoliceHelicopter_C' has a wrong offset!");
static_assert(offsetof(ABP_PoliceHelicopter_C, SBZVehicleSpawn) == 0x0006C0, "Member 'ABP_PoliceHelicopter_C::SBZVehicleSpawn' has a wrong offset!");
static_assert(offsetof(ABP_PoliceHelicopter_C, SpawnGroupChildComp) == 0x0006C8, "Member 'ABP_PoliceHelicopter_C::SpawnGroupChildComp' has a wrong offset!");
static_assert(offsetof(ABP_PoliceHelicopter_C, Spawner4) == 0x0006D0, "Member 'ABP_PoliceHelicopter_C::Spawner4' has a wrong offset!");
static_assert(offsetof(ABP_PoliceHelicopter_C, Spawner2) == 0x0006D8, "Member 'ABP_PoliceHelicopter_C::Spawner2' has a wrong offset!");
static_assert(offsetof(ABP_PoliceHelicopter_C, Spawner1) == 0x0006E0, "Member 'ABP_PoliceHelicopter_C::Spawner1' has a wrong offset!");
static_assert(offsetof(ABP_PoliceHelicopter_C, Spawner0) == 0x0006E8, "Member 'ABP_PoliceHelicopter_C::Spawner0' has a wrong offset!");
static_assert(offsetof(ABP_PoliceHelicopter_C, VariationData) == 0x0006F0, "Member 'ABP_PoliceHelicopter_C::VariationData' has a wrong offset!");

}

