#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlaceableSensorTool

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_PlaceableSensorTool.BP_PlaceableSensorTool_C.ExecuteUbergraph_BP_PlaceableSensorTool
// 0x0070 (0x0070 - 0x0000)
struct BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0054(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool) == 0x000008, "Wrong alignment on BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool");
static_assert(sizeof(BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool) == 0x000070, "Wrong size on BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool");
static_assert(offsetof(BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool, EntryPoint) == 0x000000, "Member 'BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool, Temp_struct_Variable) == 0x000008, "Member 'BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool, Temp_delegate_Variable) == 0x000018, "Member 'BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool, Temp_struct_Variable_1) == 0x000030, "Member 'BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool, Temp_delegate_Variable_1) == 0x000054, "Member 'BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool, CallFunc_PostEvent_ReturnValue) == 0x000068, "Member 'BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool, CallFunc_PostEvent_ReturnValue_1) == 0x00006C, "Member 'BP_PlaceableSensorTool_C_ExecuteUbergraph_BP_PlaceableSensorTool::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");

}

