#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplicatedBinaryActor_windows_blinder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function BP_ReplicatedBinaryActor_windows_blinder.BP_ReplicatedBinaryActor_windows_blinder_C.ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder
// 0x00C8 (0x00C8 - 0x0000)
struct BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStateToChangeTo;                     // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	class USBZBaseInteractableComponent*          K2Node_ComponentBoundEvent_Interactable;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                K2Node_ComponentBoundEvent_Interactor;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0048(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0064(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_ComponentBoundEvent_PoolComponent;          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Hits;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bDoCosmetics;           // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPropDamageContext                  K2Node_ComponentBoundEvent_DamageContext;          // 0x00B0(0x0018)(ConstParm, NoDestructor)
};
static_assert(alignof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder) == 0x000008, "Wrong alignment on BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder");
static_assert(sizeof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder) == 0x0000C8, "Wrong size on BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, EntryPoint) == 0x000000, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, Temp_delegate_Variable) == 0x000004, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, Temp_bool_Variable) == 0x000018, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, K2Node_Event_bStateToChangeTo) == 0x00001A, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::K2Node_Event_bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, K2Node_Event_bDoCosmetics) == 0x00001B, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, Temp_struct_Variable) == 0x000020, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, K2Node_ComponentBoundEvent_Interactable) == 0x000030, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, K2Node_ComponentBoundEvent_Interactor) == 0x000038, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::K2Node_ComponentBoundEvent_Interactor' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor) == 0x000040, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, Temp_struct_Variable_1) == 0x000048, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, Temp_delegate_Variable_1) == 0x000064, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000078, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, CallFunc_PostEvent_ReturnValue) == 0x00007C, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000080, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, CallFunc_PostEvent_ReturnValue_1) == 0x000084, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, CallFunc_IsDedicatedServer_ReturnValue) == 0x000088, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, CallFunc_MakeVector_ReturnValue_1) == 0x00008C, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000098, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, K2Node_ComponentBoundEvent_PoolComponent) == 0x0000A0, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::K2Node_ComponentBoundEvent_PoolComponent' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, K2Node_ComponentBoundEvent_Hits) == 0x0000A8, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::K2Node_ComponentBoundEvent_Hits' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, K2Node_ComponentBoundEvent_bDoCosmetics) == 0x0000AC, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::K2Node_ComponentBoundEvent_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder, K2Node_ComponentBoundEvent_DamageContext) == 0x0000B0, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_windows_blinder::K2Node_ComponentBoundEvent_DamageContext' has a wrong offset!");

// Function BP_ReplicatedBinaryActor_windows_blinder.BP_ReplicatedBinaryActor_windows_blinder_C.BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature final
{
public:
	class UActorComponent*                        PoolComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Hits;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoCosmetics;                                      // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPropDamageContext                  DamageContext;                                     // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature");
static_assert(sizeof(BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature) == 0x000028, "Wrong size on BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature, PoolComponent) == 0x000000, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature::PoolComponent' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature, Hits) == 0x000008, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature::Hits' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature, bDoCosmetics) == 0x00000C, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature::bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature, DamageContext) == 0x000010, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature::DamageContext' has a wrong offset!");

// Function BP_ReplicatedBinaryActor_windows_blinder.BP_ReplicatedBinaryActor_windows_blinder_C.BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZInteractable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZInteractable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature final
{
public:
	class USBZBaseInteractableComponent*          Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocallyControlledInteractor;                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZInteractable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature) == 0x000008, "Wrong alignment on BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZInteractable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature");
static_assert(sizeof(BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZInteractable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature) == 0x000018, "Wrong size on BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZInteractable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZInteractable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, Interactable) == 0x000000, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZInteractable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::Interactable' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZInteractable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, Interactor) == 0x000008, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZInteractable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZInteractable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, bIsLocallyControlledInteractor) == 0x000010, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_BndEvt__BP_ReplicatedBinaryActor_windows_blinder_SBZInteractable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::bIsLocallyControlledInteractor' has a wrong offset!");

// Function BP_ReplicatedBinaryActor_windows_blinder.BP_ReplicatedBinaryActor_windows_blinder_C.OnStateChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_ReplicatedBinaryActor_windows_blinder_C_OnStateChanged final
{
public:
	bool                                          bStateToChangeTo;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmetics;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ReplicatedBinaryActor_windows_blinder_C_OnStateChanged) == 0x000001, "Wrong alignment on BP_ReplicatedBinaryActor_windows_blinder_C_OnStateChanged");
static_assert(sizeof(BP_ReplicatedBinaryActor_windows_blinder_C_OnStateChanged) == 0x000002, "Wrong size on BP_ReplicatedBinaryActor_windows_blinder_C_OnStateChanged");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_OnStateChanged, bStateToChangeTo) == 0x000000, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_OnStateChanged::bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_OnStateChanged, bDoCosmetics) == 0x000001, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_OnStateChanged::bDoCosmetics' has a wrong offset!");

// Function BP_ReplicatedBinaryActor_windows_blinder.BP_ReplicatedBinaryActor_windows_blinder_C.Play_FX
// 0x0090 (0x0090 - 0x0000)
struct BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX) == 0x000010, "Wrong alignment on BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX");
static_assert(sizeof(BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX) == 0x000090, "Wrong size on BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX, CallFunc_GetComponentBounds_Origin) == 0x000004, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX, CallFunc_GetComponentBounds_BoxExtent) == 0x000010, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX, CallFunc_GetComponentBounds_SphereRadius) == 0x00001C, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000020, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000030, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX, CallFunc_BreakTransform_Location) == 0x000060, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX, CallFunc_BreakTransform_Rotation) == 0x00006C, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX, CallFunc_BreakTransform_Scale) == 0x000078, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000088, "Member 'BP_ReplicatedBinaryActor_windows_blinder_C_Play_FX::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

}

