#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpawnCloset_DoubleDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_SpawnCloset_DoubleDoor.BP_SpawnCloset_DoubleDoor_C.ExecuteUbergraph_BP_SpawnCloset_DoubleDoor
// 0x00C0 (0x00C0 - 0x0000)
struct BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0028(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x003C(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bOpen_1;                        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0068(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlaybackPosition_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bOpen;                          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bStateToChangeTo;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics_1;                       // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UNavArea>                   K2Node_Select_Default_1;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bActorsInCloset;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor) == 0x000008, "Wrong alignment on BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor");
static_assert(sizeof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor) == 0x0000C0, "Wrong size on BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, EntryPoint) == 0x000000, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, Temp_delegate_Variable) == 0x000004, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, CallFunc_BreakRotator_Roll) == 0x000018, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, CallFunc_BreakRotator_Pitch) == 0x00001C, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, CallFunc_BreakRotator_Yaw) == 0x000020, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, Temp_struct_Variable) == 0x000028, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, Temp_delegate_Variable_1) == 0x00003C, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, CallFunc_MakeRotator_ReturnValue) == 0x000050, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, Temp_bool_Variable) == 0x00005C, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, Temp_byte_Variable) == 0x00005D, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, Temp_byte_Variable_1) == 0x00005E, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, Temp_bool_Variable_1) == 0x00005F, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, K2Node_CustomEvent_bOpen_1) == 0x000060, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::K2Node_CustomEvent_bOpen_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, K2Node_Select_Default) == 0x000061, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, Temp_struct_Variable_1) == 0x000068, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, CallFunc_PostAkEvent_ReturnValue) == 0x000078, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, CallFunc_GetPlaybackPosition_ReturnValue) == 0x00007C, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::CallFunc_GetPlaybackPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, K2Node_CustomEvent_bOpen) == 0x000080, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::K2Node_CustomEvent_bOpen' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000081, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000084, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, K2Node_Event_bStateToChangeTo) == 0x000088, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::K2Node_Event_bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, K2Node_Event_bDoCosmetics_1) == 0x000089, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::K2Node_Event_bDoCosmetics_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, K2Node_Select_Default_1) == 0x000090, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, CallFunc_PostAkEvent_ReturnValue_1) == 0x000098, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, K2Node_Event_bActorsInCloset) == 0x00009C, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::K2Node_Event_bActorsInCloset' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, K2Node_Event_bDoCosmetics) == 0x00009D, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, CallFunc_BreakRotator_Roll_1) == 0x0000A0, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, CallFunc_BreakRotator_Pitch_1) == 0x0000A4, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, CallFunc_BreakRotator_Yaw_1) == 0x0000A8, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000AC, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor, CallFunc_MakeRotator_ReturnValue_1) == 0x0000B0, "Member 'BP_SpawnCloset_DoubleDoor_C_ExecuteUbergraph_BP_SpawnCloset_DoubleDoor::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");

// Function BP_SpawnCloset_DoubleDoor.BP_SpawnCloset_DoubleDoor_C.ReactToCloset
// 0x0002 (0x0002 - 0x0000)
struct BP_SpawnCloset_DoubleDoor_C_ReactToCloset final
{
public:
	bool                                          bActorsInCloset;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmetics;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpawnCloset_DoubleDoor_C_ReactToCloset) == 0x000001, "Wrong alignment on BP_SpawnCloset_DoubleDoor_C_ReactToCloset");
static_assert(sizeof(BP_SpawnCloset_DoubleDoor_C_ReactToCloset) == 0x000002, "Wrong size on BP_SpawnCloset_DoubleDoor_C_ReactToCloset");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ReactToCloset, bActorsInCloset) == 0x000000, "Member 'BP_SpawnCloset_DoubleDoor_C_ReactToCloset::bActorsInCloset' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_ReactToCloset, bDoCosmetics) == 0x000001, "Member 'BP_SpawnCloset_DoubleDoor_C_ReactToCloset::bDoCosmetics' has a wrong offset!");

// Function BP_SpawnCloset_DoubleDoor.BP_SpawnCloset_DoubleDoor_C.OnStateChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_SpawnCloset_DoubleDoor_C_OnStateChanged final
{
public:
	bool                                          bStateToChangeTo;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmetics;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpawnCloset_DoubleDoor_C_OnStateChanged) == 0x000001, "Wrong alignment on BP_SpawnCloset_DoubleDoor_C_OnStateChanged");
static_assert(sizeof(BP_SpawnCloset_DoubleDoor_C_OnStateChanged) == 0x000002, "Wrong size on BP_SpawnCloset_DoubleDoor_C_OnStateChanged");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_OnStateChanged, bStateToChangeTo) == 0x000000, "Member 'BP_SpawnCloset_DoubleDoor_C_OnStateChanged::bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_OnStateChanged, bDoCosmetics) == 0x000001, "Member 'BP_SpawnCloset_DoubleDoor_C_OnStateChanged::bDoCosmetics' has a wrong offset!");

// Function BP_SpawnCloset_DoubleDoor.BP_SpawnCloset_DoubleDoor_C.Open Doors No Cosmetics
// 0x0001 (0x0001 - 0x0000)
struct BP_SpawnCloset_DoubleDoor_C_Open_Doors_No_Cosmetics final
{
public:
	bool                                          bOpen;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpawnCloset_DoubleDoor_C_Open_Doors_No_Cosmetics) == 0x000001, "Wrong alignment on BP_SpawnCloset_DoubleDoor_C_Open_Doors_No_Cosmetics");
static_assert(sizeof(BP_SpawnCloset_DoubleDoor_C_Open_Doors_No_Cosmetics) == 0x000001, "Wrong size on BP_SpawnCloset_DoubleDoor_C_Open_Doors_No_Cosmetics");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_Open_Doors_No_Cosmetics, bOpen) == 0x000000, "Member 'BP_SpawnCloset_DoubleDoor_C_Open_Doors_No_Cosmetics::bOpen' has a wrong offset!");

// Function BP_SpawnCloset_DoubleDoor.BP_SpawnCloset_DoubleDoor_C.OpenDoors_Internal
// 0x0001 (0x0001 - 0x0000)
struct BP_SpawnCloset_DoubleDoor_C_OpenDoors_Internal final
{
public:
	bool                                          bOpen;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpawnCloset_DoubleDoor_C_OpenDoors_Internal) == 0x000001, "Wrong alignment on BP_SpawnCloset_DoubleDoor_C_OpenDoors_Internal");
static_assert(sizeof(BP_SpawnCloset_DoubleDoor_C_OpenDoors_Internal) == 0x000001, "Wrong size on BP_SpawnCloset_DoubleDoor_C_OpenDoors_Internal");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_OpenDoors_Internal, bOpen) == 0x000000, "Member 'BP_SpawnCloset_DoubleDoor_C_OpenDoors_Internal::bOpen' has a wrong offset!");

// Function BP_SpawnCloset_DoubleDoor.BP_SpawnCloset_DoubleDoor_C.DoorPositionInterp
// 0x0034 (0x0034 - 0x0000)
struct BP_SpawnCloset_DoubleDoor_C_DoorPositionInterp final
{
public:
	struct FRotator                               Original;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               Offset;                                            // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Alpha;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ReturnValue;                                       // 0x001C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SpawnCloset_DoubleDoor_C_DoorPositionInterp) == 0x000004, "Wrong alignment on BP_SpawnCloset_DoubleDoor_C_DoorPositionInterp");
static_assert(sizeof(BP_SpawnCloset_DoubleDoor_C_DoorPositionInterp) == 0x000034, "Wrong size on BP_SpawnCloset_DoubleDoor_C_DoorPositionInterp");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_DoorPositionInterp, Original) == 0x000000, "Member 'BP_SpawnCloset_DoubleDoor_C_DoorPositionInterp::Original' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_DoorPositionInterp, Offset) == 0x00000C, "Member 'BP_SpawnCloset_DoubleDoor_C_DoorPositionInterp::Offset' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_DoorPositionInterp, Alpha) == 0x000018, "Member 'BP_SpawnCloset_DoubleDoor_C_DoorPositionInterp::Alpha' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_DoorPositionInterp, ReturnValue) == 0x00001C, "Member 'BP_SpawnCloset_DoubleDoor_C_DoorPositionInterp::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_DoorPositionInterp, CallFunc_RLerp_ReturnValue) == 0x000028, "Member 'BP_SpawnCloset_DoubleDoor_C_DoorPositionInterp::CallFunc_RLerp_ReturnValue' has a wrong offset!");

// Function BP_SpawnCloset_DoubleDoor.BP_SpawnCloset_DoubleDoor_C.Set Relative Position Interp
// 0x00C0 (0x00C0 - 0x0000)
struct BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp final
{
public:
	class USceneComponent*                        Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Original;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               Offset;                                            // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Alpha;                                             // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_DoorPositionInterp_ReturnValue;           // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0030(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp) == 0x000008, "Wrong alignment on BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp");
static_assert(sizeof(BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp) == 0x0000C0, "Wrong size on BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp, Component) == 0x000000, "Member 'BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp::Component' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp, Original) == 0x000008, "Member 'BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp::Original' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp, Offset) == 0x000014, "Member 'BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp::Offset' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp, Alpha) == 0x000020, "Member 'BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp::Alpha' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp, CallFunc_DoorPositionInterp_ReturnValue) == 0x000024, "Member 'BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp::CallFunc_DoorPositionInterp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000030, "Member 'BP_SpawnCloset_DoubleDoor_C_Set_Relative_Position_Interp::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

