#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShutterBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ShutterBase.BP_ShutterBase_C
// 0x0048 (0x0320 - 0x02D8)
class ABP_ShutterBase_C : public ASBZReplicatedBinaryStateActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   ShutterMesh;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CloseColision;                                     // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZRoomConnectorComponent*             SBZRoomConnector;                                  // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          OpenCollision;                                     // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Open_timeline_Offset_53685EE84532271AE1B8F8B9086F8F61; // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Open_timeline__Direction_53685EE84532271AE1B8F8B9086F8F61; // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Open_timeline;                                     // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimStartGameTime;                                 // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ShutterBase(int32 EntryPoint);
	void OnStateChanged(bool bStateToChangeTo, bool bDoCosmetics);
	void Open_timeline__UpdateFunc();
	void Open_timeline__FinishedFunc();
	void UserConstructionScript();
	void SetStateFunction(ESBZVehicleDoorState State, bool AnimateOpening);
	void SetShutterCollision(bool Open);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ShutterBase_C">();
	}
	static class ABP_ShutterBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ShutterBase_C>();
	}
};
static_assert(alignof(ABP_ShutterBase_C) == 0x000008, "Wrong alignment on ABP_ShutterBase_C");
static_assert(sizeof(ABP_ShutterBase_C) == 0x000320, "Wrong size on ABP_ShutterBase_C");
static_assert(offsetof(ABP_ShutterBase_C, UberGraphFrame) == 0x0002D8, "Member 'ABP_ShutterBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ShutterBase_C, ShutterMesh) == 0x0002E0, "Member 'ABP_ShutterBase_C::ShutterMesh' has a wrong offset!");
static_assert(offsetof(ABP_ShutterBase_C, Scene) == 0x0002E8, "Member 'ABP_ShutterBase_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_ShutterBase_C, CloseColision) == 0x0002F0, "Member 'ABP_ShutterBase_C::CloseColision' has a wrong offset!");
static_assert(offsetof(ABP_ShutterBase_C, SBZRoomConnector) == 0x0002F8, "Member 'ABP_ShutterBase_C::SBZRoomConnector' has a wrong offset!");
static_assert(offsetof(ABP_ShutterBase_C, OpenCollision) == 0x000300, "Member 'ABP_ShutterBase_C::OpenCollision' has a wrong offset!");
static_assert(offsetof(ABP_ShutterBase_C, Open_timeline_Offset_53685EE84532271AE1B8F8B9086F8F61) == 0x000308, "Member 'ABP_ShutterBase_C::Open_timeline_Offset_53685EE84532271AE1B8F8B9086F8F61' has a wrong offset!");
static_assert(offsetof(ABP_ShutterBase_C, Open_timeline__Direction_53685EE84532271AE1B8F8B9086F8F61) == 0x00030C, "Member 'ABP_ShutterBase_C::Open_timeline__Direction_53685EE84532271AE1B8F8B9086F8F61' has a wrong offset!");
static_assert(offsetof(ABP_ShutterBase_C, Open_timeline) == 0x000310, "Member 'ABP_ShutterBase_C::Open_timeline' has a wrong offset!");
static_assert(offsetof(ABP_ShutterBase_C, AnimStartGameTime) == 0x000318, "Member 'ABP_ShutterBase_C::AnimStartGameTime' has a wrong offset!");

}

