#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpawnCloset_DoubleDoor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SpawnCloset_DoubleDoor.BP_SpawnCloset_DoubleDoor_C
// 0x00B8 (0x0390 - 0x02D8)
class ABP_SpawnCloset_DoubleDoor_C final : public ASBZReplicatedBinaryStateActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          RealestDoor_1;                                     // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Handle_1;                                          // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DoorLeft;                                          // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Hinge_1;                                           // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Handle;                                            // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          RealestDoor;                                       // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   DoorRight;                                         // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Hinge;                                             // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Frame;                                             // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNavModifierComponent*                  NavModifier;                                       // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OpenTimeline_OpenAlpha_37E97B5D483BB6D32BFAACB6254A48B7; // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OpenTimeline__Direction_37E97B5D483BB6D32BFAACB6254A48B7; // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OpenTimeline;                                      // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DoorRightOpenOffset;                               // 0x0350(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DoorRightOriginalLocation;                         // 0x035C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ClosedNavAreaClass;                                // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 OpenNavAreaClass;                                  // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Closed;                                            // 0x0378(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Open;                                              // 0x0384(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_SpawnCloset_DoubleDoor(int32 EntryPoint);
	void ReactToCloset(bool bActorsInCloset, bool bDoCosmetics);
	void OnStateChanged(bool bStateToChangeTo, bool bDoCosmetics);
	void Open_Doors_No_Cosmetics(bool bOpen);
	void OpenDoors_Internal(bool bOpen);
	void OpenTimeline__SwitchDoor__EventFunc();
	void OpenTimeline__UpdateFunc();
	void OpenTimeline__FinishedFunc();
	struct FRotator DoorPositionInterp(const struct FRotator& Original, const struct FRotator& Offset, float Alpha);
	void Set_Relative_Position_Interp(class USceneComponent* Component, const struct FRotator& Original, const struct FRotator& Offset, float Alpha);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SpawnCloset_DoubleDoor_C">();
	}
	static class ABP_SpawnCloset_DoubleDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SpawnCloset_DoubleDoor_C>();
	}
};
static_assert(alignof(ABP_SpawnCloset_DoubleDoor_C) == 0x000008, "Wrong alignment on ABP_SpawnCloset_DoubleDoor_C");
static_assert(sizeof(ABP_SpawnCloset_DoubleDoor_C) == 0x000390, "Wrong size on ABP_SpawnCloset_DoubleDoor_C");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, UberGraphFrame) == 0x0002D8, "Member 'ABP_SpawnCloset_DoubleDoor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, RealestDoor_1) == 0x0002E0, "Member 'ABP_SpawnCloset_DoubleDoor_C::RealestDoor_1' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, Handle_1) == 0x0002E8, "Member 'ABP_SpawnCloset_DoubleDoor_C::Handle_1' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, DoorLeft) == 0x0002F0, "Member 'ABP_SpawnCloset_DoubleDoor_C::DoorLeft' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, Hinge_1) == 0x0002F8, "Member 'ABP_SpawnCloset_DoubleDoor_C::Hinge_1' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, Handle) == 0x000300, "Member 'ABP_SpawnCloset_DoubleDoor_C::Handle' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, RealestDoor) == 0x000308, "Member 'ABP_SpawnCloset_DoubleDoor_C::RealestDoor' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, DoorRight) == 0x000310, "Member 'ABP_SpawnCloset_DoubleDoor_C::DoorRight' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, Hinge) == 0x000318, "Member 'ABP_SpawnCloset_DoubleDoor_C::Hinge' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, Frame) == 0x000320, "Member 'ABP_SpawnCloset_DoubleDoor_C::Frame' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, NavModifier) == 0x000328, "Member 'ABP_SpawnCloset_DoubleDoor_C::NavModifier' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, Ak) == 0x000330, "Member 'ABP_SpawnCloset_DoubleDoor_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, Scene) == 0x000338, "Member 'ABP_SpawnCloset_DoubleDoor_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, OpenTimeline_OpenAlpha_37E97B5D483BB6D32BFAACB6254A48B7) == 0x000340, "Member 'ABP_SpawnCloset_DoubleDoor_C::OpenTimeline_OpenAlpha_37E97B5D483BB6D32BFAACB6254A48B7' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, OpenTimeline__Direction_37E97B5D483BB6D32BFAACB6254A48B7) == 0x000344, "Member 'ABP_SpawnCloset_DoubleDoor_C::OpenTimeline__Direction_37E97B5D483BB6D32BFAACB6254A48B7' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, OpenTimeline) == 0x000348, "Member 'ABP_SpawnCloset_DoubleDoor_C::OpenTimeline' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, DoorRightOpenOffset) == 0x000350, "Member 'ABP_SpawnCloset_DoubleDoor_C::DoorRightOpenOffset' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, DoorRightOriginalLocation) == 0x00035C, "Member 'ABP_SpawnCloset_DoubleDoor_C::DoorRightOriginalLocation' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, ClosedNavAreaClass) == 0x000368, "Member 'ABP_SpawnCloset_DoubleDoor_C::ClosedNavAreaClass' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, OpenNavAreaClass) == 0x000370, "Member 'ABP_SpawnCloset_DoubleDoor_C::OpenNavAreaClass' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, Closed) == 0x000378, "Member 'ABP_SpawnCloset_DoubleDoor_C::Closed' has a wrong offset!");
static_assert(offsetof(ABP_SpawnCloset_DoubleDoor_C, Open) == 0x000384, "Member 'ABP_SpawnCloset_DoubleDoor_C::Open' has a wrong offset!");

}

