#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Throwable_FragGrenade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Throwable_FragGrenade.BP_Throwable_FragGrenade_C.ExecuteUbergraph_BP_Throwable_FragGrenade
// 0x0260 (0x0260 - 0x0000)
struct BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0050(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class ABP_DB_Throwable_Frag_Grenade_Lever_C*  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Current_Value_167B418541A9357FDBD4B1BE67ED8544_Variable; // 0x00F0(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initialized_167B418541A9357FDBD4B1BE67ED8544_Variable; // 0x00F4(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult_1;         // 0x00FC(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_ComponentBoundEvent_ImpactVelocity;         // 0x018C(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x0198(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade) == 0x000010, "Wrong alignment on BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade");
static_assert(sizeof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade) == 0x000260, "Wrong size on BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, EntryPoint) == 0x000000, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_GetTransform_ReturnValue_1) == 0x000050, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_FinishSpawningActor_ReturnValue) == 0x000080, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_BreakTransform_Location) == 0x000088, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_BreakTransform_Rotation) == 0x000094, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_BreakTransform_Scale) == 0x0000A0, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_GetForwardVector_ReturnValue) == 0x0000AC, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_GetRightVector_ReturnValue) == 0x0000B8, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_VLerp_ReturnValue) == 0x0000C4, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_RandomFloatInRange_ReturnValue) == 0x0000D0, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x0000D4, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000D8, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_MakeVector_ReturnValue) == 0x0000E4, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, Temp_int_Current_Value_167B418541A9357FDBD4B1BE67ED8544_Variable) == 0x0000F0, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::Temp_int_Current_Value_167B418541A9357FDBD4B1BE67ED8544_Variable' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, Temp_bool_Has_Been_Initialized_167B418541A9357FDBD4B1BE67ED8544_Variable) == 0x0000F4, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::Temp_bool_Has_Been_Initialized_167B418541A9357FDBD4B1BE67ED8544_Variable' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000F5, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_Add_IntInt_ReturnValue) == 0x0000F8, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, K2Node_ComponentBoundEvent_ImpactResult_1) == 0x0000FC, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::K2Node_ComponentBoundEvent_ImpactResult_1' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, K2Node_ComponentBoundEvent_ImpactVelocity) == 0x00018C, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::K2Node_ComponentBoundEvent_ImpactVelocity' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, K2Node_ComponentBoundEvent_ImpactResult) == 0x000198, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::K2Node_ComponentBoundEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_GetOwner_ReturnValue) == 0x000228, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_IsValid_ReturnValue) == 0x000230, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_GetVelocity_ReturnValue) == 0x000234, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_Add_VectorVector_ReturnValue) == 0x000240, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade, CallFunc_Add_VectorVector_ReturnValue_1) == 0x00024C, "Member 'BP_Throwable_FragGrenade_C_ExecuteUbergraph_BP_Throwable_FragGrenade::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");

// Function BP_Throwable_FragGrenade.BP_Throwable_FragGrenade_C.BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature
// 0x0090 (0x0090 - 0x0000)
struct BP_Throwable_FragGrenade_C_BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Throwable_FragGrenade_C_BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature) == 0x000004, "Wrong alignment on BP_Throwable_FragGrenade_C_BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature");
static_assert(sizeof(BP_Throwable_FragGrenade_C_BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature) == 0x000090, "Wrong size on BP_Throwable_FragGrenade_C_BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature");
static_assert(offsetof(BP_Throwable_FragGrenade_C_BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'BP_Throwable_FragGrenade_C_BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_OnProjectileStopDelegate__DelegateSignature::ImpactResult' has a wrong offset!");

// Function BP_Throwable_FragGrenade.BP_Throwable_FragGrenade_C.BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature
// 0x009C (0x009C - 0x0000)
struct BP_Throwable_FragGrenade_C_BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                ImpactVelocity;                                    // 0x0090(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Throwable_FragGrenade_C_BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature) == 0x000004, "Wrong alignment on BP_Throwable_FragGrenade_C_BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature");
static_assert(sizeof(BP_Throwable_FragGrenade_C_BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature) == 0x00009C, "Wrong size on BP_Throwable_FragGrenade_C_BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature");
static_assert(offsetof(BP_Throwable_FragGrenade_C_BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'BP_Throwable_FragGrenade_C_BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature::ImpactResult' has a wrong offset!");
static_assert(offsetof(BP_Throwable_FragGrenade_C_BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature, ImpactVelocity) == 0x000090, "Member 'BP_Throwable_FragGrenade_C_BndEvt__BP_Throwable_FragGrenade_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature::ImpactVelocity' has a wrong offset!");

// Function BP_Throwable_FragGrenade.BP_Throwable_FragGrenade_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Throwable_FragGrenade_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Throwable_FragGrenade_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Throwable_FragGrenade_C_ReceiveTick");
static_assert(sizeof(BP_Throwable_FragGrenade_C_ReceiveTick) == 0x000004, "Wrong size on BP_Throwable_FragGrenade_C_ReceiveTick");
static_assert(offsetof(BP_Throwable_FragGrenade_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Throwable_FragGrenade_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

