#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trashcan_01_VFX

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Trashcan_01_VFX.BP_Trashcan_01_VFX_C.ExecuteUbergraph_BP_Trashcan_01_VFX
// 0x0090 (0x0090 - 0x0000)
struct BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZCosmeticDestructionType                   K2Node_ComponentBoundEvent_Type;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         K2Node_ComponentBoundEvent_HitContext;             // 0x0008(0x0030)(ConstParm, NoDestructor)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX) == 0x000010, "Wrong alignment on BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX");
static_assert(sizeof(BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX) == 0x000090, "Wrong size on BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX");
static_assert(offsetof(BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX, EntryPoint) == 0x000000, "Member 'BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX, K2Node_ComponentBoundEvent_Type) == 0x000005, "Member 'BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX::K2Node_ComponentBoundEvent_Type' has a wrong offset!");
static_assert(offsetof(BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX, K2Node_ComponentBoundEvent_HitContext) == 0x000008, "Member 'BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX::K2Node_ComponentBoundEvent_HitContext' has a wrong offset!");
static_assert(offsetof(BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000040, "Member 'BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX, CallFunc_TransformLocation_ReturnValue) == 0x000070, "Member 'BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX, CallFunc_Add_VectorVector_ReturnValue) == 0x00007C, "Member 'BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000088, "Member 'BP_Trashcan_01_VFX_C_ExecuteUbergraph_BP_Trashcan_01_VFX::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function BP_Trashcan_01_VFX.BP_Trashcan_01_VFX_C.BndEvt__BP_Trashcan_01_VFX_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature
// 0x0034 (0x0034 - 0x0000)
struct BP_Trashcan_01_VFX_C_BndEvt__BP_Trashcan_01_VFX_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature final
{
public:
	ESBZCosmeticDestructionType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         HitContext;                                        // 0x0004(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_Trashcan_01_VFX_C_BndEvt__BP_Trashcan_01_VFX_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000004, "Wrong alignment on BP_Trashcan_01_VFX_C_BndEvt__BP_Trashcan_01_VFX_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(sizeof(BP_Trashcan_01_VFX_C_BndEvt__BP_Trashcan_01_VFX_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000034, "Wrong size on BP_Trashcan_01_VFX_C_BndEvt__BP_Trashcan_01_VFX_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(offsetof(BP_Trashcan_01_VFX_C_BndEvt__BP_Trashcan_01_VFX_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature, Type) == 0x000000, "Member 'BP_Trashcan_01_VFX_C_BndEvt__BP_Trashcan_01_VFX_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(BP_Trashcan_01_VFX_C_BndEvt__BP_Trashcan_01_VFX_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature, HitContext) == 0x000004, "Member 'BP_Trashcan_01_VFX_C_BndEvt__BP_Trashcan_01_VFX_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature::HitContext' has a wrong offset!");

}

