#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThrowableKnife

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ThrowableKnife.BP_ThrowableKnife_C
// 0x0020 (0x6180 - 0x6160)
class ABP_ThrowableKnife_C final : public ASBZThrowableKnife
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x6160(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZNiagaraWwiseComponentNonOpt*        SBZNiagaraWwiseComponentNonOpt_RegularEffect;      // 0x6168(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZNiagaraWwiseComponentNonOpt*        SBZNiagaraWwiseComponentNonOpt;                    // 0x6170(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x6178(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void OnThrow();
	void BndEvt__BP_ThrowableKnife_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature(const struct FHitResult& ImpactResult, const struct FVector& ImpactVelocity);
	void ExecuteUbergraph_BP_ThrowableKnife(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ThrowableKnife_C">();
	}
	static class ABP_ThrowableKnife_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ThrowableKnife_C>();
	}
};
static_assert(alignof(ABP_ThrowableKnife_C) == 0x000010, "Wrong alignment on ABP_ThrowableKnife_C");
static_assert(sizeof(ABP_ThrowableKnife_C) == 0x006180, "Wrong size on ABP_ThrowableKnife_C");
static_assert(offsetof(ABP_ThrowableKnife_C, UberGraphFrame) == 0x006160, "Member 'ABP_ThrowableKnife_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ThrowableKnife_C, SBZNiagaraWwiseComponentNonOpt_RegularEffect) == 0x006168, "Member 'ABP_ThrowableKnife_C::SBZNiagaraWwiseComponentNonOpt_RegularEffect' has a wrong offset!");
static_assert(offsetof(ABP_ThrowableKnife_C, SBZNiagaraWwiseComponentNonOpt) == 0x006170, "Member 'ABP_ThrowableKnife_C::SBZNiagaraWwiseComponentNonOpt' has a wrong offset!");
static_assert(offsetof(ABP_ThrowableKnife_C, SBZOutline) == 0x006178, "Member 'ABP_ThrowableKnife_C::SBZOutline' has a wrong offset!");

}

