#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThrowableKnife

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ThrowableKnife.BP_ThrowableKnife_C.BndEvt__BP_ThrowableKnife_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature
// 0x009C (0x009C - 0x0000)
struct BP_ThrowableKnife_C_BndEvt__BP_ThrowableKnife_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                ImpactVelocity;                                    // 0x0090(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThrowableKnife_C_BndEvt__BP_ThrowableKnife_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature) == 0x000004, "Wrong alignment on BP_ThrowableKnife_C_BndEvt__BP_ThrowableKnife_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature");
static_assert(sizeof(BP_ThrowableKnife_C_BndEvt__BP_ThrowableKnife_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature) == 0x00009C, "Wrong size on BP_ThrowableKnife_C_BndEvt__BP_ThrowableKnife_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature");
static_assert(offsetof(BP_ThrowableKnife_C_BndEvt__BP_ThrowableKnife_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature, ImpactResult) == 0x000000, "Member 'BP_ThrowableKnife_C_BndEvt__BP_ThrowableKnife_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature::ImpactResult' has a wrong offset!");
static_assert(offsetof(BP_ThrowableKnife_C_BndEvt__BP_ThrowableKnife_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature, ImpactVelocity) == 0x000090, "Member 'BP_ThrowableKnife_C_BndEvt__BP_ThrowableKnife_ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature::ImpactVelocity' has a wrong offset!");

// Function BP_ThrowableKnife.BP_ThrowableKnife_C.ExecuteUbergraph_BP_ThrowableKnife
// 0x00B8 (0x00B8 - 0x0000)
struct BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x0018(0x0090)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                K2Node_ComponentBoundEvent_ImpactVelocity;         // 0x00A8(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasRetrieverSkill_ReturnValue;            // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife) == 0x000008, "Wrong alignment on BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife");
static_assert(sizeof(BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife) == 0x0000B8, "Wrong size on BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife");
static_assert(offsetof(BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife, EntryPoint) == 0x000000, "Member 'BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000004, "Member 'BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000010, "Member 'BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife, K2Node_ComponentBoundEvent_ImpactResult) == 0x000018, "Member 'BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife::K2Node_ComponentBoundEvent_ImpactResult' has a wrong offset!");
static_assert(offsetof(BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife, K2Node_ComponentBoundEvent_ImpactVelocity) == 0x0000A8, "Member 'BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife::K2Node_ComponentBoundEvent_ImpactVelocity' has a wrong offset!");
static_assert(offsetof(BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000B4, "Member 'BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife, CallFunc_HasRetrieverSkill_ReturnValue) == 0x0000B5, "Member 'BP_ThrowableKnife_C_ExecuteUbergraph_BP_ThrowableKnife::CallFunc_HasRetrieverSkill_ReturnValue' has a wrong offset!");

}

