#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VantagePoint

#include "Basic.hpp"

#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VantagePoint.BP_VantagePoint_C
// 0x0018 (0x02C8 - 0x02B0)
class ABP_VantagePoint_C final : public ASBZVantagePoint
{
public:
	class UStaticMeshComponent*                   CoverSurface;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Forward;                                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Ground;                                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VantagePoint_C">();
	}
	static class ABP_VantagePoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VantagePoint_C>();
	}
};
static_assert(alignof(ABP_VantagePoint_C) == 0x000008, "Wrong alignment on ABP_VantagePoint_C");
static_assert(sizeof(ABP_VantagePoint_C) == 0x0002C8, "Wrong size on ABP_VantagePoint_C");
static_assert(offsetof(ABP_VantagePoint_C, CoverSurface) == 0x0002B0, "Member 'ABP_VantagePoint_C::CoverSurface' has a wrong offset!");
static_assert(offsetof(ABP_VantagePoint_C, Forward) == 0x0002B8, "Member 'ABP_VantagePoint_C::Forward' has a wrong offset!");
static_assert(offsetof(ABP_VantagePoint_C, Ground) == 0x0002C0, "Member 'ABP_VantagePoint_C::Ground' has a wrong offset!");

}

