#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WindowCleaningCradle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WindowCleaningCradle.BP_WindowCleaningCradle_C
// 0x0138 (0x0490 - 0x0358)
class ABP_WindowCleaningCradle_C final : public ASBZModifiableTimer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation015;                                    // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation014;                                    // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation013;                                    // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation012;                                    // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation011;                                    // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation010;                                    // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation09;                                     // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation08;                                     // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation07;                                     // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation01;                                     // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation05;                                     // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation04;                                     // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation03;                                     // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation02;                                     // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation06;                                     // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CableLocation_04;                                  // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CableLocation_03;                                  // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CableLocation_02;                                  // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CableLocation_01;                                  // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZCableComponent*                     SBZCable4;                                         // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZCableComponent*                     SBZCable3;                                         // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZCableComponent*                     SBZCable2;                                         // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZCableComponent*                     SBZCable1;                                         // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_DigitalZone;                                    // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZSecuredBagVisualizeComponent*       SBZSecuredBagVisualize;                            // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        MarkerLocation;                                    // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PlatformBuilding_01;                               // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneCradle;                                       // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PlatformBuilding_01_Lift_0_2;                      // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PlatformBuilding_01_Lift_01;                       // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneLiftSupport;                                  // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartLocation;                                     // 0x0460(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndLocation;                                       // 0x046C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnCradleLowered;                                   // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         MarkerID;                                          // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnCradleLowered__DelegateSignature();
	void ExecuteUbergraph_BP_WindowCleaningCradle(int32 EntryPoint);
	void BndEvt__BP_EscapeVan_SBZSecuredBagVisualize_K2Node_ComponentBoundEvent_0_SBZSecuredBagVisualizeBagAddedSignature__DelegateSignature(const class USBZBagType* BagType);
	void BP_OnStateChanged(ESBZTimerState NewState, ESBZTimerState OldState, bool bDoCosmetics);
	void ReceiveTick(float DeltaSeconds);
	void SetPlatformLocation();
	void ShowMarker();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WindowCleaningCradle_C">();
	}
	static class ABP_WindowCleaningCradle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WindowCleaningCradle_C>();
	}
};
static_assert(alignof(ABP_WindowCleaningCradle_C) == 0x000008, "Wrong alignment on ABP_WindowCleaningCradle_C");
static_assert(sizeof(ABP_WindowCleaningCradle_C) == 0x000490, "Wrong size on ABP_WindowCleaningCradle_C");
static_assert(offsetof(ABP_WindowCleaningCradle_C, UberGraphFrame) == 0x000358, "Member 'ABP_WindowCleaningCradle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, Ak) == 0x000360, "Member 'ABP_WindowCleaningCradle_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, BagLocation015) == 0x000368, "Member 'ABP_WindowCleaningCradle_C::BagLocation015' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, BagLocation014) == 0x000370, "Member 'ABP_WindowCleaningCradle_C::BagLocation014' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, BagLocation013) == 0x000378, "Member 'ABP_WindowCleaningCradle_C::BagLocation013' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, BagLocation012) == 0x000380, "Member 'ABP_WindowCleaningCradle_C::BagLocation012' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, BagLocation011) == 0x000388, "Member 'ABP_WindowCleaningCradle_C::BagLocation011' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, BagLocation010) == 0x000390, "Member 'ABP_WindowCleaningCradle_C::BagLocation010' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, BagLocation09) == 0x000398, "Member 'ABP_WindowCleaningCradle_C::BagLocation09' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, BagLocation08) == 0x0003A0, "Member 'ABP_WindowCleaningCradle_C::BagLocation08' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, BagLocation07) == 0x0003A8, "Member 'ABP_WindowCleaningCradle_C::BagLocation07' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, BagLocation01) == 0x0003B0, "Member 'ABP_WindowCleaningCradle_C::BagLocation01' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, BagLocation05) == 0x0003B8, "Member 'ABP_WindowCleaningCradle_C::BagLocation05' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, BagLocation04) == 0x0003C0, "Member 'ABP_WindowCleaningCradle_C::BagLocation04' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, BagLocation03) == 0x0003C8, "Member 'ABP_WindowCleaningCradle_C::BagLocation03' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, BagLocation02) == 0x0003D0, "Member 'ABP_WindowCleaningCradle_C::BagLocation02' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, BagLocation06) == 0x0003D8, "Member 'ABP_WindowCleaningCradle_C::BagLocation06' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, CableLocation_04) == 0x0003E0, "Member 'ABP_WindowCleaningCradle_C::CableLocation_04' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, CableLocation_03) == 0x0003E8, "Member 'ABP_WindowCleaningCradle_C::CableLocation_03' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, CableLocation_02) == 0x0003F0, "Member 'ABP_WindowCleaningCradle_C::CableLocation_02' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, CableLocation_01) == 0x0003F8, "Member 'ABP_WindowCleaningCradle_C::CableLocation_01' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, SBZCable4) == 0x000400, "Member 'ABP_WindowCleaningCradle_C::SBZCable4' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, SBZCable3) == 0x000408, "Member 'ABP_WindowCleaningCradle_C::SBZCable3' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, SBZCable2) == 0x000410, "Member 'ABP_WindowCleaningCradle_C::SBZCable2' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, SBZCable1) == 0x000418, "Member 'ABP_WindowCleaningCradle_C::SBZCable1' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, FX_DigitalZone) == 0x000420, "Member 'ABP_WindowCleaningCradle_C::FX_DigitalZone' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, SBZSecuredBagVisualize) == 0x000428, "Member 'ABP_WindowCleaningCradle_C::SBZSecuredBagVisualize' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, MarkerLocation) == 0x000430, "Member 'ABP_WindowCleaningCradle_C::MarkerLocation' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, PlatformBuilding_01) == 0x000438, "Member 'ABP_WindowCleaningCradle_C::PlatformBuilding_01' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, SceneCradle) == 0x000440, "Member 'ABP_WindowCleaningCradle_C::SceneCradle' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, PlatformBuilding_01_Lift_0_2) == 0x000448, "Member 'ABP_WindowCleaningCradle_C::PlatformBuilding_01_Lift_0_2' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, PlatformBuilding_01_Lift_01) == 0x000450, "Member 'ABP_WindowCleaningCradle_C::PlatformBuilding_01_Lift_01' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, SceneLiftSupport) == 0x000458, "Member 'ABP_WindowCleaningCradle_C::SceneLiftSupport' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, StartLocation) == 0x000460, "Member 'ABP_WindowCleaningCradle_C::StartLocation' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, EndLocation) == 0x00046C, "Member 'ABP_WindowCleaningCradle_C::EndLocation' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, OnCradleLowered) == 0x000478, "Member 'ABP_WindowCleaningCradle_C::OnCradleLowered' has a wrong offset!");
static_assert(offsetof(ABP_WindowCleaningCradle_C, MarkerID) == 0x000488, "Member 'ABP_WindowCleaningCradle_C::MarkerID' has a wrong offset!");

}

