#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Wardrobe_Door_Lockpickable_1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Wardrobe_Door_Lockpickable_1.BP_Wardrobe_Door_Lockpickable_1_C.ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1
// 0x01A8 (0x01A8 - 0x0000)
struct BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_SpawnedActor;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_Event_AttachParent;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0064(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x00F4(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASBZPlayerCharacter*>            CallFunc_GetAllSBZPlayerCharacters_ReturnValue;    // 0x0188(0x0010)(ReferenceParm)
	class ASBZPlayerCharacter*                    CallFunc_Array_Get_Item;                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1) == 0x000008, "Wrong alignment on BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1");
static_assert(sizeof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1) == 0x0001A8, "Wrong size on BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, EntryPoint) == 0x000000, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, Temp_struct_Variable) == 0x000008, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, Temp_delegate_Variable) == 0x000018, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, CallFunc_MakeRotator_ReturnValue) == 0x000030, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, K2Node_Event_bDoCosmetics) == 0x00003C, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, CallFunc_PostAkEvent_ReturnValue) == 0x000040, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, K2Node_Event_SpawnedActor) == 0x000048, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::K2Node_Event_SpawnedActor' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, K2Node_Event_AttachParent) == 0x000050, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::K2Node_Event_AttachParent' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, CallFunc_IsValid_ReturnValue) == 0x00005C, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, CallFunc_Add_IntInt_ReturnValue) == 0x000060, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000064, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0000F4, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, CallFunc_GetAllSBZPlayerCharacters_ReturnValue) == 0x000188, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::CallFunc_GetAllSBZPlayerCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, CallFunc_Array_Get_Item) == 0x000198, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, CallFunc_Array_Length_ReturnValue) == 0x0001A0, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1, CallFunc_Less_IntInt_ReturnValue) == 0x0001A4, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_ExecuteUbergraph_BP_Wardrobe_Door_Lockpickable_1::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Wardrobe_Door_Lockpickable_1.BP_Wardrobe_Door_Lockpickable_1_C.OnActorSpawned
// 0x0010 (0x0010 - 0x0000)
struct BP_Wardrobe_Door_Lockpickable_1_C_OnActorSpawned final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AttachParent;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Wardrobe_Door_Lockpickable_1_C_OnActorSpawned) == 0x000008, "Wrong alignment on BP_Wardrobe_Door_Lockpickable_1_C_OnActorSpawned");
static_assert(sizeof(BP_Wardrobe_Door_Lockpickable_1_C_OnActorSpawned) == 0x000010, "Wrong size on BP_Wardrobe_Door_Lockpickable_1_C_OnActorSpawned");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_OnActorSpawned, SpawnedActor) == 0x000000, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_OnActorSpawned::SpawnedActor' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_OnActorSpawned, AttachParent) == 0x000008, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_OnActorSpawned::AttachParent' has a wrong offset!");

// Function BP_Wardrobe_Door_Lockpickable_1.BP_Wardrobe_Door_Lockpickable_1_C.BP_OnMiniGameSuccess
// 0x0001 (0x0001 - 0x0000)
struct BP_Wardrobe_Door_Lockpickable_1_C_BP_OnMiniGameSuccess final
{
public:
	bool                                          bDoCosmetics;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Wardrobe_Door_Lockpickable_1_C_BP_OnMiniGameSuccess) == 0x000001, "Wrong alignment on BP_Wardrobe_Door_Lockpickable_1_C_BP_OnMiniGameSuccess");
static_assert(sizeof(BP_Wardrobe_Door_Lockpickable_1_C_BP_OnMiniGameSuccess) == 0x000001, "Wrong size on BP_Wardrobe_Door_Lockpickable_1_C_BP_OnMiniGameSuccess");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_BP_OnMiniGameSuccess, bDoCosmetics) == 0x000000, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_BP_OnMiniGameSuccess::bDoCosmetics' has a wrong offset!");

// Function BP_Wardrobe_Door_Lockpickable_1.BP_Wardrobe_Door_Lockpickable_1_C.UserConstructionScript
// 0x0080 (0x0080 - 0x0000)
struct BP_Wardrobe_Door_Lockpickable_1_C_UserConstructionScript final
{
public:
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	TMap<class USceneComponent*, struct FTransform> K2Node_MakeMap_Map;                                // 0x0030(0x0050)(ContainsInstancedReference)
};
static_assert(alignof(BP_Wardrobe_Door_Lockpickable_1_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_Wardrobe_Door_Lockpickable_1_C_UserConstructionScript");
static_assert(sizeof(BP_Wardrobe_Door_Lockpickable_1_C_UserConstructionScript) == 0x000080, "Wrong size on BP_Wardrobe_Door_Lockpickable_1_C_UserConstructionScript");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_UserConstructionScript, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000000, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_UserConstructionScript::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_UserConstructionScript, K2Node_MakeMap_Map) == 0x000030, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_UserConstructionScript::K2Node_MakeMap_Map' has a wrong offset!");

// Function BP_Wardrobe_Door_Lockpickable_1.BP_Wardrobe_Door_Lockpickable_1_C.PopulateSpawnInformationMap
// 0x0050 (0x0050 - 0x0000)
struct BP_Wardrobe_Door_Lockpickable_1_C_PopulateSpawnInformationMap final
{
public:
	TMap<class USceneComponent*, struct FTransform> InOutSpawnDataMap;                                 // 0x0000(0x0050)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(BP_Wardrobe_Door_Lockpickable_1_C_PopulateSpawnInformationMap) == 0x000008, "Wrong alignment on BP_Wardrobe_Door_Lockpickable_1_C_PopulateSpawnInformationMap");
static_assert(sizeof(BP_Wardrobe_Door_Lockpickable_1_C_PopulateSpawnInformationMap) == 0x000050, "Wrong size on BP_Wardrobe_Door_Lockpickable_1_C_PopulateSpawnInformationMap");
static_assert(offsetof(BP_Wardrobe_Door_Lockpickable_1_C_PopulateSpawnInformationMap, InOutSpawnDataMap) == 0x000000, "Member 'BP_Wardrobe_Door_Lockpickable_1_C_PopulateSpawnInformationMap::InOutSpawnDataMap' has a wrong offset!");

}

