#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChromaSDKPlugin

#include "Basic.hpp"

#include "ChromaSDKPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroAllKeys
// 0x000C (0x000C - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroAllKeys final
{
public:
	int32                                         SourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeys) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroAllKeys");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeys) == 0x00000C, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroAllKeys");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeys, SourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeys::SourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeys, TargetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeys::TargetAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeys, FrameId) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeys::FrameId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroAllKeysAllFrames
// 0x0008 (0x0008 - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames final
{
public:
	int32                                         SourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames) == 0x000008, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames, SourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames::SourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames, TargetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFrames::TargetAnimationId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroAllKeysAllFramesName
// 0x0020 (0x0020 - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName final
{
public:
	class FString                                 SourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName) == 0x000020, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName, SourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName::SourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName, TargetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesName::TargetAnimationName' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroAllKeysAllFramesOffset
// 0x000C (0x000C - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset final
{
public:
	int32                                         SourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset) == 0x00000C, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset, SourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset::SourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset, TargetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset::TargetAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset, Offset) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffset::Offset' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroAllKeysAllFramesOffsetName
// 0x0028 (0x0028 - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName final
{
public:
	class FString                                 SourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName) == 0x000028, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName, SourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName::SourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName, TargetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName::TargetAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName, Offset) == 0x000020, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysAllFramesOffsetName::Offset' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroAllKeysName
// 0x0028 (0x0028 - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName final
{
public:
	class FString                                 SourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameId;                                           // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName) == 0x000028, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName, SourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName::SourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName, TargetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName::TargetAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName, FrameId) == 0x000020, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroAllKeysName::FrameId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroTargetAllKeysAllFrames
// 0x0008 (0x0008 - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames final
{
public:
	int32                                         SourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames) == 0x000008, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames, SourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames::SourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames, TargetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFrames::TargetAnimationId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroTargetAllKeysAllFramesName
// 0x0020 (0x0020 - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName final
{
public:
	class FString                                 SourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName) == 0x000020, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName, SourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName::SourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName, TargetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesName::TargetAnimationName' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroTargetAllKeysAllFramesOffset
// 0x000C (0x000C - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset final
{
public:
	int32                                         SourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset) == 0x00000C, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset, SourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset::SourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset, TargetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset::TargetAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset, Offset) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffset::Offset' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AddNonZeroTargetAllKeysAllFramesOffsetName
// 0x0028 (0x0028 - 0x0000)
struct ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName final
{
public:
	class FString                                 SourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName) == 0x000028, "Wrong size on ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName, SourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName::SourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName, TargetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName::TargetAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName, Offset) == 0x000020, "Member 'ChromaSDKPluginBPLibrary_AddNonZeroTargetAllKeysAllFramesOffsetName::Offset' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AppendAllFrames
// 0x0008 (0x0008 - 0x0000)
struct ChromaSDKPluginBPLibrary_AppendAllFrames final
{
public:
	int32                                         SourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AppendAllFrames) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_AppendAllFrames");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AppendAllFrames) == 0x000008, "Wrong size on ChromaSDKPluginBPLibrary_AppendAllFrames");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AppendAllFrames, SourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AppendAllFrames::SourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AppendAllFrames, TargetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_AppendAllFrames::TargetAnimationId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.AppendAllFramesName
// 0x0020 (0x0020 - 0x0000)
struct ChromaSDKPluginBPLibrary_AppendAllFramesName final
{
public:
	class FString                                 SourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_AppendAllFramesName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_AppendAllFramesName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_AppendAllFramesName) == 0x000020, "Wrong size on ChromaSDKPluginBPLibrary_AppendAllFramesName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AppendAllFramesName, SourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_AppendAllFramesName::SourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_AppendAllFramesName, TargetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_AppendAllFramesName::TargetAnimationName' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKCreateEffectCustom1D
// 0x0030 (0x0030 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D final
{
public:
	EChromaSDKDevice1DEnum                        Device;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   Colors;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FChromaSDKEffectResult                 ReturnValue;                                       // 0x0018(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D) == 0x000030, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D, Device) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D::Device' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D, Colors) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D::Colors' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D, ReturnValue) == 0x000018, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom1D::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKCreateEffectCustom2D
// 0x0030 (0x0030 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D final
{
public:
	EChromaSDKDevice2DEnum                        Device;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FChromaSDKColors>               Colors;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FChromaSDKEffectResult                 ReturnValue;                                       // 0x0018(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D) == 0x000030, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D, Device) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D::Device' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D, Colors) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D::Colors' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D, ReturnValue) == 0x000018, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectCustom2D::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKCreateEffectKeyboardCustom2D
// 0x0028 (0x0028 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D final
{
public:
	TArray<struct FChromaSDKColors>               Colors;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FChromaSDKEffectResult                 ReturnValue;                                       // 0x0010(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D) == 0x000028, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D, Colors) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D::Colors' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D, ReturnValue) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectKeyboardCustom2D::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKCreateEffectNone
// 0x0018 (0x0018 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone final
{
public:
	EChromaSDKDeviceEnum                          Device;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChromaSDKEffectResult                 ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone) == 0x000018, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone, Device) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone::Device' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone, ReturnValue) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectNone::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKCreateEffectStatic
// 0x0028 (0x0028 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic final
{
public:
	EChromaSDKDeviceEnum                          Device;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ColorParam;                                        // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChromaSDKEffectResult                 ReturnValue;                                       // 0x0014(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic) == 0x000028, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic, Device) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic::Device' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic, ColorParam) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic::ColorParam' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic, ReturnValue) == 0x000014, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKCreateEffectStatic::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKDeleteEffect
// 0x0014 (0x0014 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect final
{
public:
	struct FChromaSDKGuid                         EffectId;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect) == 0x000014, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect, EffectId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect::EffectId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect, ReturnValue) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKDeleteEffect::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKInit
// 0x0004 (0x0004 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKInit final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKInit) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKInit");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKInit) == 0x000004, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKInit");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKInit, ReturnValue) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKInit::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKInitSDK
// 0x0050 (0x0050 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKInitSDK final
{
public:
	struct FChromaSDKAppInfoType                  AppInfo;                                           // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKInitSDK) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKInitSDK");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKInitSDK) == 0x000050, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKInitSDK");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKInitSDK, AppInfo) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKInitSDK::AppInfo' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKInitSDK, ReturnValue) == 0x000048, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKInitSDK::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKSetEffect
// 0x0014 (0x0014 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKSetEffect final
{
public:
	struct FChromaSDKGuid                         EffectId;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKSetEffect) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKSetEffect");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKSetEffect) == 0x000014, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKSetEffect");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKSetEffect, EffectId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKSetEffect::EffectId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKSetEffect, ReturnValue) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKSetEffect::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ChromaSDKUnInit
// 0x0004 (0x0004 - 0x0000)
struct ChromaSDKPluginBPLibrary_ChromaSDKUnInit final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ChromaSDKUnInit) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_ChromaSDKUnInit");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ChromaSDKUnInit) == 0x000004, "Wrong size on ChromaSDKPluginBPLibrary_ChromaSDKUnInit");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ChromaSDKUnInit, ReturnValue) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ChromaSDKUnInit::ReturnValue' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.ClearAnimationType
// 0x0001 (0x0001 - 0x0000)
struct ChromaSDKPluginBPLibrary_ClearAnimationType final
{
public:
	EChromaSDKDeviceEnum                          Device;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_ClearAnimationType) == 0x000001, "Wrong alignment on ChromaSDKPluginBPLibrary_ClearAnimationType");
static_assert(sizeof(ChromaSDKPluginBPLibrary_ClearAnimationType) == 0x000001, "Wrong size on ChromaSDKPluginBPLibrary_ClearAnimationType");
static_assert(offsetof(ChromaSDKPluginBPLibrary_ClearAnimationType, Device) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_ClearAnimationType::Device' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CloseAnimation
// 0x0004 (0x0004 - 0x0000)
struct ChromaSDKPluginBPLibrary_CloseAnimation final
{
public:
	int32                                         AnimationId;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CloseAnimation) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_CloseAnimation");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CloseAnimation) == 0x000004, "Wrong size on ChromaSDKPluginBPLibrary_CloseAnimation");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CloseAnimation, AnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CloseAnimation::AnimationId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CloseAnimationName
// 0x0010 (0x0010 - 0x0000)
struct ChromaSDKPluginBPLibrary_CloseAnimationName final
{
public:
	class FString                                 AnimationName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CloseAnimationName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CloseAnimationName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CloseAnimationName) == 0x000010, "Wrong size on ChromaSDKPluginBPLibrary_CloseAnimationName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CloseAnimationName, AnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CloseAnimationName::AnimationName' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyAllKeys
// 0x000C (0x000C - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyAllKeys final
{
public:
	int32                                         SourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyAllKeys) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyAllKeys");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyAllKeys) == 0x00000C, "Wrong size on ChromaSDKPluginBPLibrary_CopyAllKeys");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeys, SourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeys::SourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeys, TargetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeys::TargetAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeys, FrameId) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeys::FrameId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyAllKeysAllFrames
// 0x0008 (0x0008 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames final
{
public:
	int32                                         SourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames) == 0x000008, "Wrong size on ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames, SourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames::SourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames, TargetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeysAllFrames::TargetAnimationId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyAllKeysAllFramesName
// 0x0020 (0x0020 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName final
{
public:
	class FString                                 SourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName) == 0x000020, "Wrong size on ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName, SourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName::SourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName, TargetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeysAllFramesName::TargetAnimationName' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyAllKeysName
// 0x0028 (0x0028 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyAllKeysName final
{
public:
	class FString                                 SourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameId;                                           // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyAllKeysName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyAllKeysName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyAllKeysName) == 0x000028, "Wrong size on ChromaSDKPluginBPLibrary_CopyAllKeysName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeysName, SourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeysName::SourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeysName, TargetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeysName::TargetAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAllKeysName, FrameId) == 0x000020, "Member 'ChromaSDKPluginBPLibrary_CopyAllKeysName::FrameId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyAnimation
// 0x0018 (0x0018 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyAnimation final
{
public:
	int32                                         SourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TargetAnimationName;                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyAnimation) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyAnimation");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyAnimation) == 0x000018, "Wrong size on ChromaSDKPluginBPLibrary_CopyAnimation");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAnimation, SourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyAnimation::SourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAnimation, TargetAnimationName) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_CopyAnimation::TargetAnimationName' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyAnimationName
// 0x0020 (0x0020 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyAnimationName final
{
public:
	class FString                                 SourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyAnimationName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyAnimationName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyAnimationName) == 0x000020, "Wrong size on ChromaSDKPluginBPLibrary_CopyAnimationName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAnimationName, SourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyAnimationName::SourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyAnimationName, TargetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_CopyAnimationName::TargetAnimationName' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyKeyColor
// 0x0010 (0x0010 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyKeyColor final
{
public:
	int32                                         SourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChromaSDKKeyboardKey                         Key;                                               // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyKeyColor) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyKeyColor");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyKeyColor) == 0x000010, "Wrong size on ChromaSDKPluginBPLibrary_CopyKeyColor");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeyColor, SourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyKeyColor::SourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeyColor, TargetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_CopyKeyColor::TargetAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeyColor, FrameIndex) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_CopyKeyColor::FrameIndex' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeyColor, Key) == 0x00000C, "Member 'ChromaSDKPluginBPLibrary_CopyKeyColor::Key' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyKeyColorName
// 0x0028 (0x0028 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyKeyColorName final
{
public:
	class FString                                 SourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameIndex;                                        // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChromaSDKKeyboardKey                         Key;                                               // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyKeyColorName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyKeyColorName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyKeyColorName) == 0x000028, "Wrong size on ChromaSDKPluginBPLibrary_CopyKeyColorName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeyColorName, SourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyKeyColorName::SourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeyColorName, TargetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_CopyKeyColorName::TargetAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeyColorName, FrameIndex) == 0x000020, "Member 'ChromaSDKPluginBPLibrary_CopyKeyColorName::FrameIndex' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeyColorName, Key) == 0x000024, "Member 'ChromaSDKPluginBPLibrary_CopyKeyColorName::Key' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyKeysColor
// 0x0020 (0x0020 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyKeysColor final
{
public:
	int32                                         SourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EChromaSDKKeyboardKey>                 Keys;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyKeysColor) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyKeysColor");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyKeysColor) == 0x000020, "Wrong size on ChromaSDKPluginBPLibrary_CopyKeysColor");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColor, SourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColor::SourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColor, TargetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColor::TargetAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColor, FrameIndex) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColor::FrameIndex' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColor, Keys) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColor::Keys' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyKeysColorAllFrames
// 0x0018 (0x0018 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames final
{
public:
	int32                                         SourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EChromaSDKKeyboardKey>                 Keys;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames) == 0x000018, "Wrong size on ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames, SourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames::SourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames, TargetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames::TargetAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames, Keys) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorAllFrames::Keys' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyKeysColorAllFramesName
// 0x0030 (0x0030 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName final
{
public:
	class FString                                 SourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EChromaSDKKeyboardKey>                 Keys;                                              // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName) == 0x000030, "Wrong size on ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName, SourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName::SourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName, TargetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName::TargetAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName, Keys) == 0x000020, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorAllFramesName::Keys' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyKeysColorName
// 0x0038 (0x0038 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyKeysColorName final
{
public:
	class FString                                 SourceAnimationName;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetAnimationName;                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameIndex;                                        // 0x0020(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EChromaSDKKeyboardKey>                 Keys;                                              // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyKeysColorName) == 0x000008, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyKeysColorName");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyKeysColorName) == 0x000038, "Wrong size on ChromaSDKPluginBPLibrary_CopyKeysColorName");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorName, SourceAnimationName) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorName::SourceAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorName, TargetAnimationName) == 0x000010, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorName::TargetAnimationName' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorName, FrameIndex) == 0x000020, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorName::FrameIndex' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyKeysColorName, Keys) == 0x000028, "Member 'ChromaSDKPluginBPLibrary_CopyKeysColorName::Keys' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyNonZeroAllKeys
// 0x000C (0x000C - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys final
{
public:
	int32                                         SourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameId;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys) == 0x000004, "Wrong alignment on ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys");
static_assert(sizeof(ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys) == 0x00000C, "Wrong size on ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys, SourceAnimationId) == 0x000000, "Member 'ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys::SourceAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys, TargetAnimationId) == 0x000004, "Member 'ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys::TargetAnimationId' has a wrong offset!");
static_assert(offsetof(ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys, FrameId) == 0x000008, "Member 'ChromaSDKPluginBPLibrary_CopyNonZeroAllKeys::FrameId' has a wrong offset!");

// Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.CopyNonZeroAllKeysAllFrames
// 0x0008 (0x0008 - 0x0000)
struct ChromaSDKPluginBPLibrary_CopyNonZeroAllKeysAllFrames final
{
public:
	int32                                         SourceAnimationId;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetAnimationId;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
