#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DIM_BPL_WallLampBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DIM_BPL_WallLampBar.DIM_BPL_WallLampBar_C
// 0x0040 (0x02E8 - 0x02A8)
class ADIM_BPL_WallLampBar_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      FX_SparkBurst_M;                                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZCosmeticDestructionComponent*       SBZCosmeticDestruction;                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Downlight;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   SmoothAmbiant;                                     // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Uplight;                                           // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LGT_DeskLamp_02;                                   // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DIM_BPL_WallLampBar(int32 EntryPoint);
	void BndEvt__BPL_WallLampBar_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature(ESBZCosmeticDestructionType Type, const struct FSBZCosmeticDestructionContext& HitContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DIM_BPL_WallLampBar_C">();
	}
	static class ADIM_BPL_WallLampBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADIM_BPL_WallLampBar_C>();
	}
};
static_assert(alignof(ADIM_BPL_WallLampBar_C) == 0x000008, "Wrong alignment on ADIM_BPL_WallLampBar_C");
static_assert(sizeof(ADIM_BPL_WallLampBar_C) == 0x0002E8, "Wrong size on ADIM_BPL_WallLampBar_C");
static_assert(offsetof(ADIM_BPL_WallLampBar_C, UberGraphFrame) == 0x0002A8, "Member 'ADIM_BPL_WallLampBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_WallLampBar_C, FX_SparkBurst_M) == 0x0002B0, "Member 'ADIM_BPL_WallLampBar_C::FX_SparkBurst_M' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_WallLampBar_C, SBZCosmeticDestruction) == 0x0002B8, "Member 'ADIM_BPL_WallLampBar_C::SBZCosmeticDestruction' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_WallLampBar_C, Downlight) == 0x0002C0, "Member 'ADIM_BPL_WallLampBar_C::Downlight' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_WallLampBar_C, SmoothAmbiant) == 0x0002C8, "Member 'ADIM_BPL_WallLampBar_C::SmoothAmbiant' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_WallLampBar_C, Uplight) == 0x0002D0, "Member 'ADIM_BPL_WallLampBar_C::Uplight' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_WallLampBar_C, LGT_DeskLamp_02) == 0x0002D8, "Member 'ADIM_BPL_WallLampBar_C::LGT_DeskLamp_02' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_WallLampBar_C, DefaultSceneRoot) == 0x0002E0, "Member 'ADIM_BPL_WallLampBar_C::DefaultSceneRoot' has a wrong offset!");

}

