#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DIM_BPL_WallLampIndustrial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DIM_BPL_WallLampIndustrial.DIM_BPL_WallLampIndustrial_C
// 0x0038 (0x02E0 - 0x02A8)
class ADIM_BPL_WallLampIndustrial_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      FX_SparkBurst_M;                                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZCosmeticDestructionComponent*       SBZCosmeticDestruction;                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LGT_DeskLamp_0_4;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DIM_BPL_WallLampIndustrial(int32 EntryPoint);
	void BndEvt__BPL_WallLampIndustrial_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature(ESBZCosmeticDestructionType Type, const struct FSBZCosmeticDestructionContext& HitContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DIM_BPL_WallLampIndustrial_C">();
	}
	static class ADIM_BPL_WallLampIndustrial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADIM_BPL_WallLampIndustrial_C>();
	}
};
static_assert(alignof(ADIM_BPL_WallLampIndustrial_C) == 0x000008, "Wrong alignment on ADIM_BPL_WallLampIndustrial_C");
static_assert(sizeof(ADIM_BPL_WallLampIndustrial_C) == 0x0002E0, "Wrong size on ADIM_BPL_WallLampIndustrial_C");
static_assert(offsetof(ADIM_BPL_WallLampIndustrial_C, UberGraphFrame) == 0x0002A8, "Member 'ADIM_BPL_WallLampIndustrial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_WallLampIndustrial_C, FX_SparkBurst_M) == 0x0002B0, "Member 'ADIM_BPL_WallLampIndustrial_C::FX_SparkBurst_M' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_WallLampIndustrial_C, SBZCosmeticDestruction) == 0x0002B8, "Member 'ADIM_BPL_WallLampIndustrial_C::SBZCosmeticDestruction' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_WallLampIndustrial_C, PointLight) == 0x0002C0, "Member 'ADIM_BPL_WallLampIndustrial_C::PointLight' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_WallLampIndustrial_C, SpotLight) == 0x0002C8, "Member 'ADIM_BPL_WallLampIndustrial_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_WallLampIndustrial_C, LGT_DeskLamp_0_4) == 0x0002D0, "Member 'ADIM_BPL_WallLampIndustrial_C::LGT_DeskLamp_0_4' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_WallLampIndustrial_C, DefaultSceneRoot) == 0x0002D8, "Member 'ADIM_BPL_WallLampIndustrial_C::DefaultSceneRoot' has a wrong offset!");

}

