#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DIM_BPL_CeilingLight

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DIM_BPL_CeilingLight.DIM_BPL_CeilingLight_C
// 0x0018 (0x02C0 - 0x02A8)
class ADIM_BPL_CeilingLight_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Int_SHE_Modern_01_Ceil_02_96x48_Lamp_01_A;         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DIM_BPL_CeilingLight_C">();
	}
	static class ADIM_BPL_CeilingLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADIM_BPL_CeilingLight_C>();
	}
};
static_assert(alignof(ADIM_BPL_CeilingLight_C) == 0x000008, "Wrong alignment on ADIM_BPL_CeilingLight_C");
static_assert(sizeof(ADIM_BPL_CeilingLight_C) == 0x0002C0, "Wrong size on ADIM_BPL_CeilingLight_C");
static_assert(offsetof(ADIM_BPL_CeilingLight_C, Int_SHE_Modern_01_Ceil_02_96x48_Lamp_01_A) == 0x0002A8, "Member 'ADIM_BPL_CeilingLight_C::Int_SHE_Modern_01_Ceil_02_96x48_Lamp_01_A' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_CeilingLight_C, RectLight) == 0x0002B0, "Member 'ADIM_BPL_CeilingLight_C::RectLight' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_CeilingLight_C, DefaultSceneRoot) == 0x0002B8, "Member 'ADIM_BPL_CeilingLight_C::DefaultSceneRoot' has a wrong offset!");

}

