#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DIM_BPL_Hallogen_Pannel_PBL_01

#include "Basic.hpp"

#include "Enum_LampStages_structs.hpp"


namespace SDK::Params
{

// Function DIM_BPL_Hallogen_Pannel_PBL_01.DIM_BPL_Hallogen_Pannel_PBL_01_C.ExecuteUbergraph_DIM_BPL_Hallogen_Pannel_PBL_01
// 0x0010 (0x0010 - 0x0000)
struct DIM_BPL_Hallogen_Pannel_PBL_01_C_ExecuteUbergraph_DIM_BPL_Hallogen_Pannel_PBL_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_OldState;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DIM_BPL_Hallogen_Pannel_PBL_01_C_ExecuteUbergraph_DIM_BPL_Hallogen_Pannel_PBL_01) == 0x000004, "Wrong alignment on DIM_BPL_Hallogen_Pannel_PBL_01_C_ExecuteUbergraph_DIM_BPL_Hallogen_Pannel_PBL_01");
static_assert(sizeof(DIM_BPL_Hallogen_Pannel_PBL_01_C_ExecuteUbergraph_DIM_BPL_Hallogen_Pannel_PBL_01) == 0x000010, "Wrong size on DIM_BPL_Hallogen_Pannel_PBL_01_C_ExecuteUbergraph_DIM_BPL_Hallogen_Pannel_PBL_01");
static_assert(offsetof(DIM_BPL_Hallogen_Pannel_PBL_01_C_ExecuteUbergraph_DIM_BPL_Hallogen_Pannel_PBL_01, EntryPoint) == 0x000000, "Member 'DIM_BPL_Hallogen_Pannel_PBL_01_C_ExecuteUbergraph_DIM_BPL_Hallogen_Pannel_PBL_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(DIM_BPL_Hallogen_Pannel_PBL_01_C_ExecuteUbergraph_DIM_BPL_Hallogen_Pannel_PBL_01, K2Node_Event_OldState) == 0x000004, "Member 'DIM_BPL_Hallogen_Pannel_PBL_01_C_ExecuteUbergraph_DIM_BPL_Hallogen_Pannel_PBL_01::K2Node_Event_OldState' has a wrong offset!");
static_assert(offsetof(DIM_BPL_Hallogen_Pannel_PBL_01_C_ExecuteUbergraph_DIM_BPL_Hallogen_Pannel_PBL_01, K2Node_Event_NewState) == 0x000008, "Member 'DIM_BPL_Hallogen_Pannel_PBL_01_C_ExecuteUbergraph_DIM_BPL_Hallogen_Pannel_PBL_01::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(DIM_BPL_Hallogen_Pannel_PBL_01_C_ExecuteUbergraph_DIM_BPL_Hallogen_Pannel_PBL_01, K2Node_Event_bDoCosmetics) == 0x00000C, "Member 'DIM_BPL_Hallogen_Pannel_PBL_01_C_ExecuteUbergraph_DIM_BPL_Hallogen_Pannel_PBL_01::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(DIM_BPL_Hallogen_Pannel_PBL_01_C_ExecuteUbergraph_DIM_BPL_Hallogen_Pannel_PBL_01, K2Node_SwitchInteger_CmpSuccess) == 0x00000D, "Member 'DIM_BPL_Hallogen_Pannel_PBL_01_C_ExecuteUbergraph_DIM_BPL_Hallogen_Pannel_PBL_01::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function DIM_BPL_Hallogen_Pannel_PBL_01.DIM_BPL_Hallogen_Pannel_PBL_01_C.OnStateChanged
// 0x000C (0x000C - 0x0000)
struct DIM_BPL_Hallogen_Pannel_PBL_01_C_OnStateChanged final
{
public:
	int32                                         OldState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoCosmetics;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DIM_BPL_Hallogen_Pannel_PBL_01_C_OnStateChanged) == 0x000004, "Wrong alignment on DIM_BPL_Hallogen_Pannel_PBL_01_C_OnStateChanged");
static_assert(sizeof(DIM_BPL_Hallogen_Pannel_PBL_01_C_OnStateChanged) == 0x00000C, "Wrong size on DIM_BPL_Hallogen_Pannel_PBL_01_C_OnStateChanged");
static_assert(offsetof(DIM_BPL_Hallogen_Pannel_PBL_01_C_OnStateChanged, OldState) == 0x000000, "Member 'DIM_BPL_Hallogen_Pannel_PBL_01_C_OnStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(DIM_BPL_Hallogen_Pannel_PBL_01_C_OnStateChanged, NewState) == 0x000004, "Member 'DIM_BPL_Hallogen_Pannel_PBL_01_C_OnStateChanged::NewState' has a wrong offset!");
static_assert(offsetof(DIM_BPL_Hallogen_Pannel_PBL_01_C_OnStateChanged, bDoCosmetics) == 0x000008, "Member 'DIM_BPL_Hallogen_Pannel_PBL_01_C_OnStateChanged::bDoCosmetics' has a wrong offset!");

// Function DIM_BPL_Hallogen_Pannel_PBL_01.DIM_BPL_Hallogen_Pannel_PBL_01_C.SetStateFunction
// 0x0002 (0x0002 - 0x0000)
struct DIM_BPL_Hallogen_Pannel_PBL_01_C_SetStateFunction final
{
public:
	Enum_LampStages                               State_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DIM_BPL_Hallogen_Pannel_PBL_01_C_SetStateFunction) == 0x000001, "Wrong alignment on DIM_BPL_Hallogen_Pannel_PBL_01_C_SetStateFunction");
static_assert(sizeof(DIM_BPL_Hallogen_Pannel_PBL_01_C_SetStateFunction) == 0x000002, "Wrong size on DIM_BPL_Hallogen_Pannel_PBL_01_C_SetStateFunction");
static_assert(offsetof(DIM_BPL_Hallogen_Pannel_PBL_01_C_SetStateFunction, State_0) == 0x000000, "Member 'DIM_BPL_Hallogen_Pannel_PBL_01_C_SetStateFunction::State_0' has a wrong offset!");
static_assert(offsetof(DIM_BPL_Hallogen_Pannel_PBL_01_C_SetStateFunction, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'DIM_BPL_Hallogen_Pannel_PBL_01_C_SetStateFunction::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

