#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DIM_BPL_DeskLamp_A

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DIM_BPL_DeskLamp_A.DIM_BPL_DeskLamp_A_C
// 0x0020 (0x02C8 - 0x02A8)
class ADIM_BPL_DeskLamp_A_C final : public AActor
{
public:
	class USpotLightComponent*                    DownLight;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LGT_DeskLamp_01;                                   // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DIM_BPL_DeskLamp_A_C">();
	}
	static class ADIM_BPL_DeskLamp_A_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADIM_BPL_DeskLamp_A_C>();
	}
};
static_assert(alignof(ADIM_BPL_DeskLamp_A_C) == 0x000008, "Wrong alignment on ADIM_BPL_DeskLamp_A_C");
static_assert(sizeof(ADIM_BPL_DeskLamp_A_C) == 0x0002C8, "Wrong size on ADIM_BPL_DeskLamp_A_C");
static_assert(offsetof(ADIM_BPL_DeskLamp_A_C, DownLight) == 0x0002A8, "Member 'ADIM_BPL_DeskLamp_A_C::DownLight' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_DeskLamp_A_C, PointLight) == 0x0002B0, "Member 'ADIM_BPL_DeskLamp_A_C::PointLight' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_DeskLamp_A_C, LGT_DeskLamp_01) == 0x0002B8, "Member 'ADIM_BPL_DeskLamp_A_C::LGT_DeskLamp_01' has a wrong offset!");
static_assert(offsetof(ADIM_BPL_DeskLamp_A_C, DefaultSceneRoot) == 0x0002C0, "Member 'ADIM_BPL_DeskLamp_A_C::DefaultSceneRoot' has a wrong offset!");

}

