#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DIM_BPL_WallLampIndustrial

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function DIM_BPL_WallLampIndustrial.DIM_BPL_WallLampIndustrial_C.ExecuteUbergraph_DIM_BPL_WallLampIndustrial
// 0x0038 (0x0038 - 0x0000)
struct DIM_BPL_WallLampIndustrial_C_ExecuteUbergraph_DIM_BPL_WallLampIndustrial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZCosmeticDestructionType                   K2Node_ComponentBoundEvent_Type;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         K2Node_ComponentBoundEvent_HitContext;             // 0x0008(0x0030)(ConstParm, NoDestructor)
};
static_assert(alignof(DIM_BPL_WallLampIndustrial_C_ExecuteUbergraph_DIM_BPL_WallLampIndustrial) == 0x000004, "Wrong alignment on DIM_BPL_WallLampIndustrial_C_ExecuteUbergraph_DIM_BPL_WallLampIndustrial");
static_assert(sizeof(DIM_BPL_WallLampIndustrial_C_ExecuteUbergraph_DIM_BPL_WallLampIndustrial) == 0x000038, "Wrong size on DIM_BPL_WallLampIndustrial_C_ExecuteUbergraph_DIM_BPL_WallLampIndustrial");
static_assert(offsetof(DIM_BPL_WallLampIndustrial_C_ExecuteUbergraph_DIM_BPL_WallLampIndustrial, EntryPoint) == 0x000000, "Member 'DIM_BPL_WallLampIndustrial_C_ExecuteUbergraph_DIM_BPL_WallLampIndustrial::EntryPoint' has a wrong offset!");
static_assert(offsetof(DIM_BPL_WallLampIndustrial_C_ExecuteUbergraph_DIM_BPL_WallLampIndustrial, K2Node_ComponentBoundEvent_Type) == 0x000004, "Member 'DIM_BPL_WallLampIndustrial_C_ExecuteUbergraph_DIM_BPL_WallLampIndustrial::K2Node_ComponentBoundEvent_Type' has a wrong offset!");
static_assert(offsetof(DIM_BPL_WallLampIndustrial_C_ExecuteUbergraph_DIM_BPL_WallLampIndustrial, K2Node_ComponentBoundEvent_HitContext) == 0x000008, "Member 'DIM_BPL_WallLampIndustrial_C_ExecuteUbergraph_DIM_BPL_WallLampIndustrial::K2Node_ComponentBoundEvent_HitContext' has a wrong offset!");

// Function DIM_BPL_WallLampIndustrial.DIM_BPL_WallLampIndustrial_C.BndEvt__BPL_WallLampIndustrial_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature
// 0x0034 (0x0034 - 0x0000)
struct DIM_BPL_WallLampIndustrial_C_BndEvt__BPL_WallLampIndustrial_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature final
{
public:
	ESBZCosmeticDestructionType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         HitContext;                                        // 0x0004(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(DIM_BPL_WallLampIndustrial_C_BndEvt__BPL_WallLampIndustrial_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000004, "Wrong alignment on DIM_BPL_WallLampIndustrial_C_BndEvt__BPL_WallLampIndustrial_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(sizeof(DIM_BPL_WallLampIndustrial_C_BndEvt__BPL_WallLampIndustrial_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000034, "Wrong size on DIM_BPL_WallLampIndustrial_C_BndEvt__BPL_WallLampIndustrial_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(offsetof(DIM_BPL_WallLampIndustrial_C_BndEvt__BPL_WallLampIndustrial_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature, Type) == 0x000000, "Member 'DIM_BPL_WallLampIndustrial_C_BndEvt__BPL_WallLampIndustrial_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(DIM_BPL_WallLampIndustrial_C_BndEvt__BPL_WallLampIndustrial_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature, HitContext) == 0x000004, "Member 'DIM_BPL_WallLampIndustrial_C_BndEvt__BPL_WallLampIndustrial_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature::HitContext' has a wrong offset!");

}

