#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: G_DiamondDistrict_Scripting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass G_DiamondDistrict_Scripting.G_DiamondDistrict_Scripting_C
// 0x07B8 (0x0AF8 - 0x0340)
class AG_DiamondDistrict_Scripting_C final : public ASBZLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          LevelIsLoud;                                       // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EscapeIsStealth;                                   // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SecuredMinBags;                                    // 0x034A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SecuredMaxBags;                                    // 0x034B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          GetawayIsHere;                                     // 0x034C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PlayerEscaped;                                     // 0x034D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Completed1stObj;                                   // 0x034E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34F[0x1];                                      // 0x034F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZAICharacter*                        LeadGuard;                                         // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          GetRandomStream;                                   // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)
	int32                                         CountCageBagDrop;                                  // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3HeistState                                CurrentHeistState;                                 // 0x0364(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShutterOpenMediumStore;                           // 0x0365(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShutterOpenSmallStore1;                           // 0x0366(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShutterOpenSmallStore2;                           // 0x0367(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShutterOpenLargeStore;                            // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZAICharacter*                        EyeScanManager;                                    // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEyeScanCompleted;                                 // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShutterSabotagedSmallStore2;                      // 0x0379(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPlayerEnteredSmallStore2;                         // 0x037A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPlayerEnteredMediumStore;                         // 0x037B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShutterSabotagedMediumStore;                      // 0x037C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShutterSabotagedSmallStore1;                      // 0x037D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPlayerEnteredSmallStore1;                         // 0x037E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShutterSabotagedLargeStore;                       // 0x037F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPlayerEnteredLargeStore;                          // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_WindowCleaningCradle_C*>     WindowCleaningCradles;                             // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          bCageOriginalPosition;                             // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bWindowCleaningCradle;                             // 0x0399(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHelicopterReturn;                                 // 0x039A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bScaffoldingHelicopter;                            // 0x039B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         HelicopterEscapeArriveTime;                        // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPreplanningDumpsterSecure;                        // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPreplanningPoliceVanEscape;                       // 0x03A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A2[0x2];                                      // 0x03A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HelicopterArrivalMinuteCount;                      // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HelicopterArriveTimerDelay;                        // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPreplanningExtraThermite;                         // 0x03AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AD[0x3];                                      // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimerHelicopterArriveVO;                           // 0x03B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bVaultOpenLargeStore;                              // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bVaultOpenGarage;                                  // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPlayerUsedShutterButton;                          // 0x03BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPreplanningAuthenticator;                         // 0x03BB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCageLoudObj;                                      // 0x03BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bEventSmallStoreClosed;                            // 0x03BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bEventMediumStoreClosed;                           // 0x03BE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSmallStoreSideDoorOpened;                         // 0x03BF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bLargeStoreSideDoorOpened;                         // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bMediumStoreSideDoorOpened;                        // 0x03C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bGarageStoreSideDoorOpened;                        // 0x03C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C3[0x1];                                      // 0x03C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HelicopterWaitTime;                                // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HelicopterReturnTime;                              // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APawn*>                          SpawnedGuardBlueKeyCard;                           // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          bGarageThermiteActive;                             // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BagsCount;                                         // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InstantLootCount;                                  // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IncreaseSuspenseCount;                             // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 DisplayCasesInLargeStore;                          // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 DisplayCasesInMediumStore;                         // 0x0400(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ASBZDestroyGroup*>               DestroyGroupsInstantLootLargeStore;                // 0x0410(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_InteractableJewelry_HighValue_C*> BagLootsLargeStore;                                // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<int32>                                 NumbersOutLargeStore;                              // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ABP_InteractableJewelry_HighValue_C*> BagLootsMediumStore;                               // 0x0440(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ASBZDestroyGroup*>               DestroyGroupsInstantLootMediumStore;               // 0x0450(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<int32>                                 NumbersOutMediumStore;                             // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ASBZPawnSpawnPredefined*>        EyeScanManagerSpawns;                              // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         ChosenEyeManager;                                  // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZFilteredTriggerVolume*              SBZFilteredTriggerVolume_CrewInGarageStore_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZObjective*                          SBZObjective_FirstObj_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnPredefined_Guard1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnPredefined_Civilian1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnPredefined_Civilian2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnPredefined_Civilian3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnPredefined_Employee2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnPredefined_Employee3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnPredefined_Employee1_0_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAkAmbientSound*                        AkAmbientSound_Alarm1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZObjective*                          SBZObjective_SecureTheLoot_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_Escape_Stealth1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerEscapeVolume*                 SBZPlayerEscapeVolume_Escape_Stealth1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EscapeVan_C*                        BP_EscapeVan1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZObjective*                          SBZObjective_Escape_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZTrafficSpline*                      SBZTrafficSpline_StealthEscape_DriveOut_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagTriggerVolume*                   SBZBagTriggerVolume_Stealth_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_Lootdrop_Stealth1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MarkerZone_C*                       BP_MarkerZone_Escape_Stealth1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZDestroyGroup*                       SBZDestroyGroup_AmmoLeft_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZDestroyGroup*                       SBZDestroyGroup_AmmoRight_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZDestroyGroup*                       SBZDestroyGroup_PP_DoctorBag_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZDestroyGroup*                       SBZDestroyGroup_PP_ArmorBag_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZDestroyGroup*                       SBZDestroyGroup_PP_AmmoBag_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnPredefined_LeadGuard_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagTriggerVolume*                   SBZBagTriggerVolume_Loud_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_Lootdrop_Loud1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EscapeHelicopter_C*                 BP_EscapeHelicopter1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_Escape_Loud1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerEscapeVolume*                 SBZPlayerEscapeVolume_Escape_Loud1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MarkerZone_C*                       BP_MarkerZone_Escape_Loud1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZObjective*                          SBZObjective_SecureAllOpt_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EquipmentHelicopter_C*              BP_EquipmentHelicopter_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZTrafficSpline*                      SBZTrafficSpline_HelicopterOvkWeapon1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagSpawner*                         SBZBagSpawner_OVKBag1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_OvkWeapon_Drop1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZTrafficSpline*                      SBZTrafficSpline_HelicopterOvkWeapon2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagSpawner*                         SBZBagSpawner_OVKBag2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_OvkWeapon_Drop2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZTrafficSpline*                      SBZTrafficSpline_HelicopterOvkWeapon3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagSpawner*                         SBZBagSpawner_OVKBag3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_OvkWeapon_Drop3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APD3PawnSpawnGroup*                     PD3PawnSpawnGroup_PedestrianLobbySpawns_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZTrafficSpline*                      SBZTrafficSplineSwatHelicopterStart2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZTrafficSpline*                      SBZTrafficSplineSwatHelicopterEnd2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZTrafficSpline*                      SBZTrafficSplineSwatHelicopterStart3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZTrafficSpline*                      SBZTrafficSplineSwatHelicopterEnd3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAkAmbientSound*                        AkAmbientSound_Alarm2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAkAmbientSound*                        AkAmbientSound_Alarm3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAkAmbientSound*                        AkAmbientSound_Alarm4_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAkAmbientSound*                        AkAmbientSound_Alarm5_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_HeliCage1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagTriggerVolume*                   SBZBagTriggerVolume_HeliCage1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZObjective*                          SBZObjective_AssembleTheLootCage_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ReplicatedBinaryActor_HelicopterCage_1_C* BP_ReplicatedBinaryActor_HelicopterCage_1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MarkerZone_C*                       BP_CageMarker_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZObjective*                          SBZObjective_WaitForEquipment_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZTrafficSpline*                      SBZTrafficSpline_HelicopterCageEquipment_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagSpawner*                         SBZBagSpawnerCage8_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagSpawner*                         SBZBagSpawnerCage5_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagSpawner*                         SBZBagSpawnerCage6_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagSpawner*                         SBZBagSpawnerCage7_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagSpawner*                         SBZBagSpawnerCage4_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagSpawner*                         SBZBagSpawnerCage3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZFilteredTriggerVolume*              SBZFilteredTriggerVolume_1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZFilteredTriggerVolume*              SBZFilteredTriggerVolume2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZFilteredTriggerVolume*              SBZFilteredTriggerVolume3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZFilteredTriggerVolume*              SBZFilteredTriggerVolume4_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZFilteredTriggerVolume*              SBZFilteredTriggerVolume5_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZFilteredTriggerVolume*              SBZFilteredTriggerVolume6_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZDestroyGroup*                       SBZDestroyGroup_DEstroyPocketDrill_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Int_SingleDoor_Reinforced_Industrial_01_C* BP_Int_SingleDoor_Reinforced_Industrial_9_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PocketDrill_C*                      BP_PocketDrill_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PocketDrill_C*                      BP_PocketDrill2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Int_SingleDoor_Reinforced_Industrial_01_C* BP_Int_SingleDoor_Reinforced_Industrial_6_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZDestroyGroup*                       SBZDestroyGroup_DEstroyPocketDrill2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PocketDrill_C*                      BP_PocketDrill3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Int_SingleDoor_Reinforced_Industrial_01_C* BP_Int_SingleDoor_Reinforced_Industrial_3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZDestroyGroup*                       SBZDestroyGroup_DEstroyPocketDrill3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZDestroyGroup*                       SBZDestroyGroup_DEstroyPocketDrill4_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Int_SingleDoor_Reinforced_Industrial_01_C* BP_Int_SingleDoor_Reinforced_Industrial_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PocketDrill_C*                      BP_PocketDrill4_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APD3PawnSpawnGroup*                     PD3PawnSpawnGroup_PredefinedElevator1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZObjective*                          SBZObjective_HoldPosition_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WindowCleaningCradle_C*             BP_WindowCleaningCradle_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WindowCleaningCradle_C*             BP_WindowCleaningCradle3_6_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WindowCleaningCradle_C*             BP_WindowCleaningCradle2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagTriggerVolume*                   SBZBagTriggerVolume_WindowCradle1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagTriggerVolume*                   SBZBagTriggerVolume_WindowCradle2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagTriggerVolume*                   SBZBagTriggerVolume_WindowCradle3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_EyeScannerEscortManager_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       EyeScanner_01_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VaultDoor_Medium_C*                 BP_VaultDoor_Medium2_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerTriggerVolume*                SBZPlayerTriggerVolume_EnableOutlineEyeManager_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_WindowCleaningCradle_C*             BP_WindowCleaningCradle4_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagTriggerVolume*                   SBZBagTriggerVolume_WindowCradle4_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SprinklerSabotagePoint_C*           BP_SprinklerSabotagePoint_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SprinklerSabotagePoint_C*           BP_SprinklerSabotagePoint_MediumStore_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SprinklerSabotagePoint_C*           BP_SprinklerSabotagePoint_SmallStore1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SprinklerSabotagePoint_C*           BP_SprinklerSabotagePoint_LargeStore_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x07A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerTriggerVolume*                SBZPlayerTriggerVolume_PlayerInsideStore1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerTriggerVolume*                SBZPlayerTriggerVolume_InsideMediumStore_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerTriggerVolume*                SBZPlayerTriggerVolume_InsideSmallStore1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerTriggerVolume*                SBZPlayerTriggerVolume_InsideSmallStore2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_HeliCage2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagTriggerVolume*                   SBZBagTriggerVolume_HeliCage2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MarkerZone_C*                       BP_CageMarker2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ReplicatedBinaryActor_HelicopterCage_1_C* BP_ReplicatedBinaryActor_HelicopterCage_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_Lootdrop_Loud2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagTriggerVolume*                   SBZBagTriggerVolume_Loud2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerEscapeVolume*                 SBZPlayerEscapeVolume_Escape_Loud2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_Escape_Loud2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MarkerZone_C*                       BP_MarkerZone_Escape_Loud2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZTrafficSpline*                      SBZTrafficSpline_BileFlyOutRoof_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0810(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZTrafficSpline*                      SBZTrafficSpline_BileFlyInRoof_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MarkerZone_C*                       BP_MarkerZone_Escape_Loud3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_Escape_Loud3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerEscapeVolume*                 SBZPlayerEscapeVolume_Escape_Loud3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZObjective*                          SBZObjective_WaitGetaway_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0838(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZObjective*                          SBZObjective_WaitGetawayReturn_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_ThermiteDoorBagDrop_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0848(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MarkerZone_C*                       BP_MarkerZone_ThermiteDoor_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_ThermiteDoorInteract_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_ThermiteDoorBurn_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VaultDoor_Medium_C*                 BP_VaultDoor_Medium_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0868(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_ThermiteDoorInteract2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_ThermiteDoorBurn2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0878(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_ThermiteDoorBagDrop2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MarkerZone_C*                       BP_MarkerZone_ThermiteDoor2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SmallLockThermite_C*                BP_SmallLockThermite2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SmallLockThermite_C*                BP_SmallLockThermite_4_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DIM_SecurityShutter_01_C*           BP_Shutter_SmallStore1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DIM_SecurityShutter_01_C*           BP_Shutter_MediumStore2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x08A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DIM_SecurityShutter_01_C*           BP_Shutter_MediumStore1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x08B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DIM_SecurityShutter_01_C*           BP_Shutter_LargeStore1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x08B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DIM_SecurityShutter_01_C*           BP_Shutter_LargeStore2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DIM_SecurityShutter_01_C*           BP_Shutter_SmallStore2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnPredefined_Guard8_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnPredefined_Guard9_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LA_Scripted_Patrol_C*               BP_LA_Scripted_Patrol2_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZLaserGrid*                          SBZLaserGrid_1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x08E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZTrafficSpline*                      SBZTrafficSpline_FlyInCageHeli_1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x08F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZTrafficSpline*                      SBZTrafficSpline_FlyInCageHeli_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerTriggeredVoiceVolume*         SBZPlayerTriggeredVoiceVolume_PlayerNearEscape_Stealth1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0900(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerTriggeredVoiceVolume*         SBZPlayerTriggeredVoiceVolume_PlayerNearEscape_Loud1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0908(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Dumpster_01_Open_C*                 BP_Dumpster_01_Open_5_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZWaypoint*                           SBZWaypoint_DumpsterBag_PP_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0918(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagTriggerVolume*                   SBZBagTrigger_Dumpster_PP_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0920(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZLaserGrid*                          SBZLaserGrid2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0928(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZLaserGrid*                          SBZLaserGrid3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0930(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DIM_SecurityShutter_02_C*           BP_DIM_SecurityShutter_LargeStore_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0938(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DIM_SecurityShutter_02_C*           BP_DIM_SecurityShutter_LargeStore_1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0940(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_StashedSmallThermiteBag_C*          BP_StashedSmallThermiteBag4_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0948(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_StashedSmallThermiteBag_C*          BP_StashedSmallThermiteBag3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerLookAtTrigger*                SBZPlayerLookAtTrigger_JewelryMachineLarge_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0958(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_JewelryMachine_C*                   BP_JewelryMachine_LargeStore_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0960(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_JewelryMachine_C*                   BP_JewelryMachine_Garage_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0968(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerLookAtTrigger*                SBZPlayerLookAtTrigger_JewelryMachineGarage_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_JewelryMachine_C*                   BP_JewelryMachine_Workshop_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0978(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerLookAtTrigger*                SBZPlayerLookAtTrigger_JewelryMachineWorkshop_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0980(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_One_Step_Animated_Button_C*         BP_One_Step_Animated_Button2_5_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0988(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_One_Step_Animated_Button_C*         BP_One_Step_Animated_Button3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0990(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_One_Step_Animated_Button_C*         BP_One_Step_Animated_Button4_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0998(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_One_Step_Animated_Button_C*         BP_One_Step_Animated_Button5_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x09A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_JewelryDisplayCase_Movable_C*       BP_JewelryDisplayCase_Movable2_5_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x09A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_JewelryDisplayCase_Movable_C*       BP_JewelryDisplayCase_Movable3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x09B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_JewelryDisplayCase_Movable_C*       BP_JewelryDisplayCase_Movable_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x09B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_JewelryDisplayCase_Movable_C*       BP_JewelryDisplayCase_Movable4_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x09C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Escape_Armored_van_C*               BP_Escape_Armored_van_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x09C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZDestroyGroup*                       SBZDestroyGroup_EscapeVan_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x09D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZDestroyGroup*                       SBZDestroyGroup_PoliceEscapeVan_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x09D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerLookAtTrigger*                SBZPlayerLookAtTrigger_ShutterVOGarage_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x09E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerLookAtTrigger*                SBZPlayerLookAtTrigger_ShutterVOSmall_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x09E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerLookAtTrigger*                SBZPlayerLookAtTrigger_ShutterVOLArge_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x09F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerLookAtTrigger*                SBZPlayerLookAtTrigger_ShutterVOMedium_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x09F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerLookAtTrigger*                SBZPlayerLookAtTrigger_ClosedStoreVOMedium_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerLookAtTrigger*                SBZPlayerLookAtTrigger_ClosedStoreVOSmall_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnPredefined_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnPredefined64_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZFilteredTriggerVolume*              SBZFilteredTriggerVolume_OvkWeapon1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZFilteredTriggerVolume*              SBZFilteredTriggerVolume_OvkWeapon3_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZFilteredTriggerVolume*              SBZFilteredTriggerVolume_OvkWeapon2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnPredefined_Guard12_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnPredefined_Guard10_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnPredefined91_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LifeActionTriggerVolume_HumanShield_C* BP_LifeActionTriggerVolume_HumanShield_EyeScan_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Interactable_RareStone_01_C*        BP_Interactable_RareStone_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZDestroyGroup*                       SBZDestroyGroup_OpalReplacements1_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Interactable_RareStone_01_C*        BP_Interactable_RareStone2_5_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZDestroyGroup*                       SBZDestroyGroup_OpalReplacements2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RedKeycardReader_C*                 BP_RedKeycardReader_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ToggleableBagCollision_C*           BP_ToggleableBagCollision2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ToggleableBagCollision_C*           BP_ToggleableBagCollision_2_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZBagTriggerVolume*                   SBZBagTriggerVolume_ScaffoldingHelicopter_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_InstantLoot_BoxJewelry_01_Necklaces_H_C* BP_InstantLoot_BoxJewelry_01_Necklaces_G29_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0A98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_InstantLoot_BoxJewelry_01_Necklaces_H_C* BP_InstantLoot_BoxJewelry_01_Necklaces_G28_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0AA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_InteractableJewelry_HighValue_C*    BP_InteractableJewelry_HighValue10_5_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0AA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_InteractableJewelry_HighValue_C*    BP_InteractableJewelry_HighValue13_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0AB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_InteractableJewelry_HighValue_C*    BP_InteractableJewelry_HighValue14_ExecuteUbergraph_G_DiamondDistrict_Scripting_RefProperty; // 0x0AB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
