#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_LoginScreenBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_LoginScreenBase.WBP_UI_LoginScreenBase_C
// 0x0068 (0x0750 - 0x06E8)
class UWBP_UI_LoginScreenBase_C final : public USBZLoginScreenBaseWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PressStartMotion;                                  // 0x06F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fadein;                                            // 0x06F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_TextBasedNewsBanner_C*             AccelbyteStatusBanner;                             // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber_0;                                // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_OverlayBackground;                           // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Error;                                     // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Error;                                        // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PressAnyButton;                          // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_CreateAccount_C*                Widget_CreateAccount;                              // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       BinkMediaPlayer;                                   // 0x0748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_LoginScreenBase(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void InitializeLoginMenu();
	void Construct();
	void OnInitialized();
	void OnLoginError(const class FText& ErrorMessage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_LoginScreenBase_C">();
	}
	static class UWBP_UI_LoginScreenBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_LoginScreenBase_C>();
	}
};
static_assert(alignof(UWBP_UI_LoginScreenBase_C) == 0x000008, "Wrong alignment on UWBP_UI_LoginScreenBase_C");
static_assert(sizeof(UWBP_UI_LoginScreenBase_C) == 0x000750, "Wrong size on UWBP_UI_LoginScreenBase_C");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, UberGraphFrame) == 0x0006E8, "Member 'UWBP_UI_LoginScreenBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, PressStartMotion) == 0x0006F0, "Member 'UWBP_UI_LoginScreenBase_C::PressStartMotion' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, Fadein) == 0x0006F8, "Member 'UWBP_UI_LoginScreenBase_C::Fadein' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, AccelbyteStatusBanner) == 0x000700, "Member 'UWBP_UI_LoginScreenBase_C::AccelbyteStatusBanner' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, CircularThrobber_0) == 0x000708, "Member 'UWBP_UI_LoginScreenBase_C::CircularThrobber_0' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, Image_0) == 0x000710, "Member 'UWBP_UI_LoginScreenBase_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, Image_Background) == 0x000718, "Member 'UWBP_UI_LoginScreenBase_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, Image_OverlayBackground) == 0x000720, "Member 'UWBP_UI_LoginScreenBase_C::Image_OverlayBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, Overlay_Error) == 0x000728, "Member 'UWBP_UI_LoginScreenBase_C::Overlay_Error' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, Text_Error) == 0x000730, "Member 'UWBP_UI_LoginScreenBase_C::Text_Error' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, TextBlock_PressAnyButton) == 0x000738, "Member 'UWBP_UI_LoginScreenBase_C::TextBlock_PressAnyButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, Widget_CreateAccount) == 0x000740, "Member 'UWBP_UI_LoginScreenBase_C::Widget_CreateAccount' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, BinkMediaPlayer) == 0x000748, "Member 'UWBP_UI_LoginScreenBase_C::BinkMediaPlayer' has a wrong offset!");

}

