#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_PlayerCarryStatusItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_PlayerCarryStatusItem.WBP_UI_Widget_PlayerCarryStatusItem_C.ExecuteUbergraph_WBP_UI_Widget_PlayerCarryStatusItem
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_Widget_PlayerCarryStatusItem_C_ExecuteUbergraph_WBP_UI_Widget_PlayerCarryStatusItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_PlayerCarryStatusItem_C_ExecuteUbergraph_WBP_UI_Widget_PlayerCarryStatusItem) == 0x000008, "Wrong alignment on WBP_UI_Widget_PlayerCarryStatusItem_C_ExecuteUbergraph_WBP_UI_Widget_PlayerCarryStatusItem");
static_assert(sizeof(WBP_UI_Widget_PlayerCarryStatusItem_C_ExecuteUbergraph_WBP_UI_Widget_PlayerCarryStatusItem) == 0x000018, "Wrong size on WBP_UI_Widget_PlayerCarryStatusItem_C_ExecuteUbergraph_WBP_UI_Widget_PlayerCarryStatusItem");
static_assert(offsetof(WBP_UI_Widget_PlayerCarryStatusItem_C_ExecuteUbergraph_WBP_UI_Widget_PlayerCarryStatusItem, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_PlayerCarryStatusItem_C_ExecuteUbergraph_WBP_UI_Widget_PlayerCarryStatusItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerCarryStatusItem_C_ExecuteUbergraph_WBP_UI_Widget_PlayerCarryStatusItem, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_PlayerCarryStatusItem_C_ExecuteUbergraph_WBP_UI_Widget_PlayerCarryStatusItem::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerCarryStatusItem_C_ExecuteUbergraph_WBP_UI_Widget_PlayerCarryStatusItem, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_UI_Widget_PlayerCarryStatusItem_C_ExecuteUbergraph_WBP_UI_Widget_PlayerCarryStatusItem::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_PlayerCarryStatusItem.WBP_UI_Widget_PlayerCarryStatusItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_PlayerCarryStatusItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_PlayerCarryStatusItem_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_PlayerCarryStatusItem_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_PlayerCarryStatusItem_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_PlayerCarryStatusItem_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_PlayerCarryStatusItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_PlayerCarryStatusItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_PlayerCarryStatusItem.WBP_UI_Widget_PlayerCarryStatusItem_C.OnChanged
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged final
{
public:
	class USBZCarryType*                          Type;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAdded;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged) == 0x000008, "Wrong alignment on WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged");
static_assert(sizeof(WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged) == 0x000030, "Wrong size on WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged");
static_assert(offsetof(WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged, Type) == 0x000000, "Member 'WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged::Type' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged, IsAdded) == 0x000008, "Member 'WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged::IsAdded' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged, CallFunc_IsValid_ReturnValue_1) == 0x00000A, "Member 'WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput) == 0x000018, "Member 'WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000028, "Member 'WBP_UI_Widget_PlayerCarryStatusItem_C_OnChanged::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

}

