#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_PopUpWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_PopUpWidget.WBP_UI_PopUpWidget_C
// 0x0020 (0x0370 - 0x0350)
class UWBP_UI_PopUpWidget_C final : public USBZPopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CenterBackground_I;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBodyBox;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_PopUpWidget(int32 EntryPoint);
	void OnDisplayPopUp();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_PopUpWidget_C">();
	}
	static class UWBP_UI_PopUpWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_PopUpWidget_C>();
	}
};
static_assert(alignof(UWBP_UI_PopUpWidget_C) == 0x000008, "Wrong alignment on UWBP_UI_PopUpWidget_C");
static_assert(sizeof(UWBP_UI_PopUpWidget_C) == 0x000370, "Wrong size on UWBP_UI_PopUpWidget_C");
static_assert(offsetof(UWBP_UI_PopUpWidget_C, UberGraphFrame) == 0x000350, "Member 'UWBP_UI_PopUpWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PopUpWidget_C, Show) == 0x000358, "Member 'UWBP_UI_PopUpWidget_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PopUpWidget_C, CenterBackground_I) == 0x000360, "Member 'UWBP_UI_PopUpWidget_C::CenterBackground_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PopUpWidget_C, VerticalBodyBox) == 0x000368, "Member 'UWBP_UI_PopUpWidget_C::VerticalBodyBox' has a wrong offset!");

}

