#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_ItemDescriptionBox

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Inventory_ItemDescriptionBox.WBP_UI_Inventory_ItemDescriptionBox_C.SetInventoryItem
// 0x0290 (0x0290 - 0x0000)
struct WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem final
{
public:
	class USBZInventoryBaseData*                  InInventoryItem;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 PartStatsString;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSBZEquippablePartUIData               PartStatData;                                      // 0x0018(0x0020)(Edit, BlueprintVisible)
	class USBZArmorData*                          K2Node_DynamicCast_AsSBZArmor_Data;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZEquippablePartDataAsset*      K2Node_DynamicCast_AsSBZEquippable_Part_Data_Asset; // 0x0048(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseWeaponData*                     K2Node_DynamicCast_AsSBZBase_Weapon_Data;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZEquippablePartUIData               CallFunc_GetModificationsUIData_PartUIData;        // 0x0068(0x0020)()
	class USBZToolData*                           K2Node_DynamicCast_AsSBZTool_Data;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetFormattedDescriptionText_ReturnValue;  // 0x0098(0x0018)()
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C8(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZEquippableData*                     K2Node_DynamicCast_AsSBZEquippable_Data;           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZOverskillLoadoutData*               K2Node_DynamicCast_AsSBZOverskill_Loadout_Data;    // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0108(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0158(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0170(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0198(0x0028)()
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x01C0(0x0028)()
	struct FSBZWeaponModificationUIData           CallFunc_Array_Get_Item;                           // 0x01E8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSBZWeaponModificationUIData           CallFunc_Array_Get_Item_1;                         // 0x0240(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem) == 0x000008, "Wrong alignment on WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem");
static_assert(sizeof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem) == 0x000290, "Wrong size on WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, InInventoryItem) == 0x000000, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::InInventoryItem' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, PartStatsString) == 0x000008, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::PartStatsString' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, PartStatData) == 0x000018, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::PartStatData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, K2Node_DynamicCast_AsSBZArmor_Data) == 0x000038, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::K2Node_DynamicCast_AsSBZArmor_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, K2Node_DynamicCast_AsSBZEquippable_Part_Data_Asset) == 0x000048, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::K2Node_DynamicCast_AsSBZEquippable_Part_Data_Asset' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, K2Node_DynamicCast_AsSBZBase_Weapon_Data) == 0x000058, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::K2Node_DynamicCast_AsSBZBase_Weapon_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_GetModificationsUIData_PartUIData) == 0x000068, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_GetModificationsUIData_PartUIData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, K2Node_DynamicCast_AsSBZTool_Data) == 0x000088, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::K2Node_DynamicCast_AsSBZTool_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, K2Node_DynamicCast_bSuccess_3) == 0x000090, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_GetFormattedDescriptionText_ReturnValue) == 0x000098, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_GetFormattedDescriptionText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_GetObjectName_ReturnValue) == 0x0000B0, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C8, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E0, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_TextIsEmpty_ReturnValue) == 0x0000E1, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, K2Node_DynamicCast_AsSBZEquippable_Data) == 0x0000E8, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::K2Node_DynamicCast_AsSBZEquippable_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, K2Node_DynamicCast_bSuccess_4) == 0x0000F0, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, K2Node_DynamicCast_AsSBZOverskill_Loadout_Data) == 0x0000F8, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::K2Node_DynamicCast_AsSBZOverskill_Loadout_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, K2Node_DynamicCast_bSuccess_5) == 0x000100, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, Temp_int_Array_Index_Variable) == 0x000104, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000108, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Concat_StrStr_ReturnValue) == 0x000120, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000130, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, Temp_int_Loop_Counter_Variable) == 0x000140, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Add_IntInt_ReturnValue) == 0x000144, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, Temp_int_Loop_Counter_Variable_1) == 0x000148, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Add_IntInt_ReturnValue_1) == 0x00014C, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, Temp_int_Array_Index_Variable_1) == 0x000150, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, Temp_bool_Variable) == 0x000154, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, Temp_bool_Variable_1) == 0x000155, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, K2Node_Select_Default) == 0x000158, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, K2Node_MakeStruct_SlateColor) == 0x000170, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, K2Node_MakeStruct_SlateColor_1) == 0x000198, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, K2Node_Select_Default_1) == 0x0001C0, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Array_Get_Item) == 0x0001E8, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Conv_TextToString_ReturnValue) == 0x000200, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Array_Length_ReturnValue_1) == 0x000210, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000218, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Less_IntInt_ReturnValue) == 0x000228, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000230, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Array_Get_Item_1) == 0x000240, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Array_Length_ReturnValue_2) == 0x000258, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Less_IntInt_ReturnValue_1) == 0x00025C, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000260, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000270, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000280, "Member 'WBP_UI_Inventory_ItemDescriptionBox_C_SetInventoryItem::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");

}

