#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_PlayerDefeatState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_PlayerDefeatState.WBP_UI_Widget_PlayerDefeatState_C
// 0x0038 (0x02D0 - 0x0298)
class UWBP_UI_Widget_PlayerDefeatState_C final : public UPD3HUDPlayerDefeatStateWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WarningFeature;                                    // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_DefeatIcon;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Size;                                              // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayLocalAnim;                                     // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnStateChanged;                                    // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnStateChanged__DelegateSignature(EPD3DefeatState Old, EPD3DefeatState New);
	void ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnInitialized();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnDefeatStateChanged(EPD3DefeatState OldState, EPD3DefeatState NewState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_PlayerDefeatState_C">();
	}
	static class UWBP_UI_Widget_PlayerDefeatState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_PlayerDefeatState_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_PlayerDefeatState_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_PlayerDefeatState_C");
static_assert(sizeof(UWBP_UI_Widget_PlayerDefeatState_C) == 0x0002D0, "Wrong size on UWBP_UI_Widget_PlayerDefeatState_C");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, UberGraphFrame) == 0x000298, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, WarningFeature) == 0x0002A0, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::WarningFeature' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, Image_DefeatIcon) == 0x0002A8, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::Image_DefeatIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, Size) == 0x0002B0, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::Size' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, PlayLocalAnim) == 0x0002B8, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::PlayLocalAnim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, OnStateChanged) == 0x0002C0, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::OnStateChanged' has a wrong offset!");

}

