#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_LoadoutCustomization_ItemButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_LoadoutCustomization_ItemButton.WBP_UI_LoadoutCustomization_ItemButton_C
// 0x00C0 (0x0448 - 0x0388)
class UWBP_UI_LoadoutCustomization_ItemButton_C final : public USBZMainMenuInventoryItemSlotButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Highlight;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_188;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_403;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_511;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_InvalidWeaponButton;                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TextBlock_ItemType;                                // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TextBlock_Name;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          Widget_Icon;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   HeaderValue;                                       // 0x0418(0x0018)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             ButtonFocusedEvent;                                // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HasText;                                           // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ButtonFocusedEvent__DelegateSignature(class UObject* FocusedButton);
	void ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton(int32 EntryPoint);
	void OnItemDataInitialized();
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void PreConstruct(bool IsDesignTime);
	void OnInitialized();
	void OnSelection();
	void OnHover(bool bIsHovered);
	void OnFocused(bool bIsFocused);
	void OnNone();
	void RefreshVisuals();
	void SetItemVisuals(class USBZInventoryBaseData* InInventoryData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_LoadoutCustomization_ItemButton_C">();
	}
	static class UWBP_UI_LoadoutCustomization_ItemButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_LoadoutCustomization_ItemButton_C>();
	}
};
static_assert(alignof(UWBP_UI_LoadoutCustomization_ItemButton_C) == 0x000008, "Wrong alignment on UWBP_UI_LoadoutCustomization_ItemButton_C");
static_assert(sizeof(UWBP_UI_LoadoutCustomization_ItemButton_C) == 0x000448, "Wrong size on UWBP_UI_LoadoutCustomization_ItemButton_C");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, UberGraphFrame) == 0x000388, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, HoverAnim) == 0x000390, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, Border_Highlight) == 0x000398, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, Image) == 0x0003A0, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, Image_1) == 0x0003A8, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, Image_2) == 0x0003B0, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, Image_3) == 0x0003B8, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, Image_4) == 0x0003C0, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, Image_5) == 0x0003C8, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, Image_6) == 0x0003D0, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, Image_188) == 0x0003D8, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::Image_188' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, Image_403) == 0x0003E0, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::Image_403' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, Image_511) == 0x0003E8, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::Image_511' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, Image_Background) == 0x0003F0, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, Image_InvalidWeaponButton) == 0x0003F8, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::Image_InvalidWeaponButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, TextBlock_ItemType) == 0x000400, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::TextBlock_ItemType' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, TextBlock_Name) == 0x000408, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::TextBlock_Name' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, Widget_Icon) == 0x000410, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::Widget_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, HeaderValue) == 0x000418, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::HeaderValue' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, ButtonFocusedEvent) == 0x000430, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::ButtonFocusedEvent' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_ItemButton_C, HasText) == 0x000440, "Member 'UWBP_UI_LoadoutCustomization_ItemButton_C::HasText' has a wrong offset!");

}

