#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScreenTitle

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ScreenTitle.WBP_ScreenTitle_C.ExecuteUbergraph_WBP_ScreenTitle
// 0x0030 (0x0030 - 0x0000)
struct WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0010(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle) == 0x000008, "Wrong alignment on WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle");
static_assert(sizeof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle) == 0x000030, "Wrong size on WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, EntryPoint) == 0x000000, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, Temp_bool_Variable) == 0x000004, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, CallFunc_TextIsEmpty_ReturnValue) == 0x000005, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, Temp_byte_Variable) == 0x000006, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, Temp_byte_Variable_1) == 0x000007, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, Temp_bool_Variable_1) == 0x000008, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, Temp_byte_Variable_2) == 0x000009, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, Temp_byte_Variable_3) == 0x00000A, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, K2Node_CustomEvent_InText) == 0x000010, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, K2Node_Select_Default) == 0x000028, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000029, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, K2Node_Select_Default_1) == 0x00002A, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, K2Node_Event_IsDesignTime) == 0x00002B, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_ScreenTitle.WBP_ScreenTitle_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ScreenTitle_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ScreenTitle_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ScreenTitle_C_PreConstruct");
static_assert(sizeof(WBP_ScreenTitle_C_PreConstruct) == 0x000001, "Wrong size on WBP_ScreenTitle_C_PreConstruct");
static_assert(offsetof(WBP_ScreenTitle_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ScreenTitle_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ScreenTitle.WBP_ScreenTitle_C.UpdateTitle
// 0x0018 (0x0018 - 0x0000)
struct WBP_ScreenTitle_C_UpdateTitle final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ScreenTitle_C_UpdateTitle) == 0x000008, "Wrong alignment on WBP_ScreenTitle_C_UpdateTitle");
static_assert(sizeof(WBP_ScreenTitle_C_UpdateTitle) == 0x000018, "Wrong size on WBP_ScreenTitle_C_UpdateTitle");
static_assert(offsetof(WBP_ScreenTitle_C_UpdateTitle, InText) == 0x000000, "Member 'WBP_ScreenTitle_C_UpdateTitle::InText' has a wrong offset!");

}

