#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JewelryMachine

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_JewelryMachine.WBP_JewelryMachine_C.ExecuteUbergraph_WBP_JewelryMachine
// 0x0004 (0x0004 - 0x0000)
struct WBP_JewelryMachine_C_ExecuteUbergraph_WBP_JewelryMachine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JewelryMachine_C_ExecuteUbergraph_WBP_JewelryMachine) == 0x000004, "Wrong alignment on WBP_JewelryMachine_C_ExecuteUbergraph_WBP_JewelryMachine");
static_assert(sizeof(WBP_JewelryMachine_C_ExecuteUbergraph_WBP_JewelryMachine) == 0x000004, "Wrong size on WBP_JewelryMachine_C_ExecuteUbergraph_WBP_JewelryMachine");
static_assert(offsetof(WBP_JewelryMachine_C_ExecuteUbergraph_WBP_JewelryMachine, EntryPoint) == 0x000000, "Member 'WBP_JewelryMachine_C_ExecuteUbergraph_WBP_JewelryMachine::EntryPoint' has a wrong offset!");

// Function WBP_JewelryMachine.WBP_JewelryMachine_C.SetAmount
// 0x0018 (0x0018 - 0x0000)
struct WBP_JewelryMachine_C_SetAmount final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_JewelryMachine_C_SetAmount) == 0x000008, "Wrong alignment on WBP_JewelryMachine_C_SetAmount");
static_assert(sizeof(WBP_JewelryMachine_C_SetAmount) == 0x000018, "Wrong size on WBP_JewelryMachine_C_SetAmount");
static_assert(offsetof(WBP_JewelryMachine_C_SetAmount, InText) == 0x000000, "Member 'WBP_JewelryMachine_C_SetAmount::InText' has a wrong offset!");

}

