#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_ItemDescription

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Inventory_ItemDescription.WBP_UI_Inventory_ItemDescription_C.SetInventoryItem
// 0x0298 (0x0298 - 0x0000)
struct WBP_UI_Inventory_ItemDescription_C_SetInventoryItem final
{
public:
	class USBZInventoryBaseData*                  InInventoryItem;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 PartStatsString;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FSBZEquippablePartUIData               PartStatData;                                      // 0x0018(0x0020)(Edit, BlueprintVisible)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZWeaponPartDataAsset*          K2Node_DynamicCast_AsSBZWeapon_Part_Data_Asset;    // 0x0070(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZToolData*                           K2Node_DynamicCast_AsSBZTool_Data;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZWeaponSightData*              CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_2;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSBZEquippablePartUIData               CallFunc_GetModificationsUIData_PartUIData;        // 0x0118(0x0020)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0148(0x0028)()
	bool                                          CallFunc_ShippingBuild_ReturnValue;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZWeaponModificationUIData           CallFunc_Array_Get_Item_1;                         // 0x0178(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZWeaponModificationUIData           CallFunc_Array_Get_Item_2;                         // 0x01B0(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x01E0(0x0028)()
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0210(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0293(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem) == 0x000008, "Wrong alignment on WBP_UI_Inventory_ItemDescription_C_SetInventoryItem");
static_assert(sizeof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem) == 0x000298, "Wrong size on WBP_UI_Inventory_ItemDescription_C_SetInventoryItem");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, InInventoryItem) == 0x000000, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::InInventoryItem' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, PartStatsString) == 0x000008, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::PartStatsString' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, PartStatData) == 0x000018, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::PartStatData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_GetObjectName_ReturnValue) == 0x000038, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_TextIsEmpty_ReturnValue) == 0x000048, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000068, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, K2Node_DynamicCast_AsSBZWeapon_Part_Data_Asset) == 0x000070, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::K2Node_DynamicCast_AsSBZWeapon_Part_Data_Asset' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, K2Node_DynamicCast_AsSBZTool_Data) == 0x000080, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::K2Node_DynamicCast_AsSBZTool_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Conv_TextToString_ReturnValue) == 0x0000A0, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B0, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Concat_StrStr_ReturnValue) == 0x0000B8, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000C8, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_TextIsEmpty_ReturnValue_2) == 0x0000D8, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_TextIsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Not_PreBool_ReturnValue) == 0x0000D9, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_IsValid_ReturnValue) == 0x0000DA, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000DB, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Conv_FloatToString_ReturnValue) == 0x0000E0, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000F0, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, Temp_int_Array_Index_Variable) == 0x000100, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000108, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_GetModificationsUIData_PartUIData) == 0x000118, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_GetModificationsUIData_PartUIData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, Temp_int_Loop_Counter_Variable) == 0x000138, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, Temp_int_Array_Index_Variable_1) == 0x00013C, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Add_IntInt_ReturnValue) == 0x000140, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, K2Node_MakeStruct_SlateColor) == 0x000148, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_ShippingBuild_ReturnValue) == 0x000170, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_ShippingBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Array_Get_Item_1) == 0x000178, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Not_PreBool_ReturnValue_1) == 0x000190, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_BooleanAND_ReturnValue) == 0x000191, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000198, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Array_Length_ReturnValue_1) == 0x0001A8, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Array_Get_Item_2) == 0x0001B0, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Array_Length_ReturnValue_2) == 0x0001C8, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Less_IntInt_ReturnValue) == 0x0001CC, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0001D0, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, K2Node_MakeStruct_SlateColor_1) == 0x0001E0, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, Temp_int_Loop_Counter_Variable_1) == 0x000208, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000210, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Less_IntInt_ReturnValue_1) == 0x000228, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Add_IntInt_ReturnValue_1) == 0x00022C, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000230, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000240, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000250, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000260, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000270, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000280, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, Temp_byte_Variable) == 0x000290, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, Temp_byte_Variable_1) == 0x000291, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, Temp_bool_Variable) == 0x000292, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ItemDescription_C_SetInventoryItem, K2Node_Select_Default) == 0x000293, "Member 'WBP_UI_Inventory_ItemDescription_C_SetInventoryItem::K2Node_Select_Default' has a wrong offset!");

}

