#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Menu_Debug_BackendErrorScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Menu_Debug_BackendErrorScreen.WBP_UI_Menu_Debug_BackendErrorScreen_C
// 0x0078 (0x0318 - 0x02A0)
class UWBP_UI_Menu_Debug_BackendErrorScreen_C final : public USBZBackendErrorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background_BG;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_BG_1;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TextButton_C*                   Button_Quit_1;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TextButton_C*                   Button_ReturnToLogin;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TxtConfiguration;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TxtEngineVersion;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TxtError;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TxtHeader;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TxtVersion;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VersionBox;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSoftObjectPath                        SelectedPath;                                      // 0x02F8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen(int32 EntryPoint);
	void BndEvt__WBP_UI_Menu_Debug_BackendErrorScreen_Button_Quit_1_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_UI_Menu_Debug_NetworkErrorScreen_Button_ReturnToMainMenu_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void OnInitialized();
	void Construct();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void Fill_Version_String();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Menu_Debug_BackendErrorScreen_C">();
	}
	static class UWBP_UI_Menu_Debug_BackendErrorScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Menu_Debug_BackendErrorScreen_C>();
	}
};
static_assert(alignof(UWBP_UI_Menu_Debug_BackendErrorScreen_C) == 0x000008, "Wrong alignment on UWBP_UI_Menu_Debug_BackendErrorScreen_C");
static_assert(sizeof(UWBP_UI_Menu_Debug_BackendErrorScreen_C) == 0x000318, "Wrong size on UWBP_UI_Menu_Debug_BackendErrorScreen_C");
static_assert(offsetof(UWBP_UI_Menu_Debug_BackendErrorScreen_C, UberGraphFrame) == 0x0002A0, "Member 'UWBP_UI_Menu_Debug_BackendErrorScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_Debug_BackendErrorScreen_C, Background_BG) == 0x0002A8, "Member 'UWBP_UI_Menu_Debug_BackendErrorScreen_C::Background_BG' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_Debug_BackendErrorScreen_C, Background_BG_1) == 0x0002B0, "Member 'UWBP_UI_Menu_Debug_BackendErrorScreen_C::Background_BG_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_Debug_BackendErrorScreen_C, Button_Quit_1) == 0x0002B8, "Member 'UWBP_UI_Menu_Debug_BackendErrorScreen_C::Button_Quit_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_Debug_BackendErrorScreen_C, Button_ReturnToLogin) == 0x0002C0, "Member 'UWBP_UI_Menu_Debug_BackendErrorScreen_C::Button_ReturnToLogin' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_Debug_BackendErrorScreen_C, TxtConfiguration) == 0x0002C8, "Member 'UWBP_UI_Menu_Debug_BackendErrorScreen_C::TxtConfiguration' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_Debug_BackendErrorScreen_C, TxtEngineVersion) == 0x0002D0, "Member 'UWBP_UI_Menu_Debug_BackendErrorScreen_C::TxtEngineVersion' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_Debug_BackendErrorScreen_C, TxtError) == 0x0002D8, "Member 'UWBP_UI_Menu_Debug_BackendErrorScreen_C::TxtError' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_Debug_BackendErrorScreen_C, TxtHeader) == 0x0002E0, "Member 'UWBP_UI_Menu_Debug_BackendErrorScreen_C::TxtHeader' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_Debug_BackendErrorScreen_C, TxtVersion) == 0x0002E8, "Member 'UWBP_UI_Menu_Debug_BackendErrorScreen_C::TxtVersion' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_Debug_BackendErrorScreen_C, VersionBox) == 0x0002F0, "Member 'UWBP_UI_Menu_Debug_BackendErrorScreen_C::VersionBox' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_Debug_BackendErrorScreen_C, SelectedPath) == 0x0002F8, "Member 'UWBP_UI_Menu_Debug_BackendErrorScreen_C::SelectedPath' has a wrong offset!");

}

