#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SM_GameStart

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_SM_GameStart.WBP_UI_SM_GameStart_C.ExecuteUbergraph_WBP_UI_SM_GameStart
// 0x0218 (0x0218 - 0x0000)
struct WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ClosingActionName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x004C(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetUIStack_ReturnValue;                   // 0x0058(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x006C(0x0014)(ZeroConstructor, NoDestructor)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue_1;                   // 0x0088(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetUIStack_ReturnValue_1;                 // 0x0098(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZGameModeMainMenu*                   K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_2;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameUserSettings*                   CallFunc_Get_ReturnValue;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_ClosingActionName;              // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPopupShown_ReturnValue;                 // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_3;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameUserSettings*                   CallFunc_Get_ReturnValue_1;                        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_4;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_5;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldStartInHeistSelection_ReturnValue;  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZFullscreenVideoWidget*              K2Node_ComponentBoundEvent_InWidget;               // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bInIsActive;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZUIPopupData                        K2Node_MakeStruct_SBZUIPopupData;                  // 0x0160(0x0060)(ContainsInstancedReference)
	struct FSBZUIStackChangedEvent                K2Node_CustomEvent_StackEvent;                     // 0x01C0(0x001C)(NoDestructor)
	TDelegate<void(const struct FSBZUIStackChangedEvent& StackEvent)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x01DC(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x01F4(0x0014)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20A[0x2];                                      // 0x020A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSoloGameEnabled_ReturnValue;            // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart) == 0x000008, "Wrong alignment on WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart");
static_assert(sizeof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart) == 0x000218, "Wrong size on WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, EntryPoint) == 0x000000, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_GetGameStateMachine_ReturnValue) == 0x000018, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_GetGameStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_GetUIManager_ReturnValue) == 0x000038, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_MakeLiteralName_ReturnValue) == 0x000040, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_PopStack_ReturnValue) == 0x00004C, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_GetUIStack_ReturnValue) == 0x000058, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_GetUIStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, K2Node_CreateDelegate_OutputDelegate_2) == 0x00006C, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_GetUIManager_ReturnValue_1) == 0x000080, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_PopStack_ReturnValue_1) == 0x000088, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_PopStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_GetUIStack_ReturnValue_1) == 0x000098, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_GetUIStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_Array_Length_ReturnValue_1) == 0x0000A8, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x0000B0, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_PlayAnimation_ReturnValue) == 0x0000B8, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_MakeLiteralName_ReturnValue_1) == 0x0000C0, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_GetGameMode_ReturnValue) == 0x0000D0, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu) == 0x0000D8, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_GetUIManager_ReturnValue_2) == 0x0000E8, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_GetUIManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_Get_ReturnValue) == 0x0000F0, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, K2Node_CustomEvent_ClosingActionName) == 0x0000F8, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::K2Node_CustomEvent_ClosingActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_IsPopupShown_ReturnValue) == 0x000104, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_IsPopupShown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_GetUIManager_ReturnValue_3) == 0x000108, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_GetUIManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_Get_ReturnValue_1) == 0x000110, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_GetUIManager_ReturnValue_4) == 0x000118, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_GetUIManager_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_MakeLiteralName_ReturnValue_2) == 0x000124, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_MakeLiteralName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_GetUIManager_ReturnValue_5) == 0x000130, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_GetUIManager_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_ShouldStartInHeistSelection_ReturnValue) == 0x000138, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_ShouldStartInHeistSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, K2Node_ComponentBoundEvent_InWidget) == 0x000140, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::K2Node_ComponentBoundEvent_InWidget' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, K2Node_ComponentBoundEvent_bInIsActive) == 0x000148, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::K2Node_ComponentBoundEvent_bInIsActive' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, Temp_int_Loop_Counter_Variable) == 0x00014C, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, Temp_int_Variable) == 0x000150, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_Less_IntInt_ReturnValue) == 0x000154, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000155, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_Add_IntInt_ReturnValue) == 0x000158, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_Add_IntInt_ReturnValue_1) == 0x00015C, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, K2Node_MakeStruct_SBZUIPopupData) == 0x000160, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::K2Node_MakeStruct_SBZUIPopupData' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, K2Node_CustomEvent_StackEvent) == 0x0001C0, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::K2Node_CustomEvent_StackEvent' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001DC, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, K2Node_SwitchName_CmpSuccess) == 0x0001F0, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001F4, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, K2Node_CustomEvent_InVisibility) == 0x000208, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, K2Node_SwitchEnum_CmpSuccess) == 0x000209, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, Temp_int_Array_Index_Variable) == 0x00020C, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart, CallFunc_IsSoloGameEnabled_ReturnValue) == 0x000210, "Member 'WBP_UI_SM_GameStart_C_ExecuteUbergraph_WBP_UI_SM_GameStart::CallFunc_IsSoloGameEnabled_ReturnValue' has a wrong offset!");

// Function WBP_UI_SM_GameStart.WBP_UI_SM_GameStart_C.OnControlReferencesVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_SM_GameStart_C_OnControlReferencesVisibilityChanged final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_GameStart_C_OnControlReferencesVisibilityChanged) == 0x000001, "Wrong alignment on WBP_UI_SM_GameStart_C_OnControlReferencesVisibilityChanged");
static_assert(sizeof(WBP_UI_SM_GameStart_C_OnControlReferencesVisibilityChanged) == 0x000001, "Wrong size on WBP_UI_SM_GameStart_C_OnControlReferencesVisibilityChanged");
static_assert(offsetof(WBP_UI_SM_GameStart_C_OnControlReferencesVisibilityChanged, InVisibility) == 0x000000, "Member 'WBP_UI_SM_GameStart_C_OnControlReferencesVisibilityChanged::InVisibility' has a wrong offset!");

// Function WBP_UI_SM_GameStart.WBP_UI_SM_GameStart_C.BndEvt__WBP_UI_SM_GameStart_Widget_FullscreenVideo_K2Node_ComponentBoundEvent_0_SBZFullscreenVideoActiveChangedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_SM_GameStart_C_BndEvt__WBP_UI_SM_GameStart_Widget_FullscreenVideo_K2Node_ComponentBoundEvent_0_SBZFullscreenVideoActiveChangedDelegate__DelegateSignature final
{
public:
	class USBZFullscreenVideoWidget*              InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInIsActive;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SM_GameStart_C_BndEvt__WBP_UI_SM_GameStart_Widget_FullscreenVideo_K2Node_ComponentBoundEvent_0_SBZFullscreenVideoActiveChangedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SM_GameStart_C_BndEvt__WBP_UI_SM_GameStart_Widget_FullscreenVideo_K2Node_ComponentBoundEvent_0_SBZFullscreenVideoActiveChangedDelegate__DelegateSignature");
static_assert(sizeof(WBP_UI_SM_GameStart_C_BndEvt__WBP_UI_SM_GameStart_Widget_FullscreenVideo_K2Node_ComponentBoundEvent_0_SBZFullscreenVideoActiveChangedDelegate__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_SM_GameStart_C_BndEvt__WBP_UI_SM_GameStart_Widget_FullscreenVideo_K2Node_ComponentBoundEvent_0_SBZFullscreenVideoActiveChangedDelegate__DelegateSignature");
static_assert(offsetof(WBP_UI_SM_GameStart_C_BndEvt__WBP_UI_SM_GameStart_Widget_FullscreenVideo_K2Node_ComponentBoundEvent_0_SBZFullscreenVideoActiveChangedDelegate__DelegateSignature, InWidget) == 0x000000, "Member 'WBP_UI_SM_GameStart_C_BndEvt__WBP_UI_SM_GameStart_Widget_FullscreenVideo_K2Node_ComponentBoundEvent_0_SBZFullscreenVideoActiveChangedDelegate__DelegateSignature::InWidget' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_GameStart_C_BndEvt__WBP_UI_SM_GameStart_Widget_FullscreenVideo_K2Node_ComponentBoundEvent_0_SBZFullscreenVideoActiveChangedDelegate__DelegateSignature, bInIsActive) == 0x000008, "Member 'WBP_UI_SM_GameStart_C_BndEvt__WBP_UI_SM_GameStart_Widget_FullscreenVideo_K2Node_ComponentBoundEvent_0_SBZFullscreenVideoActiveChangedDelegate__DelegateSignature::bInIsActive' has a wrong offset!");

// Function WBP_UI_SM_GameStart.WBP_UI_SM_GameStart_C.OnPhotosensitivityConfirmed
// 0x000C (0x000C - 0x0000)
struct WBP_UI_SM_GameStart_C_OnPhotosensitivityConfirmed final
{
public:
	class FName                                   ClosingActionName;                                 // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_GameStart_C_OnPhotosensitivityConfirmed) == 0x000004, "Wrong alignment on WBP_UI_SM_GameStart_C_OnPhotosensitivityConfirmed");
static_assert(sizeof(WBP_UI_SM_GameStart_C_OnPhotosensitivityConfirmed) == 0x00000C, "Wrong size on WBP_UI_SM_GameStart_C_OnPhotosensitivityConfirmed");
static_assert(offsetof(WBP_UI_SM_GameStart_C_OnPhotosensitivityConfirmed, ClosingActionName) == 0x000000, "Member 'WBP_UI_SM_GameStart_C_OnPhotosensitivityConfirmed::ClosingActionName' has a wrong offset!");

// Function WBP_UI_SM_GameStart.WBP_UI_SM_GameStart_C.OnStackChanged
// 0x001C (0x001C - 0x0000)
struct WBP_UI_SM_GameStart_C_OnStackChanged final
{
public:
	struct FSBZUIStackChangedEvent                StackEvent;                                        // 0x0000(0x001C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_UI_SM_GameStart_C_OnStackChanged) == 0x000004, "Wrong alignment on WBP_UI_SM_GameStart_C_OnStackChanged");
static_assert(sizeof(WBP_UI_SM_GameStart_C_OnStackChanged) == 0x00001C, "Wrong size on WBP_UI_SM_GameStart_C_OnStackChanged");
static_assert(offsetof(WBP_UI_SM_GameStart_C_OnStackChanged, StackEvent) == 0x000000, "Member 'WBP_UI_SM_GameStart_C_OnStackChanged::StackEvent' has a wrong offset!");

}

