#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_LoadoutCustomization_ItemButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_LoadoutCustomization_ItemButton.WBP_UI_LoadoutCustomization_ItemButton_C.ButtonFocusedEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_LoadoutCustomization_ItemButton_C_ButtonFocusedEvent__DelegateSignature final
{
public:
	class UObject*                                FocusedButton;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_LoadoutCustomization_ItemButton_C_ButtonFocusedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_LoadoutCustomization_ItemButton_C_ButtonFocusedEvent__DelegateSignature");
static_assert(sizeof(WBP_UI_LoadoutCustomization_ItemButton_C_ButtonFocusedEvent__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_LoadoutCustomization_ItemButton_C_ButtonFocusedEvent__DelegateSignature");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_ButtonFocusedEvent__DelegateSignature, FocusedButton) == 0x000000, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_ButtonFocusedEvent__DelegateSignature::FocusedButton' has a wrong offset!");

// Function WBP_UI_LoadoutCustomization_ItemButton.WBP_UI_LoadoutCustomization_ItemButton_C.ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInHasFocus;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInIsHovered;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZInventoryBaseData*            CallFunc_GetItemData_ReturnValue;                  // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton) == 0x000008, "Wrong alignment on WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton");
static_assert(sizeof(WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton) == 0x000018, "Wrong size on WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton, EntryPoint) == 0x000000, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton, K2Node_Event_bInHasFocus) == 0x000005, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton::K2Node_Event_bInHasFocus' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton, K2Node_Event_bInIsHovered) == 0x000006, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton::K2Node_Event_bInIsHovered' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton, CallFunc_GetItemData_ReturnValue) == 0x000008, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_ExecuteUbergraph_WBP_UI_LoadoutCustomization_ItemButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_UI_LoadoutCustomization_ItemButton.WBP_UI_LoadoutCustomization_ItemButton_C.ButtonHoveredChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_LoadoutCustomization_ItemButton_C_ButtonHoveredChanged final
{
public:
	bool                                          bInIsHovered;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_LoadoutCustomization_ItemButton_C_ButtonHoveredChanged) == 0x000001, "Wrong alignment on WBP_UI_LoadoutCustomization_ItemButton_C_ButtonHoveredChanged");
static_assert(sizeof(WBP_UI_LoadoutCustomization_ItemButton_C_ButtonHoveredChanged) == 0x000001, "Wrong size on WBP_UI_LoadoutCustomization_ItemButton_C_ButtonHoveredChanged");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_ButtonHoveredChanged, bInIsHovered) == 0x000000, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_ButtonHoveredChanged::bInIsHovered' has a wrong offset!");

// Function WBP_UI_LoadoutCustomization_ItemButton.WBP_UI_LoadoutCustomization_ItemButton_C.ButtonFocusedChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_LoadoutCustomization_ItemButton_C_ButtonFocusedChanged final
{
public:
	bool                                          bInHasFocus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_LoadoutCustomization_ItemButton_C_ButtonFocusedChanged) == 0x000001, "Wrong alignment on WBP_UI_LoadoutCustomization_ItemButton_C_ButtonFocusedChanged");
static_assert(sizeof(WBP_UI_LoadoutCustomization_ItemButton_C_ButtonFocusedChanged) == 0x000001, "Wrong size on WBP_UI_LoadoutCustomization_ItemButton_C_ButtonFocusedChanged");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_ButtonFocusedChanged, bInHasFocus) == 0x000000, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_ButtonFocusedChanged::bInHasFocus' has a wrong offset!");

// Function WBP_UI_LoadoutCustomization_ItemButton.WBP_UI_LoadoutCustomization_ItemButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_LoadoutCustomization_ItemButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_LoadoutCustomization_ItemButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_LoadoutCustomization_ItemButton_C_PreConstruct");
static_assert(sizeof(WBP_UI_LoadoutCustomization_ItemButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_LoadoutCustomization_ItemButton_C_PreConstruct");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_LoadoutCustomization_ItemButton.WBP_UI_LoadoutCustomization_ItemButton_C.OnSelection
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_LoadoutCustomization_ItemButton_C_OnSelection final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
};
static_assert(alignof(WBP_UI_LoadoutCustomization_ItemButton_C_OnSelection) == 0x000008, "Wrong alignment on WBP_UI_LoadoutCustomization_ItemButton_C_OnSelection");
static_assert(sizeof(WBP_UI_LoadoutCustomization_ItemButton_C_OnSelection) == 0x000028, "Wrong size on WBP_UI_LoadoutCustomization_ItemButton_C_OnSelection");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_OnSelection, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_OnSelection::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_UI_LoadoutCustomization_ItemButton.WBP_UI_LoadoutCustomization_ItemButton_C.OnHover
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_LoadoutCustomization_ItemButton_C_OnHover final
{
public:
	bool                                          bIsHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_LoadoutCustomization_ItemButton_C_OnHover) == 0x000001, "Wrong alignment on WBP_UI_LoadoutCustomization_ItemButton_C_OnHover");
static_assert(sizeof(WBP_UI_LoadoutCustomization_ItemButton_C_OnHover) == 0x000001, "Wrong size on WBP_UI_LoadoutCustomization_ItemButton_C_OnHover");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_OnHover, bIsHovered) == 0x000000, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_OnHover::bIsHovered' has a wrong offset!");

// Function WBP_UI_LoadoutCustomization_ItemButton.WBP_UI_LoadoutCustomization_ItemButton_C.OnFocused
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_LoadoutCustomization_ItemButton_C_OnFocused final
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_LoadoutCustomization_ItemButton_C_OnFocused) == 0x000008, "Wrong alignment on WBP_UI_LoadoutCustomization_ItemButton_C_OnFocused");
static_assert(sizeof(WBP_UI_LoadoutCustomization_ItemButton_C_OnFocused) == 0x000028, "Wrong size on WBP_UI_LoadoutCustomization_ItemButton_C_OnFocused");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_OnFocused, bIsFocused) == 0x000000, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_OnFocused::bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_OnFocused, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_OnFocused::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_OnFocused, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_OnFocused::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_OnFocused, CallFunc_SelectColor_ReturnValue) == 0x000018, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_OnFocused::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function WBP_UI_LoadoutCustomization_ItemButton.WBP_UI_LoadoutCustomization_ItemButton_C.OnNone
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_LoadoutCustomization_ItemButton_C_OnNone final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
};
static_assert(alignof(WBP_UI_LoadoutCustomization_ItemButton_C_OnNone) == 0x000008, "Wrong alignment on WBP_UI_LoadoutCustomization_ItemButton_C_OnNone");
static_assert(sizeof(WBP_UI_LoadoutCustomization_ItemButton_C_OnNone) == 0x000028, "Wrong size on WBP_UI_LoadoutCustomization_ItemButton_C_OnNone");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_OnNone, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_OnNone::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_UI_LoadoutCustomization_ItemButton.WBP_UI_LoadoutCustomization_ItemButton_C.RefreshVisuals
// 0x0002 (0x0002 - 0x0000)
struct WBP_UI_LoadoutCustomization_ItemButton_C_RefreshVisuals final
{
public:
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_LoadoutCustomization_ItemButton_C_RefreshVisuals) == 0x000001, "Wrong alignment on WBP_UI_LoadoutCustomization_ItemButton_C_RefreshVisuals");
static_assert(sizeof(WBP_UI_LoadoutCustomization_ItemButton_C_RefreshVisuals) == 0x000002, "Wrong size on WBP_UI_LoadoutCustomization_ItemButton_C_RefreshVisuals");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_RefreshVisuals, CallFunc_IsHovered_ReturnValue) == 0x000000, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_RefreshVisuals::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_RefreshVisuals, CallFunc_HasKeyboardFocus_ReturnValue) == 0x000001, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_RefreshVisuals::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");

// Function WBP_UI_LoadoutCustomization_ItemButton.WBP_UI_LoadoutCustomization_ItemButton_C.SetItemVisuals
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_LoadoutCustomization_ItemButton_C_SetItemVisuals final
{
public:
	class USBZInventoryBaseData*                  InInventoryData;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_OutDisplayName;            // 0x0008(0x0018)()
	bool                                          CallFunc_GetDisplayName_OutHasText;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_LoadoutCustomization_ItemButton_C_SetItemVisuals) == 0x000008, "Wrong alignment on WBP_UI_LoadoutCustomization_ItemButton_C_SetItemVisuals");
static_assert(sizeof(WBP_UI_LoadoutCustomization_ItemButton_C_SetItemVisuals) == 0x000028, "Wrong size on WBP_UI_LoadoutCustomization_ItemButton_C_SetItemVisuals");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_SetItemVisuals, InInventoryData) == 0x000000, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_SetItemVisuals::InInventoryData' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_SetItemVisuals, CallFunc_GetDisplayName_OutDisplayName) == 0x000008, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_SetItemVisuals::CallFunc_GetDisplayName_OutDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_SetItemVisuals, CallFunc_GetDisplayName_OutHasText) == 0x000020, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_SetItemVisuals::CallFunc_GetDisplayName_OutHasText' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoadoutCustomization_ItemButton_C_SetItemVisuals, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'WBP_UI_LoadoutCustomization_ItemButton_C_SetItemVisuals::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

