#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_PartyMemberRevive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_PartyMemberRevive.WBP_UI_Widget_PartyMemberRevive_C
// 0x0018 (0x02D0 - 0x02B8)
class UWBP_UI_Widget_PartyMemberRevive_C final : public UPD3ReviveInteractionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_ReviveGauge;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ReviveGauge_Material;                              // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_PartyMemberRevive(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_PartyMemberRevive_C">();
	}
	static class UWBP_UI_Widget_PartyMemberRevive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_PartyMemberRevive_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_PartyMemberRevive_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_PartyMemberRevive_C");
static_assert(sizeof(UWBP_UI_Widget_PartyMemberRevive_C) == 0x0002D0, "Wrong size on UWBP_UI_Widget_PartyMemberRevive_C");
static_assert(offsetof(UWBP_UI_Widget_PartyMemberRevive_C, UberGraphFrame) == 0x0002B8, "Member 'UWBP_UI_Widget_PartyMemberRevive_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PartyMemberRevive_C, Image_ReviveGauge) == 0x0002C0, "Member 'UWBP_UI_Widget_PartyMemberRevive_C::Image_ReviveGauge' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PartyMemberRevive_C, ReviveGauge_Material) == 0x0002C8, "Member 'UWBP_UI_Widget_PartyMemberRevive_C::ReviveGauge_Material' has a wrong offset!");

}

