#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_Social_ReportPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainMenu_Social_ReportPopup.WBP_MainMenu_Social_ReportPopup_C.SetPlayerName
// 0x0080 (0x0080 - 0x0000)
struct WBP_MainMenu_Social_ReportPopup_C_SetPlayerName final
{
public:
	class FText                                   PlayerName;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0018)()
};
static_assert(alignof(WBP_MainMenu_Social_ReportPopup_C_SetPlayerName) == 0x000008, "Wrong alignment on WBP_MainMenu_Social_ReportPopup_C_SetPlayerName");
static_assert(sizeof(WBP_MainMenu_Social_ReportPopup_C_SetPlayerName) == 0x000080, "Wrong size on WBP_MainMenu_Social_ReportPopup_C_SetPlayerName");
static_assert(offsetof(WBP_MainMenu_Social_ReportPopup_C_SetPlayerName, PlayerName) == 0x000000, "Member 'WBP_MainMenu_Social_ReportPopup_C_SetPlayerName::PlayerName' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Social_ReportPopup_C_SetPlayerName, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_MainMenu_Social_ReportPopup_C_SetPlayerName::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Social_ReportPopup_C_SetPlayerName, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_MainMenu_Social_ReportPopup_C_SetPlayerName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Social_ReportPopup_C_SetPlayerName, CallFunc_Format_ReturnValue) == 0x000068, "Member 'WBP_MainMenu_Social_ReportPopup_C_SetPlayerName::CallFunc_Format_ReturnValue' has a wrong offset!");

}

