#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_ItemInventoryScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_ItemInventoryScreen.WBP_UI_ItemInventoryScreen_C
// 0x0048 (0x0358 - 0x0310)
class UWBP_UI_ItemInventoryScreen_C final : public USBZMainMenuItemInventoryScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Desc_Box;                                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScreenTitle_C*                     ScreenTitle;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_ItemSlot;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_ContentBackground_C*            WBP_UI_ContentBackground;                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Inventory_ItemDescriptionBox_C* WBP_UI_Inventory_ItemDescriptionBox;               // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZMenuButton*                         FocusedButton;                                     // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug_IsTest;                                      // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_ItemInventoryScreen(int32 EntryPoint);
	void OnItemSlotsUpdated();
	void OnItemSlotButtonSelected(class USBZMenuButton* SelectedButton);
	void OnItemSlotButtonFocusedChanged(class USBZMenuButton* SelectedButton, bool bIsFocused);
	void OnControlsReferenceClicked(class FName InActionInput);
	void OnLostStackFocused();
	void OnGainedStackFocused(const class FName& PreviousValue);
	void OnItemSlotScreenDisplayed();
	void OnPressCustomize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_ItemInventoryScreen_C">();
	}
	static class UWBP_UI_ItemInventoryScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_ItemInventoryScreen_C>();
	}
};
static_assert(alignof(UWBP_UI_ItemInventoryScreen_C) == 0x000008, "Wrong alignment on UWBP_UI_ItemInventoryScreen_C");
static_assert(sizeof(UWBP_UI_ItemInventoryScreen_C) == 0x000358, "Wrong size on UWBP_UI_ItemInventoryScreen_C");
static_assert(offsetof(UWBP_UI_ItemInventoryScreen_C, UberGraphFrame) == 0x000310, "Member 'UWBP_UI_ItemInventoryScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ItemInventoryScreen_C, Intro) == 0x000318, "Member 'UWBP_UI_ItemInventoryScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ItemInventoryScreen_C, Overlay_Desc_Box) == 0x000320, "Member 'UWBP_UI_ItemInventoryScreen_C::Overlay_Desc_Box' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ItemInventoryScreen_C, ScreenTitle) == 0x000328, "Member 'UWBP_UI_ItemInventoryScreen_C::ScreenTitle' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ItemInventoryScreen_C, Text_ItemSlot) == 0x000330, "Member 'UWBP_UI_ItemInventoryScreen_C::Text_ItemSlot' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ItemInventoryScreen_C, WBP_UI_ContentBackground) == 0x000338, "Member 'UWBP_UI_ItemInventoryScreen_C::WBP_UI_ContentBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ItemInventoryScreen_C, WBP_UI_Inventory_ItemDescriptionBox) == 0x000340, "Member 'UWBP_UI_ItemInventoryScreen_C::WBP_UI_Inventory_ItemDescriptionBox' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ItemInventoryScreen_C, FocusedButton) == 0x000348, "Member 'UWBP_UI_ItemInventoryScreen_C::FocusedButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ItemInventoryScreen_C, Debug_IsTest) == 0x000350, "Member 'UWBP_UI_ItemInventoryScreen_C::Debug_IsTest' has a wrong offset!");

}

