#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JewelryMachine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_JewelryMachine.WBP_JewelryMachine_C
// 0x0048 (0x02D8 - 0x0290)
class UWBP_JewelryMachine_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Amount;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Offline;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Packets;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Process;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         State_Error;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         State_Ready;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           State_Scanning;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_JewelryMachine(int32 EntryPoint);
	void Error();
	void Scanning();
	void Ready();
	void SetAmount(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_JewelryMachine_C">();
	}
	static class UWBP_JewelryMachine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_JewelryMachine_C>();
	}
};
static_assert(alignof(UWBP_JewelryMachine_C) == 0x000008, "Wrong alignment on UWBP_JewelryMachine_C");
static_assert(sizeof(UWBP_JewelryMachine_C) == 0x0002D8, "Wrong size on UWBP_JewelryMachine_C");
static_assert(offsetof(UWBP_JewelryMachine_C, UberGraphFrame) == 0x000290, "Member 'UWBP_JewelryMachine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_JewelryMachine_C, Amount) == 0x000298, "Member 'UWBP_JewelryMachine_C::Amount' has a wrong offset!");
static_assert(offsetof(UWBP_JewelryMachine_C, Offline) == 0x0002A0, "Member 'UWBP_JewelryMachine_C::Offline' has a wrong offset!");
static_assert(offsetof(UWBP_JewelryMachine_C, Packets) == 0x0002A8, "Member 'UWBP_JewelryMachine_C::Packets' has a wrong offset!");
static_assert(offsetof(UWBP_JewelryMachine_C, Process) == 0x0002B0, "Member 'UWBP_JewelryMachine_C::Process' has a wrong offset!");
static_assert(offsetof(UWBP_JewelryMachine_C, State_Error) == 0x0002B8, "Member 'UWBP_JewelryMachine_C::State_Error' has a wrong offset!");
static_assert(offsetof(UWBP_JewelryMachine_C, State_Ready) == 0x0002C0, "Member 'UWBP_JewelryMachine_C::State_Ready' has a wrong offset!");
static_assert(offsetof(UWBP_JewelryMachine_C, State_Scanning) == 0x0002C8, "Member 'UWBP_JewelryMachine_C::State_Scanning' has a wrong offset!");
static_assert(offsetof(UWBP_JewelryMachine_C, WidgetSwitcher_0) == 0x0002D0, "Member 'UWBP_JewelryMachine_C::WidgetSwitcher_0' has a wrong offset!");

}

