#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Preplanning_MainMenu_PlayerReadyStatus

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Preplanning_MainMenu_PlayerReadyStatus.WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C.OnPlayerStatusUpdating__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnPlayerStatusUpdating__DelegateSignature final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          HasPlayerStatus_0;                                 // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnPlayerStatusUpdating__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnPlayerStatusUpdating__DelegateSignature");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnPlayerStatusUpdating__DelegateSignature) == 0x000018, "Wrong size on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnPlayerStatusUpdating__DelegateSignature");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnPlayerStatusUpdating__DelegateSignature, PlayerName) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnPlayerStatusUpdating__DelegateSignature::PlayerName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnPlayerStatusUpdating__DelegateSignature, HasPlayerStatus_0) == 0x000010, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnPlayerStatusUpdating__DelegateSignature::HasPlayerStatus_0' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_PlayerReadyStatus.WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C.ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus
// 0x0628 (0x0628 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZLobbyCharacterInfoUi               CallFunc_GetLobbyInfo_CharacterUIInfo;             // 0x0008(0x02D0)()
	bool                                          CallFunc_GetLobbyInfo_IsValid;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESBZOnlineCode ErrorCode)>     K2Node_CreateDelegate_OutputDelegate;              // 0x02DC(0x0014)(ZeroConstructor, NoDestructor)
	ESBZOnlineCode                                K2Node_CustomEvent_ErrorCode;                      // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZLobbyCharacterInfoUi               CallFunc_GetLobbyInfo_CharacterUIInfo_1;           // 0x02F8(0x02D0)()
	bool                                          CallFunc_GetLobbyInfo_IsValid_1;                   // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C9[0x3];                                      // 0x05C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESBZOnlineCode ErrorCode)>     K2Node_CreateDelegate_OutputDelegate_1;            // 0x05CC(0x0014)(ZeroConstructor, NoDestructor)
	ESBZOnlineCode                                K2Node_CustomEvent_ErrorCode_1;                    // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1[0x3];                                      // 0x05E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x05E8(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bInHasFocus;                          // 0x05FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FD[0x3];                                      // 0x05FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0600(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_614[0x4];                                      // 0x0614(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZOnlineSession*                      CallFunc_GetSBZOnline_ReturnValue;                 // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus) == 0x000628, "Wrong size on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus, EntryPoint) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus, CallFunc_GetLobbyInfo_CharacterUIInfo) == 0x000008, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus::CallFunc_GetLobbyInfo_CharacterUIInfo' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus, CallFunc_GetLobbyInfo_IsValid) == 0x0002D8, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus::CallFunc_GetLobbyInfo_IsValid' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus, K2Node_CreateDelegate_OutputDelegate) == 0x0002DC, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus, K2Node_CustomEvent_ErrorCode) == 0x0002F0, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus::K2Node_CustomEvent_ErrorCode' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus, CallFunc_GetLobbyInfo_CharacterUIInfo_1) == 0x0002F8, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus::CallFunc_GetLobbyInfo_CharacterUIInfo_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus, CallFunc_GetLobbyInfo_IsValid_1) == 0x0005C8, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus::CallFunc_GetLobbyInfo_IsValid_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus, K2Node_CreateDelegate_OutputDelegate_1) == 0x0005CC, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus, K2Node_CustomEvent_ErrorCode_1) == 0x0005E0, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus::K2Node_CustomEvent_ErrorCode_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus, CallFunc_Play2DSound_ReturnValue) == 0x0005E4, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus, K2Node_CreateDelegate_OutputDelegate_2) == 0x0005E8, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus, K2Node_Event_bInHasFocus) == 0x0005FC, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus::K2Node_Event_bInHasFocus' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus, K2Node_CreateDelegate_OutputDelegate_3) == 0x000600, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus, CallFunc_GetSBZOnline_ReturnValue) == 0x000618, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus::CallFunc_GetSBZOnline_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus, K2Node_Event_IsDesignTime) == 0x000620, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_PlayerReadyStatus.WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_PreConstruct");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_PreConstruct");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_PlayerReadyStatus.WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C.ButtonFocusedChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ButtonFocusedChanged final
{
public:
	bool                                          bInHasFocus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ButtonFocusedChanged) == 0x000001, "Wrong alignment on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ButtonFocusedChanged");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ButtonFocusedChanged) == 0x000001, "Wrong size on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ButtonFocusedChanged");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ButtonFocusedChanged, bInHasFocus) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_ButtonFocusedChanged::bInHasFocus' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_PlayerReadyStatus.WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C.OnMMStopped
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnMMStopped final
{
public:
	ESBZOnlineCode                                ErrorCode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnMMStopped) == 0x000001, "Wrong alignment on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnMMStopped");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnMMStopped) == 0x000001, "Wrong size on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnMMStopped");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnMMStopped, ErrorCode) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnMMStopped::ErrorCode' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_PlayerReadyStatus.WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C.OnLobbyUpdate
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnLobbyUpdate final
{
public:
	ESBZOnlineCode                                ErrorCode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnLobbyUpdate) == 0x000001, "Wrong alignment on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnLobbyUpdate");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnLobbyUpdate) == 0x000001, "Wrong size on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnLobbyUpdate");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnLobbyUpdate, ErrorCode) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnLobbyUpdate::ErrorCode' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_PlayerReadyStatus.WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C.GetLobbyInfo
// 0x02F0 (0x02F0 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_GetLobbyInfo final
{
public:
	struct FSBZLobbyCharacterInfoUi               CharacterUIInfo;                                   // 0x0000(0x02D0)(Parm, OutParm)
	bool                                          IsValid;                                           // 0x02D0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZLobbyCharacterInfoUi>       CallFunc_GetUiLobbyInfo_OutInfo;                   // 0x02D8(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_GetLobbyInfo) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_GetLobbyInfo");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_GetLobbyInfo) == 0x0002F0, "Wrong size on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_GetLobbyInfo");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_GetLobbyInfo, CharacterUIInfo) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_GetLobbyInfo::CharacterUIInfo' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_GetLobbyInfo, IsValid) == 0x0002D0, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_GetLobbyInfo::IsValid' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_GetLobbyInfo, CallFunc_GetUiLobbyInfo_OutInfo) == 0x0002D8, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_GetLobbyInfo::CallFunc_GetUiLobbyInfo_OutInfo' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_GetLobbyInfo, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0002E8, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_GetLobbyInfo::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_PlayerReadyStatus.WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C.CleanWidget
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_CleanWidget final
{
public:
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0000(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_CleanWidget) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_CleanWidget");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_CleanWidget) == 0x000028, "Wrong size on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_CleanWidget");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_CleanWidget, CallFunc_GetText_ReturnValue) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_CleanWidget::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_CleanWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_CleanWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_PlayerReadyStatus.WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C.SetPlayerUIInfo
// 0x05D8 (0x05D8 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo final
{
public:
	struct FSBZLobbyCharacterInfoUi               InCharacter;                                       // 0x0000(0x02D0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x02D8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x02F0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0330(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0340(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0358(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0378(0x0018)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_ByteByte_ReturnValue;           // 0x0392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_ByteByte_ReturnValue;        // 0x0393(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0395(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0396(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_397[0x1];                                      // 0x0397(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0398(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x03B0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x03C8(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x03E0(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x03FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x040C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41D[0x3];                                      // 0x041D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0420(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedPlayerNoName_ReturnValue;     // 0x0438(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x0450(0x0018)()
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0468(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0478(0x0018)()
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0498(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x04D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x04E8(0x0018)()
	class USBZBlockedPlayerManager*               CallFunc_Get_ReturnValue;                          // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZSideBarNotificationData            K2Node_MakeStruct_SBZSideBarNotificationData;      // 0x0508(0x0040)()
	bool                                          CallFunc_IsPlayerBlocked_ReturnValue;              // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x054A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54B[0x5];                                      // 0x054B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_2;               // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           CallFunc_GetSpriteForNebula_ReturnValue;           // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput; // 0x0560(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0570(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_3;               // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           CallFunc_GetSpriteForPlatform_ReturnValue;         // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput_1; // 0x0598(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class USBZColorStyle*                         Temp_object_Variable;                              // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_4;                           // 0x05B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         Temp_object_Variable_1;                            // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZColorStyle*                         K2Node_Select_Default_5;                           // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo) == 0x0005D8, "Wrong size on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, InCharacter) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::InCharacter' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, Temp_bool_Variable) == 0x0002D0, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, Temp_text_Variable) == 0x0002D8, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, K2Node_MakeStruct_FormatArgumentData) == 0x0002F0, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, K2Node_MakeArray_Array) == 0x000330, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x000340, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_Format_ReturnValue) == 0x000358, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_TextIsEmpty_ReturnValue) == 0x000370, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000378, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_MakeLiteralByte_ReturnValue) == 0x000390, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000391, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_LessEqual_ByteByte_ReturnValue) == 0x000392, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_LessEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_GreaterEqual_ByteByte_ReturnValue) == 0x000393, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_GreaterEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, Temp_bool_Variable_1) == 0x000394, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_BooleanAND_ReturnValue) == 0x000395, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_BooleanOR_ReturnValue) == 0x000396, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, Temp_text_Variable_1) == 0x000398, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, Temp_text_Variable_2) == 0x0003B0, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, K2Node_Select_Default) == 0x0003C8, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, K2Node_Select_Default_1) == 0x0003E0, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, Temp_bool_Variable_2) == 0x0003F8, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, Temp_struct_Variable) == 0x0003FC, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, Temp_struct_Variable_1) == 0x00040C, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, Temp_bool_Variable_3) == 0x00041C, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, K2Node_Select_Default_2) == 0x000420, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_GetUIManager_ReturnValue) == 0x000430, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_GetLocalizedPlayerNoName_ReturnValue) == 0x000438, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_GetLocalizedPlayerNoName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, K2Node_Select_Default_3) == 0x000450, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, Temp_struct_Variable_2) == 0x000468, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000478, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_GetUIManager_ReturnValue_1) == 0x000490, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, K2Node_MakeStruct_FormatArgumentData_1) == 0x000498, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, K2Node_MakeArray_Array_1) == 0x0004D8, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_Format_ReturnValue_1) == 0x0004E8, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_Get_ReturnValue) == 0x000500, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, K2Node_MakeStruct_SBZSideBarNotificationData) == 0x000508, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::K2Node_MakeStruct_SBZSideBarNotificationData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_IsPlayerBlocked_ReturnValue) == 0x000548, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_IsPlayerBlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_Not_PreBool_ReturnValue) == 0x000549, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_BooleanAND_ReturnValue_1) == 0x00054A, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_GetUIManager_ReturnValue_2) == 0x000550, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_GetUIManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_GetSpriteForNebula_ReturnValue) == 0x000558, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_GetSpriteForNebula_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput) == 0x000560, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, Temp_struct_Variable_3) == 0x000570, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_GetUIManager_ReturnValue_3) == 0x000580, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_GetUIManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_GetSpriteForPlatform_ReturnValue) == 0x000588, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_GetSpriteForPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, Temp_bool_Variable_4) == 0x000590, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput_1) == 0x000598, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, Temp_object_Variable) == 0x0005A8, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, K2Node_Select_Default_4) == 0x0005B0, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, Temp_object_Variable_1) == 0x0005C0, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, Temp_bool_Variable_5) == 0x0005C8, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo, K2Node_Select_Default_5) == 0x0005D0, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetPlayerUIInfo::K2Node_Select_Default_5' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_PlayerReadyStatus.WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C.OnControlsReferencePressed
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnControlsReferencePressed final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnControlsReferencePressed) == 0x000004, "Wrong alignment on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnControlsReferencePressed");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnControlsReferencePressed) == 0x000010, "Wrong size on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnControlsReferencePressed");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnControlsReferencePressed, ActionName) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnControlsReferencePressed::ActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnControlsReferencePressed, K2Node_SwitchName_CmpSuccess) == 0x00000C, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnControlsReferencePressed::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_PlayerReadyStatus.WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C.OnFocusedVisuals
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnFocusedVisuals final
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnFocusedVisuals) == 0x000004, "Wrong alignment on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnFocusedVisuals");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnFocusedVisuals) == 0x000008, "Wrong size on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnFocusedVisuals");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnFocusedVisuals, bIsFocused) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnFocusedVisuals::bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnFocusedVisuals, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_OnFocusedVisuals::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_PlayerReadyStatus.WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C.RefreshVisual
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_RefreshVisual final
{
public:
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_RefreshVisual) == 0x000001, "Wrong alignment on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_RefreshVisual");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_RefreshVisual) == 0x000001, "Wrong size on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_RefreshVisual");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_RefreshVisual, CallFunc_HasKeyboardFocus_ReturnValue) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_RefreshVisual::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_PlayerReadyStatus.WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C.SetLobbyOwnerVisibility
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetLobbyOwnerVisibility final
{
public:
	class FString                                 InUserID;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_IsSessionHosted_OutHostId;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSessionHosted_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetLobbyOwnerVisibility) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetLobbyOwnerVisibility");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetLobbyOwnerVisibility) == 0x000030, "Wrong size on WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetLobbyOwnerVisibility");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetLobbyOwnerVisibility, InUserID) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetLobbyOwnerVisibility::InUserID' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetLobbyOwnerVisibility, Temp_bool_Variable) == 0x000010, "Member 'WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C_SetLobbyOwnerVisibility::Temp_bool_Variable' has a wrong offset!");
