#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_CombinedHealthArmourBar

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_CombinedHealthArmourBar.WBP_UI_Widget_CombinedHealthArmourBar_C.ExecuteUbergraph_WBP_UI_Widget_CombinedHealthArmourBar
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_Widget_CombinedHealthArmourBar_C_ExecuteUbergraph_WBP_UI_Widget_CombinedHealthArmourBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Widget_SegmentedAttributeBar_C* K2Node_DynamicCast_AsWBP_UI_Widget_Segmented_Attribute_Bar; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsReplenishingArmor;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_CombinedHealthArmourBar_C_ExecuteUbergraph_WBP_UI_Widget_CombinedHealthArmourBar) == 0x000008, "Wrong alignment on WBP_UI_Widget_CombinedHealthArmourBar_C_ExecuteUbergraph_WBP_UI_Widget_CombinedHealthArmourBar");
static_assert(sizeof(WBP_UI_Widget_CombinedHealthArmourBar_C_ExecuteUbergraph_WBP_UI_Widget_CombinedHealthArmourBar) == 0x000018, "Wrong size on WBP_UI_Widget_CombinedHealthArmourBar_C_ExecuteUbergraph_WBP_UI_Widget_CombinedHealthArmourBar");
static_assert(offsetof(WBP_UI_Widget_CombinedHealthArmourBar_C_ExecuteUbergraph_WBP_UI_Widget_CombinedHealthArmourBar, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_CombinedHealthArmourBar_C_ExecuteUbergraph_WBP_UI_Widget_CombinedHealthArmourBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_CombinedHealthArmourBar_C_ExecuteUbergraph_WBP_UI_Widget_CombinedHealthArmourBar, K2Node_DynamicCast_AsWBP_UI_Widget_Segmented_Attribute_Bar) == 0x000008, "Member 'WBP_UI_Widget_CombinedHealthArmourBar_C_ExecuteUbergraph_WBP_UI_Widget_CombinedHealthArmourBar::K2Node_DynamicCast_AsWBP_UI_Widget_Segmented_Attribute_Bar' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_CombinedHealthArmourBar_C_ExecuteUbergraph_WBP_UI_Widget_CombinedHealthArmourBar, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_UI_Widget_CombinedHealthArmourBar_C_ExecuteUbergraph_WBP_UI_Widget_CombinedHealthArmourBar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_CombinedHealthArmourBar_C_ExecuteUbergraph_WBP_UI_Widget_CombinedHealthArmourBar, K2Node_Event_bIsReplenishingArmor) == 0x000011, "Member 'WBP_UI_Widget_CombinedHealthArmourBar_C_ExecuteUbergraph_WBP_UI_Widget_CombinedHealthArmourBar::K2Node_Event_bIsReplenishingArmor' has a wrong offset!");

// Function WBP_UI_Widget_CombinedHealthArmourBar.WBP_UI_Widget_CombinedHealthArmourBar_C.BP_OnReplenishArmorChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_CombinedHealthArmourBar_C_BP_OnReplenishArmorChanged final
{
public:
	bool                                          bIsReplenishingArmor;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_CombinedHealthArmourBar_C_BP_OnReplenishArmorChanged) == 0x000001, "Wrong alignment on WBP_UI_Widget_CombinedHealthArmourBar_C_BP_OnReplenishArmorChanged");
static_assert(sizeof(WBP_UI_Widget_CombinedHealthArmourBar_C_BP_OnReplenishArmorChanged) == 0x000001, "Wrong size on WBP_UI_Widget_CombinedHealthArmourBar_C_BP_OnReplenishArmorChanged");
static_assert(offsetof(WBP_UI_Widget_CombinedHealthArmourBar_C_BP_OnReplenishArmorChanged, bIsReplenishingArmor) == 0x000000, "Member 'WBP_UI_Widget_CombinedHealthArmourBar_C_BP_OnReplenishArmorChanged::bIsReplenishingArmor' has a wrong offset!");

}

